[
    [
        "Senior ORACLE Database Administrator",
        "Posting ID:\n20152\n\nPosition Type:\nRegular/Full-Time\n\nCity:\nVancouver, BC, Canada\n\nLocation:\nVancouver H/O - Canfor/CWPM_1000 (BC13)\n\nCanfor’s strength comes from the diversity of our skilled and resilient workforce. As our company continues to grow and diversify, so do our career opportunities. Let us take this opportunity to tell you how you could be the best fit for Canfor.\n\nThe Opportunity:\nThe Senior ORACLE Database Administrator (DBA) is responsible for all aspects of corporate database strategy, planning, security, implementation, consulting, and technical support. The DBA evaluates, selects, and implements database software, utilities, and hardware to meet corporate business systems requirements according to the principles and policies of Information Technology architecture as defined by senior management.\n\nThe goal of the Database Administrator is to develop efficient and effective facilities and procedures for the design, storage, maintenance, and protection of the corporate data resource. The position generally is involved in a number of projects at once and may require work outside of regular business hours. This position will also participate in on-call rotation for IT operations support and up to 15% travel may be involved.\n\nThis role can be based out of either our Head Office in Vancouver, BC or our Canfor Administration Centre in Prince George, BC.\n\nKey Responsibilities:\n\nDatabase & Strategy Planning\nDevelop and evolve a Database strategy which defines the Information infrastructure necessary to meet Canfor systems requirements in a cost-optimized, secure, reliable, performance efficient, operationally excellent, and timely manner.\nEvaluate and recommend new Database technologies or enhancements as they become available and are appropriate to the business requirements.\nPerform Database architecture design and planning activities to implement Database technologies for all divisions.\nDevelop and implement Database security standards and guidelines.\nDevelop programs, utilities, and scripts to assist in controlling and reporting of Database security and access.\nDevelop and implement backup and recovery strategies for all Databases.\nMonitor and maintain Database integrity.\n\nSecurity\nWorking with the Security Team, implement secure infrastructure strategies, systems, and projects\nConsulting directly with an IT Security Administrator to ensure that Database system security procedures are consistent with Corporate policy.\nDevelop processes for optimizing database security.\nManage database access.\nOperations\nResponsible for installation, patching, upgrades, and managing database applications.\nPerformance tuning & optimization of database systems.\nResponsible for participating in Technical Deep-Dives including Root Cause Analysis\nMentoring and educating IT Infrastructure and IT team members on database - technical, process, and best practices.\nDiagnose and troubleshoot database errors.\nCreate and manage database reports, visualizations, and dashboards.\n\nProjects\nProject management for internal IT infrastructure projects\nResponsible for ensuring projects deliver on the database infrastructure architectural requirements\n\nThe Candidate:\nTechnical School diploma Database Administration or a University degree plus a minimum of 10 years progressively more responsible experience in Information Services including at least 5 years as a Database Administrator OR an equivalent combination of education and experience.\nDemonstrated experience with ORACLE database, and other database technologies\nImpeccable attention to detail\nAdvanced knowledge of database security, backup and recovery, and performance monitoring standards\nProficient in ITIL strategies and operations\nUses systematic and logical approach to analyzing problems and researching information. Explores various alternatives and implements action plans to resolve problems\nSelf-starter, able to work independently with minimal supervision\nStrong mathematical and statistical knowledge\n\nSkills and Abilities:\nStrong command of SQL and SQL server tools\nDemonstrated experience with Amazon Web Services (AWS)\nDemonstrated experience with Virtualization Technologies such as VMware, and Citrix\nDemonstrated experience with Microsoft Technologies including Windows, Active Directory, etc.\nDemonstrated experience with Linux\nDemonstrated experience with storage systems such as NAS and SAN\nExperience with Disaster Recovery and Business Continuity planning\nAn extensive knowledge of Networking and Internet based protocols such as TCP/IP, DNS, Ethernet, VPN, etc.\nDemonstrated knowledge of Capacity and Performance Planning, & Monitoring\nWorking knowledge of System Interfaces and EDI\nUnderstanding of relational and dimensional data modeling\nPowerShell and Unix/Linux shell scripting skills\n\nOur Talent Acquisition team is actively recruiting on this role and in order to be considered, please apply today!\n\nAt Canfor, diversity means understanding, recognizing and valuing the differences that make each person unique. We see inclusion and diversity as an essential part of our productivity, creativity, innovation and competitive advantage. We strive for a fair and equitable recruitment process, where hiring decisions are based on the individual qualifications and experience of each applicant.\n\nWe are not your run of the mill forest products company, join us and find out why. #canfortalent\n\nFollow us on LinkedIn, Twitter, and Facebook for Canfor news, career opportunities, and upcoming events!\n\nVancouver, BC\nThe city of Vancouver is both a natural beauty and a progressive urban centre, a rare place on earth that is idyllic and electric all at once. With one of Canada’s mildest climates, Vancouver is ideally suited for those devoted to outdoor pursuits, health and wellness. Along with its endless supply of fresh air and clean water, Vancouver also boasts countless choices for culturally diverse, world-class cuisine and an inventory of arts and entertainment events. For more information, visit http://canfor.com/our-company/our-communities/vancouver\n\n#ind123\n30+ days ago\nReport job"
    ],
    [
        "Database Administrator (MS SQL Server)",
        "Seeking a Database Administrator (12 month contract, possibility of extension) that specialises in Data Migration to lead the migration of client’s data into our solutions, optimizing our existing databases and maintain our database environments. Responsible for the developing and implementing migration scripts, creating test plans to confirm the success of the migration and moving the data into production.\nEstablished in 2008, Run Straight (www.RunStraight.com) has been developing solutions for federal and provincial governments as well as the broader public sector and not-for-profit agencies to address the complex and changing needs of their operations. Our office is centrally located in Port Credit, Ontario (Hurontario & QEW) close to Mississauga transit stops and the Port Credit GO Train station.\nResponsibilities and Duties\nStrong knowledge of MS SQL Server and related tools\nExperience in migrating data from a variety of sources into MS SQL Server\nLeading the migration of client data into our solution and related QA\nAbility to analyze database performance including determining bottlenecks, optimizing queries, indexes and transaction rates.\nExperience in planning, designing, implementing and maintaining databases.\nRecommends solutions by defining database physical structure and functional capabilities, database security, data back-up, and recovery specifications.\nMaintains quality service by establishing and enforcing organization standards.\nParticipates as an active and core member of the Scrum team and sprint planning to ensure quality is built in to products and services.\nQualifications and Skills\nQualifications:\nMinimum of three years of database migration experience is required.\nCollege or university graduate in a related discipline\nComfortable in an Agile Development environment that requires the ability to adapt to change and motivate others to achieve excellence in a dynamic environment and will bring exceptional attention to detail and commitment to quality.\nDetail orientated with good organizational skills.\nExperience with MS SQL Server, MS SQL Server Management Studio and related tools, Visual Studio, Team Foundation Server/Azure DevOps, JIRA Software, Microsoft Planner\nKnowledge of Case Management Systems may be given preference.\nSoft Skills:\nAbility to work effectively in a fast-paced dynamic environment and prioritize workload and deliverables within schedule constraints to deliver results.\nPossesses the aptitude to accept complex assignments, analyze problems, and generate effective solutions.\nCommunicates tactfully and effectively, verbally and in writing, with an ability to express complex technical concepts in business terms, and maintains positive and effective work relations with those encountered in the course of employment.\nProven and demonstrable troubleshooting and analytical experience.\nPossesses and applies a broad knowledge of quality assurance testing to the completion of difficult assignments.\nNational Logistics Services (NLS)\n29 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "A service-driven paper and packaging products company, Atlantic Packaging has grown to become one of Canada’s largest paper manufacturers and a leading producer of packaging products. Our organization employs approximately 1000 people at eight manufacturing plants and four distribution centers.\nWe are looking for an Intermediate Database and Systems Administrator with a security-centric approach to provide Database Administrator and Windows System Administrator support. While striving for service excellence, you provide highly specialized support for databases that support multiple business applications and windows. The planning and implementation of policies and procedures ensure that system service and security is consistent with company goals and industry best practices.\nResponsibilities:\nDatabase Administrator Responsibilities\nAdvise and participate in analyses of business availability and performance requirements and develop, recommend, and implement operational policies and procedures, migration strategies, and procedures for individual environments that will enhance efficiency, effectiveness and provide appropriate security and safeguards.\nReview and assist technical project plans; assess impacts and risks both initial and post-implementation; identify and coordinate changes to database management systems\nAssist in a consulting capacity supporting development teams during application design and implementation phases\nWork with end-user groups, external clients, technical support organizations, or 3rd party vendors to troubleshoot database issues;\nRespond to unexpected database outages; determine failed component(s) and extent of impact; identify options and select and assign remedial and recovery activities; escalate issues to other sections and vendors as required; ensure status of problem is being tracked, logged, and communicated; rectify problems with database components; develop and implement data restoration procedures as required; participate in debriefing the outage and develop measures to prevent reoccurrence\nEnsure continuous 24x7 availability, reliability, and optimal performance of production MS SQL Server databases, engaging with Microsoft support as required to resolve complex issues\nRegular monitoring and improvement of database performance; SQL Profiler, query and index performance tuning, and performance recommendations to development and hardware teams\nWindows System Administrator Responsibilities\nAssess the stability, security, and scalability of installed Windows systems\nDiscuss system and server upgrades with IT managers. Install and upgrade as required.\nProvide technical support for staff and back-end system users.\nTroubleshoot system and server errors\nMonitor and update the Windows codebase\nManage user access\nMonitor system performance\nMaintain server architecture security\nRequirements:\nBachelor's Degree in Computer Science, Computer Engineering or related field.\n5+ years professional experience with both database and windows administration\nSome understanding of Business Intelligence tools and framework; specific experience with Microsoft SQL Server Analytical Services including integration with Azure and associated reporting tools is a bonus\nA team player with excellent communication skills with the ability to communicate highly technical information to both technical and non-technical personnel.\nStrong analytical thinking and problem-solving abilities\nAbility to quickly adapts to priority changes\nAtlantic Packaging is an Equal Opportunity Employer and welcomes applications from people with disabilities. Accommodations are available on request for candidates taking part in the selection process.\nWe thank all applicants for their interest; however only those considered for an interview will be contacted.\nJob Types: Full-time, Permanent\nSalary: Up to $0.10 per year\nBenefits:\nDental care\nDisability insurance\nExtended health care\nLife insurance\nVision care\nSchedule:\n8 hour shift\nExperience:\nDatabase administration: 5 years (Required)\nWindows administration: 5 years (Required)\nMicrosoft SQL Server Analytical services: 1 year (Preferred)\nWork remotely:\nNo\n11 days ago\nReport job"
    ],
    [
        "SQL Database Administrator",
        "We are Traffic Tech, the hardest working team in transport. We have one mission: to deliver the extraordinary, every time.\nWe are proud of our hard working and dynamic corporate culture. We believe that inspiring our employees and giving them opportunity for growth translates into better service for our clients. Each and every Traffic Tech employee is personally invested in ensuring our customers receive the most innovative, efficient and cost-effective solution available.\nSQL Database Administrator\nPrimary Responsibilities:\nManage SQL Server databases through multiple product lifecycle environments, from development to mission-critical production systems;\nInstall, configure, and maintain database servers and processes, including monitoring of system health and performance, to ensure high levels of performance, availability, and security;\nEnsure all database servers are backed up and perform disaster recovery testing;\nProvide database recommendations and guidance for development of internal applications and management of third-party applications.\nWhen performance issues arise, determine the most effective way to increase performance including hardware purchases, server configuration changes, or index/query changes, providing problem resolution in real time;\nTroubleshoot SQL Server service outages as they occur, including after-hours and weekends;\nPerform scheduled maintenance and support release deployment activities after hours;\nIdentify poorly-performing and resource-intensive queries and suggest ways to improve performance;\nDesign and manage indexes for existing applications, choosing when to add or remove indexes;\nShare domain and technical expertise, providing technical mentorship and cross-training to other peers and team members;\nAdvise and assist developers with database design and performance tuning of queries;\nDocument the company’s database environment.\n\nRequirements:\n5+ years MS SQL Server Administration experience required;\nExperience with High Availability (HA) and Disaster Recovery (DR) options for SQL Server including Availability Groups, preferably in a multi-datacenter environment;\nExperience with Performance Tuning and Optimization (PTO), using native monitoring and troubleshooting tools;\nExperience with migrating databases and instances to newer versions of SQL Server;\nExperience developing SQL and Transact-SQL queries and database objects;\nExperience with server and storage virtualization technologies;\nExperience working with Windows server, including Active Directory;\nExcellent written and verbal communication;\nFlexible, team player with a “get-it-done” personality;\nAbility to organize and plan work independently.\nBenefits:\nDynamic Environment and 'can-do' culture\nMedical and Dental benefits\nGym and Cafeteria on Site\nAll-day fresh and free Coffee\nFree Shuttle from/to Fairview Terminus\nIf this challenge sounds appealing to you. Please send us your resume!\nTraffic Tech has implemented preventative measures and safety precautions to ensure the safety and well-being of all persons entering Traffic Tech facilities. For example, upon arrival masks are mandatory, employees are greeted by our in-house full-time health screeners, social distancing is maintained in all common areas (6ft/2m), hand sanitizer stations are strategically spaced out around the office, there is a restricted flow of traffic within the office to avoid interdepartmental spreads or outbreaks, and increased cleaning of all office spaces and warehouses.\nTraffic Tech remains compliant with all federal and provincial COVID guidelines.\npAvGNMgxbr\n30+ days ago\nReport job"
    ],
    [
        "database administrator (DBA)",
        "Specific Skills\nCollect and document user's requirements\nDesign, construct, modify, implement and test data models and database management systems\nConduct research and provide advice to other informatics professionals regarding the selection application and implementation of database management tools\nOperate database management systems to analyze data\nResearch and document data requirements, data collection and administration policy, and data access rules\nDevelop policies and procedures for network access and usage and for the backup and recovery of data\nConduct research and provide advice to other information systems professionals regarding the collection, availability and suitability of data\nLead and co-ordinate teams of data administrators in the development and implementation of data policies, standards and models\nDevelop and implement data administration policy, standards and models\nProgramming Languages\nSQL\nOwn Tools/Equipment\nComputer\nPrinter\nInternet access\nWork Conditions and Physical Capabilities\nFast-paced environment\nSitting\nAbility to Supervise\n1 to 2 people\nComputer and Technology Knowledge\nSpreadsheet\nMS Windows\nInternet\nDatabase software\nNetworking hardware\nServers\nProgramming software\nData analysis software\nMS Office\nPersonal Suitability\nEffective interpersonal skills\nAccurate\nTeam player\nExcellent written communication\nJudgement\nOrganized\nCanadian Job Bank\n30+ days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Want to join the outstanding Software Team at Digital Domain?\n*\nDigital Domain in Vancouver is Senior Database Administrator!\n*\n*\nExperience setting up / administering Postgresdb, as well as experience designing db schemas, analyzing query performance, etc\nFamiliarity with Nosql, specifically mongodb\nExperience with python or other programming language is a plus\n*Candidates must be in US/Canada at the time of application.\nWe love to hear from you!\nPlease share with anyone you think might be interested in this opportunity.\n*\n*\nCheck out the type of work we do https://www.digitaldomain.com/\n*\nJob Types: Full-time, Permanent\nSalary: $80,000.00-$140,000.00 per year\nAdditional pay:\nOvertime pay\nBenefits:\nCasual dress\nExtended health care\nSchedule:\n8 hour shift\nWork remotely:\nTemporarily due to COVID-19\nCOVID-19 precaution(s):\nRemote interview process\n7 days ago\nReport job"
    ],
    [
        "Oracle Database Administrator for Equity Derivatives",
        "HSBC Global Services Canada Limited (HGCA), is a subsidiary of HSBC Global Services Limited, owned by HSBC Holdings plc. HGCA provides operational services to countries across the HSBC Group which is the largest and leading international bank in the Canada.\nWe help companies and individuals across Canada to manage their finances through three global business lines: Commercial Banking, Global Banking and Markets, and Wealth and Personal Banking.\nIt’s this global connectivity that you will find yourself inspired and collaborating with colleagues not just locally but also across continents and cultures.\nAbout Global Banking & Markets, IT\nGlobal Banking and Markets (GBM) provides financial services and products to corporates, governments and institutions worldwide, building partnerships with them to help them achieve consistent, long-term performance. We use the strength of HSBC’s international network to connect emerging and mature markets, covering key growth areas. Our products and services include advisory, financing, prime services, research and analysis, securities services, trading and sales, and transaction banking.\nThe Global Banking and Markets Technology team is dedicated to supporting Global Banking and Markets by working in partnership with business leaders who rely on us for delivering innovative, robust, stable platforms to enable their investment and financial solutions for clients. Join Global Banking and Markets Technology and be part of the global connectivity, collaboration and team that spans across 20 countries. The total number of successful production releases surpass some of the biggest blue chip tech companies. Canada is a key location in Global Banking and Markets Technology’s global growth strategy and is receiving global attention for its deliveries.\nKey Objectives for Oracle Database Administrator for Equity Derivatives:\nEquity Derivatives Infrastructure provides infrastructure and support services to Equity Derivatives globally from front office to post trade. Equity Derivatives IT is looking for a senior Oracle DBA to join our Infrastructure team in our Toronto Office. The DBA will work directly with a number of application teams to provide Sophis Oracle database expertise on varied change related tasks ranging from project initiation to production support across global Equities businesses, as well leading the global Derivatives DBA pod.\nThis is a great opportunity for an experienced Oracle DBA to come on board and help architect, build, standardise and run this technology stack. There is also scope for the function to be extended out to NoSQL technologies such as MongoDB.\nManage team of DBAs across regions, deliver and support high quality Oracle database services to Equity Derivatives\nPrinciple Accountabilities:\nImplementation and maintenance of database server, replication and client environments and definition of standards pertaining to the configuration and operation of database server and client components.\nProvide day to day support and technical expertise on database services to ensure the highest standards of availability, resilience, integrity, security and performance required by our business systems.\nSecurity and access control to meet internal and external audit requirements\nEnsuring that adequate provision is made for the backup and recovery of all data held within databases. Provision of resilience and contingency environments.\nOptimizing performance and ensuring effective use of hardware resources.\nDevelopment of infrastructure and investigation of 3rd party products required to provide production, test and development database services in a cost-effective manner.\nProvision of support and assistance to development teams in the design, development, testing, tuning and implementation of database applications including provision of such development and testing environments that are required.\nIdentification of opportunities to maximize exploitation of current and new products relevant to the provision of database services.\nCompliance with internal and external audit and regulatory requirements.\nEnsure project and change releases are packaged to the right quality, repeatable between environments without modification and deployed to the target\nCollaborating with the wider engineering and operational teams to resolve issues impacting Database infrastructure (e.g. IT infrastructure such as storage, VMs and networks)\nEnsure software and processes are correctly documented to ensure single points of knowledge do not become a problem\nEliminating service failures, reducing callouts, service delivery, capacity planning & delivery, compliance with audit requirements.\nQualifications\nKnowledge & experience / Qualifications:\nAble to engage at all levels with application development and support teams and other technology service providers, internal and external to Equities\nAble to deliver high quality database services which meet business requirements of performance and availability\nSelf-sufficient and adopting a business focused approach, but ensuring team standards and processes are adhered to\nAble to prioritize multiple demands for support and service delivery and present clear, evidence based solutions to project management\nFlexibility to adapt to changing requirements without compromising quality\nAbility to assess business impact of technology changes and issues and communicate/escalate these appropriately.\nA willingness and desire to expand your skillset out to other database technologies\nIn-depth knowledge of Oracle11g and 12c with good support experience in a multi-project environment\nExcellent Oracle Performance and Tuning skills including SQL, PL/SQL and database/instance tuning, Server configuration and tracing facilities, interpretation of tkprof files and event traces\nOracle Real Application Clusters\nOracle Recovery Manager\nOracle DataGuard\nHands-on in-depth experience of Veritas Cluster Server and SRDF.\nStrong experience of planning and implementing production service architectures in a multi-domain, multi-platform and multi-site environment\nStrong scripting skills – Perl/Python to perform automation, maintenance tasks and review code\nImplementing Patching and Upgrade cycles\nBasic Unix Administration (Linux)\nOracle DBA Console/Grid Control\nHands on in-depth experience with hardware clustering and disk technologies (see IDEAL requirements below)\nGood working knowledge of job scheduling & monitoring tools - preferably BMC Control-M scheduling, and BMC Patrol monitoring\nCapacity Planning & management of complete Database infrastructure.\nHands on experience to both OLTP & Data Warehouse systems\nExposure to GoldenGate\nExperience on DBA – 13 + years\nExposure to Financial Markets\nEMC San knowledge\nNetBackup\nToad\nNoSQL database administration in technologies such as MongoDB\nWorking in a DevOps capacity using scripting and tools (Jenkins) to deliver automation\nDelphix (replication tool)\nAbility to work under pressure, take ownership, and deliver to commitments\nAbility to build relationships and work as part of a team\nUnderstanding of the importance of communication in the technical environment\nEducation typically to degree level or equivalent training\nHSBC Proud\nAs a business operating in markets all around the world, we believe diversity brings benefits for our customers, our business and our people. This is why HSBC Canada is committed to being an inclusive employer and encourages applications from all suitably qualified applicants irrespective of background, circumstances, age, disability, gender identity, ethnicity, religion or belief and sexual orientation.\nIf this is not the ideal role for you, we invite you to sign up to our talent community so that we can update you about job opportunities and career events in your area of interest. We are always looking for people with purpose and ambition who can help us build the bank for the future.\nWe encourage all Indigenous peoples of North America and Persons with Disabilities to self-identify in their applications. In addition, we invite you to reach out to Matt Woods, our Diversity Recruitment Relationship Manager at matthew.r.woods@hsbc.ca for support during the selection process.\n5 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "DATABASE ADMINISTRATOR\nNUN00200\n\nWHAT DO YOU VALUE IN A CAREER?\nAt Agnico Eagle, our values never waver. We believe in trust, respect, equality, family and responsibility. Why? Because they express who we are and they have helped us succeed in business for over 60 years.\nWHAT DOES AGNICO EAGLE VALUE?\nWe value you – your unique set of skills and experience. We value your willingness to build those skills and make a meaningful contribution to our company. And, we value your commitment to treat every person on our team with respect, helping us to operate safely, protect the environment and make a positive contribution to our local communities.\nABOUT OUR OPERATION\nAgnico Eagle has three active properties in Nunavut. The Meadowbank open-pit mine, in operation since 2010; the Amaruq satellite deposit, which is 50 kilometers northwest of Meadowbank and the Meliadine underground mine, in operation since 2019. To support the Nunavut projects, Agnico Eagle has staff based out of 2 regional offices, located in Val d’Or and Mirabel, Quebec.\nYOUR NEXT CHALLENGE:\n\nReporting to Senior Coordinator Social Performance, the Database Administrator works in close collaboration with all members of the Nunavut Community Relations Department. He/she plays an important role in governance and database optimization, as well as ensuring data quality and analysis. The Database Administrator is in charge of database management, data reporting and data automation related to Community Relations projects and activities impacting or involving Kivalliq communities, groups or individuals. This role also supports project management activities.\nData\nAnalyze data quality from data sources to ensure accuracy in relation to a range of KPIs and requirements;\nImprove and automate data entry for better monitoring performance;\nManage database and proceed with data entry quality exercise – both quantitative and qualitative;\nSystem\nIntegrate and maintain links between different systems and data sources (both internally and externally to Agnico Eagle);\nDevelop internal system or tools to support data analysis and integration;\nDevelop and automate reports generated for different users and projects;\nSuggest improvements to be made to data processing;\nDevelop data management architecture and process documentation;\nUsers\nSupport users in data population and system management;\nPerform project management controls and project closure documentation.\n\nWHAT YOU NEED TO SUCCEED\nBachelor’s degree in Business Analytics, Business Intelligence, Business, IT, Project Management or equivalent;\n2-5 years of experience in a related field;\nAdvanced computing skills, experience in creating database queries and data modelling;\nExcellent knowledge of Excel;\nExperience in development or programming;\nKnowledge of PowerBI and Access is an asset;\nKnowledge of Borealis or other engagement and stakeholder system is an asset;\nCultural awareness and understanding of work in the Canadian Arctic is an asset;\nExcellent interpersonal and communication skills and the ability to work in a team;\nHave an analytic, problem solving, detail-oriented and quality-oriented profile;\nCapacity to work without direct supervision;\nAdvanced English language skills, written and spoken. Selected candidates must attain a passing mark on a SPEEXX English language assessment.\nYour Work Schedule\nSchedule: Monday to Friday; position can be based in Val d’Or, Mirabel (Quebec), Rankin Inlet or Baker Lake (Nunavut) with occasional presence at the Kivalliq communities and mine sites in Nunavut. During the COVID-19 pandemic, you will work from home.\n\nJob:\nCommunications\nPrimary Location:\nNunavut\nOrganization:\nAgnico Eagle Mines\nSchedule:\nFull-time\nShift Schedule:\n5/2\nEmployment Type Code:\nSalaried\nPosting End Date:\nMar 14, 2021, 10:59:00 PM\n9 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Database Administrator\nCanada Ontario, Canada Toronto, ON, Canada Req #21\nSaturday, February 27, 2021\nThe Company:\nAudienceView is an organization of people who are passionate about the business of live events. We create industry-leading software solutions that fuel attendee engagement, ticket sales, and advertising solutions for close to 8,000 higher education, music, and theatre venues in 15 countries around the world. AudienceView employees share a vision to help entertainment organizations deliver exceptional experiences for people who love live events. We achieve this through innovative technology, popular media brands, effective distribution strategies and a dedicated team of experts that help propel our clients’ success every single day.\nResponsibilities:\nMonitor and investigate system and database problems, identify their source, determine possible solutions and provide remediation plans for optimization and problem resolution\nPerform all database maintenance, develop, implement and maintain policies and procedures necessary to ensure the security and integrity of the databases in the SaaS environment\nTune server and database configurations to ensure optimal performance and reliability\nDesign and implement Disaster Recovery Plans including: Backups, Mirroring, Clustering, and Replication\nRespond to all inquiries regarding database performance, functionality and configuration from internal support staff, stakeholders and external clients.\nAssist in developing streamlined and automated processes to improve delivery and support of database services\nPerform database operational tasks including: installs, migrations, upgrades, lifecycle management\nHelp maintain the \"best practices\" policies for DB administration tasks\nDocument standard operating procedures and build books for database tasks\n\nRequirements:\nIntermediate level of database administration and support in an enterprise environment\nExperience with cloud providers (AWS & Azure)\nExtensive practical experience working with Microsoft SQL Server 2012/2016\nExperience with 24x7 production databases and ability to respond to support issues same-day or per SLA\nExpertise with configuring, implementing and supporting large high availability SQL Server environments, including experience with clustering, log shipping, database mirroring, Failover Clustered Instance (FCI) and Always-On Availability Groups (AAG)\nExtensive experience with SQL backups, restores and recovery models\nExperience in implementing operational automation using scripts (i.e. Powershell)\nExperience in working with Linux servers\nKnowledge of indexes, index management, and statistics\nExperience in troubleshooting and resolving database problems\nExperience with MSSQL migrations to PostgreSQL/MySQL\nExperience in Performance Tuning and Optimization (PTO), using native monitoring and troubleshooting tools\nExperience with VMWare, Active Directory, WAN/LAN, multiple operating systems or other network administrator related components an asset\nExperience with cloud database services is a plus (e.g. AWS RDS, MySQL, SimpleDB)\nMicrosoft certification MCSA SQL is a plus\n\nWhy AudienceView:\nAudienceView is the leading provider of e-commerce solutions to some of the world’s biggest ticket resellers and venues who are shaping the future of ticket sales and event promotions.\nSpecialized in end-to-end e-commerce ticketing and event CRM across multiple markets.\nCompany repositioning for rapid-paced growth ensuring great career opportunities for motivated professionals.\nLocated in the heart of downtown Toronto a respected hub of the Toronto tech community.\nCompetitive salary with performance review and personal growth.\nExcellent benefits.\nFlexible hours and work remote opportunities.\nEmployee social lounge and dynamic Social Events team.\nPartner with Customers who are leaders in online ticketing sales around the world.\nExciting customer markets in sports, performing and more\n\nDiversity and inclusion have always been at the core of our values at AudienceView. A diverse workforce with wide perspectives and creative ideas benefits our clients, the communities where we operate and all of us as colleagues. We welcome applications from qualified individuals from all backgrounds.\nPersons with disabilities who need accommodation in the application process or those needing job postings in an alternative format may e-mail a request to peopleteam@audienceview.com.\nOther details\nPay Type\nSalary\n7 days ago\nReport job"
    ],
    [
        "Database Administrator II",
        "Job Type: Full Time, Permanent\nStart Date: As soon as possible\n\nLanguage: English\nMinimum Education: Bachelor's Degree\nPositions Available: 2\n\nNOC Group: Database Analysts and Data Administrators (2172)\nNOC Job Title: Database Administrator (DBA)\nExpires in 20 days\nExpires: 2021-03-26\nPosted: 2021-03-04\nLast Updated: 2021-03-04\n\nJob Location(s)\n6951 Westminster Hwy\nRichmond, British Columbia\nV7C 1C6, Canada\nJob Description\nAs a database administrator II you will:\nCollaborate with other team members on creation, maintenance, configuration and support of database instances.\nCollaborate with software developers in order to set up the monitoring of production databases including availability, performance, deadlocks, as well as looking at real-time and historical performance.\nRespond to database system monitoring alerts and exceptions and provide database system problem recovery and resolution\nManage database instance performance tuning and implementation of database system software tuning improvements\nCollaborate with software developers to perform application database performance tuning such as application query tuning, index creation, optimizer hints, and table and data model modifications\nCollaborate with the security team on developing database security standards and practices by developing scripts that will perform security health checks for review by security and the manager of database services\nCreate, implement, and execute database cloning procedures to support application requirements and development and testing cycles\nDevelop, plan and execute tasks in collaboration with other team members and service providers in the refresh and masking of nonproduction systems including provide problem resolution to support iterative application development and cycles\nParticipate in the Disaster Recovery plan, documentation and execution\nPerform or provide support on the different database restore processes required for a point in time recovery\nSupport, maintain and develop new ETL/replication processes\nPerform data corrections and manipulation processes and collaborate with software developers on the process to ensure audit requirements are met\nProvide direction to teams for their requirements on the development of data models, logical application database designs to finalize and implement the physical application database designs\nDefine and implement application schema access and security policies, and approved accesses to enterprise data\nCreate and implement application database objects, conversion of database structures, and migration of database objects between application environments\nIdentify and implement opportunities for improvement in the area of process, technology and people\nDevelop scripts for all activities and automate where it provides value. Also provide guidance to other team members\n\nWe're looking for someone who can:\nAnticipate, organize and prioritize work to meet both short- and long-term goals and outcomes\nTake initiative to advise, persuade and motivate others to act in a recommended way in an environment of minimal supervision\nLead by example by taking initiative, assuming responsibility for issues and following through to appropriate resolution\nClearly document and convey, both verbally and in writing, a variety of technical information to technical and non-technical persons\nListen, clarify and comprehend information\nMaintain personal and team effectiveness by adapting and adjusting to changes and difficult situations\nImplement an appropriate solution using judgement and resourcefulness in sometimes difficult circumstances\nPromote agile principles to assist the evolution and maturity of Agile and DevOps at WorkSafeB\nRelated Document(s)\nDatabase Administrator II.docx\nHow to Apply\nExpiring: Mar 26, 2021\nWorkBC\n2 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Post End Date:\nNote to all candidates: This posting will close at 12:01 am on the date listed .\nMarch 22, 2021\n*Please note this is a 2-year fixed term position with benefits**\nA Day in the Life…\nWorking as a member of the Enterprise Solutions team, the Database Administrator (Level 2) oversees and is responsible for the design, development, maintenance and support of enterprise and application databases ensuring data integrity, integration of systems, high performance, high availability and recoverability.\nAs the Database Administrator, Level 2 you will:\nContributes to the development and maintenance of database standards based on industry leading practice, in order to ensure effective database creation and operation, and standard naming conventions in database development in order to ensure effective system maintenance and support;\nContributes to the creation and implementation of programming standards for database objects and standards for access and use of the database to ensure it is the central repository of information for the University;\nConducts regular code reviews to ensure all applicable policies, procedures and standards are adhered to ensuring consistency in all database development;\nImplements effective control protocols for system access to all databases ensuring outside sources are not permitted to directly interact with the database;\nMeets with relevant stakeholders to understand and develop user requirements and specifications for the creation or amendment/updating of databases;\nAnalyze, design and develop ETL (Extract, Transform & Load) processes to ensure effective database function and operation, database applications within defined specifications to meet user needs, and integrations between disparate applications to ensure effective information management and transfer;\nProduces database diagrams for documentation to support the design process with end-users, as well as support ongoing maintenance and future updating;\nPlan, estimate and schedule tasks assigned to meet deliverables and timelines, using effective project management standards, in order to facilitate timely work completion;\nDesigns database automation, where possible, to reduce manual data management efforts, and support timely execution of regular data management and transformation activities;\nPerforms regular database maintenance, performance monitoring, load testing and support activities in order to ensure ongoing system performance meets defined standards; maintain and test recovery plans and backup procedures based on industry best practices to protect access to important data and systems;\nResponsible for capacity planning, which includes analyzing database activity and growth to understand proper space available for growth;\nWork collaboratively with the Infrastructure team to ensure proper resources are available to the database and schedule upgrades as required to ensure the platform remains current;\nDiagnose and troubleshoot database errors, providing solutions to issues identified;\nResponsible for recommending, creating and maintaining archival databases and other auxiliary databases that will enhance the University’s access to information while ensuring consistency, accuracy and optimum performance;\nParticipate in the timely migration or replacement of IT systems before the University is adversely impacted by inadequate systems;\nManage the security and disaster recovery aspects of a database; ensure the creation of a secure environment for development, user acceptance quality assurance testing (QA) and production, ensuring the consistency of data objects between the environments;\nImplement and support data governance as determined by the University policy and guidelines;\nProvide SQL expertise to all members of Enterprise Solutions as applicable, including assisting with queries that are more complex and require greater understanding and experience of the database and its capabilities than generally understood;\nPropose design recommendations and optimizations working with Business Analysts and application developers and others as a member of project teams to support project success;\nWork with vendors in evaluating and implementing new technologies that must interface with enterprise systems;\nTroubleshoot and resolve database problems using native and third party monitoring and troubleshooting tools;\nResearch, recommend and as approved, implement emerging database technologies that support a more stable, user friendly IT infrastructure;\nAll other related duties as required and/or assigned by the IT Manager, Applications Architect, or designate.\nIrregular hours are required throughout the year to meet deadlines.\nWhat you need to Succeed…\nA bachelor’s degree in Computer Science or related field or equivalent experience;\nBetween four to ten years of experience in database development with SQL Server, MySQL or equivalent;\nAt least two years of experience coordinating and supporting IT business processes;\nAbility to work remotely via reliable high-speed internet connectivity;\nSkilled in SQL database management knowledge and skills, including design, development and maintenance of large/complex databases using leading software (e.g. MS SQL Server, MySQL);\nAbility to monitor and tune database performance;\nAbility to design backup and recovery strategies;\nKnowledge of configuration and setup of database servers to support enterprise databases (Unix, Linux, Windows);\nUnderstanding and knowledge of Business Continuity and Disaster Recovery planning;\nDemonstrated ability for thorough and accurate programming and database work;\nDemonstrated analysis and trouble shooting skills;\nUnderstanding of full database development and maintenance life cycle;\nDemonstrated ability to learn, understand and apply new technologies to the advantage of the University;\nAbility to manage time and set priorities working with multiple users, tasks, projects and deadlines in a high-pressure environment;\nOne year to become fully familiar with University direction, policies, procedures and IT systems;\nProvide clear, understandable written and oral documentation and presentations for recommendations, designs and solutions for a variety of technical and non-technical audiences;\nAbility to negotiate solutions with clients throughout the University that can be effectively implemented;\nFoster and develop an environment of teamwork and collaboration;\nAbility to work both independently as well as in a team-oriented, collaborative environment;\nProvide regular feedback, acknowledges success and the need for improvement;\nCoach and mentor junior staff members in order to develop skills and confidence;\nFosters a climate of transparency, trust, and respect within the unit and in partnerships;\nStrong situation assessment and problem-solving skills;\nAbility to quickly evaluate options, make decisions and execute within an intense high-tech environment;\nStrong investigation and analysis skills, able to assess issues across multiple software applications and platforms;\nAble to decipher cryptic issues and create innovative solutions.\nSalary and Benefit Information\nJob Grade M ($60,767-$86,531) per annum;*\nThis is a 2-year fixed term position with benefits;\nThis position includes comprehensive benefits coverage.\n* The salary range indicated is representative of all positions evaluated at this level. Actual salary is determined by assessing related skills, experience, internal equity and market competitiveness, subject to available budget.\nBrock University is actively committed to diversity and the principles of Employment Equity and invites applications from all qualified candidates. Women, Indigenous peoples, members of visible minorities, and people with disabilities are encouraged to apply. We will accommodate the needs of the applicants and the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA) throughout all stages of the selection process, as outlined in the Employee Accommodation Policy https://brocku.ca/policies/wp-content/uploads/sites/94/Employment-Accommodation-Policy.pdf. Information received relating to accommodation measures will be addressed confidentially.\nIt is Brock University’s policy to give consideration to qualified internal applicants.\nWe appreciate all applications received; however, only candidates selected for an interview will be contacted.\nAs a result of Brock University’s current remote operational model, interviews at this time will be conducted virtually.\nLearn more about Brock University by visiting www.brocku.ca\nReference ID: JR-1008015\nContract length: 24 months\nApplication deadline: 2021-03-22\nJob Type: Contract\nSalary: $60,767.00-$86,531.00 per year\nBenefits:\nExtended health care\nPaid time off\nSchedule:\n8 hour shift\nWork remotely:\nTemporarily due to COVID-19\nCOVID-19 precaution(s):\nRemote interview process\nVirtual meetings\n4 days ago\nReport job"
    ],
    [
        "Database Administrator – DB2 LUW",
        "Database Administrator - DB2 LUW\nOn behalf of our client in the Banking Sector, PROCOM is looking for a Database Administrator - DB2 LUW.\nDatabase Administrator - DB2 LUW – Job Description\nBusiness group falls within the revolving credit and data management team.\nFor this team specifically, only DBA team that manages DB2 systems and mainframe IBM data platform.\nGlobal team managing data systems. DBA's could be for global, GTS, or other DB2 systems.\nProject: FFT online reporting system with 7 years data retention.\nReason for request: We need to onboard a contractor to support an approved business case: FFT online reporting system with 7 years data retention.\nAnswer all developer questions, release manager, production delivery.\nThe DB2 LUW DBA will partner with solution architects, data modelers, application developers, and support teams.\nDBA has to have deep knowledge of DB2 HADR - production cluster.\nProvide DB2 Administrative services to application development team.\nDesign/develop/test/support DB2 LUW database.\nPlan, design, develop, test, and support database systems.\nPerform regular database work and maintenance, such as storage management, import, export, load, access control, etc.\nProvide technical analysis and recommendations.\nPerformance tuning and trouble shooting.\nWrite scripts and enhance performance.\nStrong knowledge of SQL.\nDatabase Administrator - DB2 LUW – Mandatory Skills\n7+ years of technical working experience as a DB2 LUW DBA supporting development/QA/non-functional testing/production environments within the Financial Industries\n7 + years Hands on Experience of DB2 HADR\n7 + years SQL Program Language Experience – as team also does development work\nStrong communication skills (both oral and written)\nExcellent Presentation Skills – able to translate technical standards/practices to customer\nDesire to keep up with new technology innovations\nAble to work individually and as a team\nCoordination Skills\nBachelor's degree in a technical field such as computer science, computer engineering or related field required\nDatabase Administrator - DB2 LUW – Nice to Have Skills\nCertification on latest database technologies\nDatabase Administrator - DB2 LUW - Assignment Start Date\nASAP – 6 months to start\nDatabase Administrator - DB2 LUW - Assignment Location\nToronto, ON – Work Remotely\n1 day ago\nReport job"
    ],
    [
        "database administrator (DBA)",
        "Management Systems (erp or db)\nMySQL\nBusiness Equipment and Computer Applications\nSublime Text\nSpecific Skills\nDesign, construct, modify, implement and test data models and database management systems\nConduct research and provide advice to other informatics professionals regarding the selection application and implementation of database management tools\nOperate database management systems to analyze data\nResearch and document data requirements, data collection and administration policy, and data access rules\nDevelop policies and procedures for network access and usage and for the backup and recovery of data\nConduct research and provide advice to other information systems professionals regarding the collection, availability and suitability of data\nDevelop and implement data administration policy, standards and models\nWrite scripts related to stored procedures and triggers\nProgramming Languages\nMySQL\nSQL\nWork Conditions and Physical Capabilities\nFast-paced environment\nRepetitive tasks\nAttention to detail\nSitting\nComputer and Technology Knowledge\nSpreadsheet\nDatabase software\nProgramming software\nData analysis software\nMS Office\nPersonal Suitability\nEffective interpersonal skills\nTeam player\nExcellent written communication\nOrganized\nCanadian Job Bank\n30+ days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Transforming the future of healthcare isn’t something we take lightly. It takes teams of the best and the brightest, working together to make an impact.\nAs one of the largest healthcare technology companies in the U.S., we are a catalyst to accelerate the journey toward improved lives and healthier communities.\nHere at Change Healthcare, we’re using our influence to drive positive changes across the industry, and we want motivated and passionate people like you to help us continue to bring new and innovative ideas to life.\n\nIf you’re ready to embrace your passion and do what you love with a company that’s committed to supporting your future, then you belong at Change Healthcare.\nPursue purpose. Champion innovation. Earn trust. Be agile. Include all.\nEmpower Your Future. Make a Difference.\nTitle: Database Administrator\n\nOverview of Position\nThe primary focus of this position is to assist with the data conversion process whereby data from existing systems are imported into Change Healthcare systems.\n\n\nWhat will be my duties and responsibilities in this job?\nDesign and implement tools and scripts to improve efficiency of our database related processes and tasks\nDeveloping SQL scripts for the purposes of reports, data validation and reconciliations\nAssist other team members in troubleshooting complex Data quality related issues.\nAssist other team members in loading and cleanup of records associated with the data migration process within our Oracle / MSSQL database\nAssist other team members in generating SQL queries and reports.\n\n\nWhat are the requirements needed for this position?\nBackground: Comfortable with intermediate SQL, PL/SQL scripts\nExperience: Minimum 2 Years industry related experience.\nEducation: Bachelor of Computer Science, College/Computer Technical Specialist (preferred)\nCertificates preferred in one or more of the following: Oracle 9i/10G/11G/12c DBA / OCA , MS SQL 10.5/11/12/13\nWhat other skills/experience would be helpful to have?\nStrong analytical and problem solving skills\nStrong written and communication skills\nAbility to handle concurrent and complex projects\nSelf starter, able to work independently without supervision\nTeam Player\nStrong Customer Service skills\nStrong time management and organizational skills\nAbility to coach and train\n\nWhat are the working conditions and physical requirements of this job?\nWork from Home\nHow much should I expect to travel?\n0-15% (All company travel however is suspended at this time due to the pandemic).\nEmployees in roles that require travel will need to be able to qualify for a company credit card or be able to use their own personal credit card for travel expenses and submit for reimbursement.\n\nJoin our team today where we are creating a better coordinated, increasingly collaborative, and more efficient healthcare system!\n30+ days ago\nReport job"
    ],
    [
        "Senior Database Administrator",
        "Requisition ID: 98681\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\nSenior Database Administrator\nThe Senior GT.M Database Administrator’s role is to design, install, monitor, maintain, and performance-tune databases while ensuring high levels of data availability. This individual is also be responsible for developing, implementing, and overseeing database policies and procedures to ensure the integrity and availability of databases and their accompanying software. In a secure and structure Banking environment, this role is also required to monitor and implement regulatory and compliance standards to the systems under administration.\nIs this role right for you?\nStrategy & Planning\nAssess and develop long-term strategic goals for databases in conjunction with data owners and department managers.\nWork with application development staff to develop database architectures, coding standards, and quality assurance policies and procedures.\nDesign and implement redundant systems, policies, and procedures for disaster recovery, High Availability, and data archiving to ensure effective protection and integrity of data assets\nAcquisition & Deployment\nConduct research and make recommendations on database products, services, protocols, and standards in support of procurement and development efforts.\nOperational Management\nProvide real-time Operational support for all systems under administration. Includes rotating on-call responsibilities.\nCreate models for new database development and/or changes to existing ones.\nMonitor database performance and continuously tune system for optimal efficiency.\nRespond to and resolve database access and performance issues.\nMonitor database system details within the database, including stored procedures and execution time, and implement efficiency improvements.\nHelp develop, support, and maintain change control and testing processes for modifications to databases.\nParticipate in planning data migrations between systems.\nCreate, or support creation of, required reports in response to business needs.\nEstablish and apply appropriate end-user database access control levels.\nDevelop routines for end users to facilitate best practices database use.\nManage and/or provide guidance to members of the team.\nImplement corporate policy and audits; develop, publish, enforce and maintain standards and procedures.\nManage development, test and production environments; perform administrative functions; maintain documentation.\nPromote changes via established IT change control procedures.\nCreate and manage to service level agreements.\nCreate and maintain data models and metadata.\nDesign, create and maintain database structures; review application design and SQL code.\nDesign, test and implement backup/recovery strategies and contingency plans.\nMonitor analyze and report on availability, performance and resource consumption.\nAssess capacity and make recommendations on resource and capacity sizing based on projected growth.\nPlan, test and implement software upgrades; monitor alerts; administer licenses; interface with vendors.\nRemain current with industry and product direction; evaluate new technologies and product features; make recommendations as to how Tangerine can benefit.\nTroubleshoot problems; provide database problem resolution assistance to IT staff.\nProvide day-to-day consultancy and support to IT staff; act as backup for other Database Systems staff.\nMonitor daily operations; log issues and ensure resolution.\nSkills you need to succeed.\nPost-secondary degree or equivalent experience\n8+ years of experience as a DBA at least 3 in a senior capacity.\n5+ years of SQL coding experience.\n5+ years of application development experience.\nSpecialized Skills.\nExtensive experience supporting on-line database applications in a real-time mission critical environment. Banking or Financial experience strongly preferred.\nExpert at administering non-relational database systems\nSuperior knowledge of GT.M Database Server is critical\nStrong understanding of database structures, theories, principles, and practices.\nHands-on experience with designing, building, installing, configuring and supporting database servers\nDemonstrated ability in performance tuning and capacity management.\nExperience with requirements gathering and database design.\nFamiliarity with client/server, operating system, storage and networking fundamentals.\nBasic working knowledge of Unix, Linux and/or AIX Operating Systems.\nAbility to conduct research into database issues, standards, and products as required\nProject management experience\nGood oral and written communication skills\nStrong technical documentation skills\nGood interpersonal skills\nAbility to present ideas in user-friendly language\nHighly self-motivated and directed\nKeen attention to detail\nProven analytical and problem-solving abilities\nAbility to effectively prioritize and execute tasks in a high-pressure environment\nStrong customer service orientation\nExperience working in a team-oriented, collaborative environment\nAvailability to provide 24x7 on-call Production Support on a scheduled basis.\nWhat's in it for you?\nWe have an inclusive and collaborative working environment that encourages creativity, curiosity, and celebrates success!\nCurrently all our teams are working fully remotely\nRemote work continuation to be considered post pandemic\nDress codes don't apply here, being comfortable does\nAccess to thousands of online and in person courses so you can brush up on skills or learn new ones\nCareer progression opportunities. We hire you for your talent and not just for the job. We want to see you succeed not just in your role but in your career as a whole\nWe offer a competitive rewards package\nPerformance bonus, Share Ownership Program and Pension Plan Matching\nHealth Benefits from day one!\nLocation(s): Canada : Ontario : North York\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.\nScotiabank\n1 day ago\nReport job"
    ],
    [
        "Database Administrator",
        "DATABASE ADMINISTRATOR\nNUN00200\n\nWHAT DO YOU VALUE IN A CAREER?\nAt Agnico Eagle, our values never waver. We believe in trust, respect, equality, family and responsibility. Why? Because they express who we are and they have helped us succeed in business for over 60 years.\nWHAT DOES AGNICO EAGLE VALUE?\nWe value you – your unique set of skills and experience. We value your willingness to build those skills and make a meaningful contribution to our company. And, we value your commitment to treat every person on our team with respect, helping us to operate safely, protect the environment and make a positive contribution to our local communities.\nABOUT OUR OPERATION\nAgnico Eagle has three active properties in Nunavut. The Meadowbank open-pit mine, in operation since 2010; the Amaruq satellite deposit, which is 50 kilometers northwest of Meadowbank and the Meliadine underground mine, in operation since 2019. To support the Nunavut projects, Agnico Eagle has staff based out of 2 regional offices, located in Val d’Or and Mirabel, Quebec.\nYOUR NEXT CHALLENGE:\n\nReporting to Senior Coordinator Social Performance, the Database Administrator works in close collaboration with all members of the Nunavut Community Relations Department. He/she plays an important role in governance and database optimization, as well as ensuring data quality and analysis. The Database Administrator is in charge of database management, data reporting and data automation related to Community Relations projects and activities impacting or involving Kivalliq communities, groups or individuals. This role also supports project management activities.\nData\nAnalyze data quality from data sources to ensure accuracy in relation to a range of KPIs and requirements;\nImprove and automate data entry for better monitoring performance;\nManage database and proceed with data entry quality exercise – both quantitative and qualitative;\nSystem\nIntegrate and maintain links between different systems and data sources (both internally and externally to Agnico Eagle);\nDevelop internal system or tools to support data analysis and integration;\nDevelop and automate reports generated for different users and projects;\nSuggest improvements to be made to data processing;\nDevelop data management architecture and process documentation;\nUsers\nSupport users in data population and system management;\nPerform project management controls and project closure documentation.\n\nWHAT YOU NEED TO SUCCEED\nBachelor’s degree in Business Analytics, Business Intelligence, Business, IT, Project Management or equivalent;\n2-5 years of experience in a related field;\nAdvanced computing skills, experience in creating database queries and data modelling;\nExcellent knowledge of Excel;\nExperience in development or programming;\nKnowledge of PowerBI and Access is an asset;\nKnowledge of Borealis or other engagement and stakeholder system is an asset;\nCultural awareness and understanding of work in the Canadian Arctic is an asset;\nExcellent interpersonal and communication skills and the ability to work in a team;\nHave an analytic, problem solving, detail-oriented and quality-oriented profile;\nCapacity to work without direct supervision;\nAdvanced English language skills, written and spoken. Selected candidates must attain a passing mark on a SPEEXX English language assessment.\nYour Work Schedule\nSchedule: Monday to Friday; position can be based in Val d’Or, Mirabel (Quebec), Rankin Inlet or Baker Lake (Nunavut) with occasional presence at the Kivalliq communities and mine sites in Nunavut. During the COVID-19 pandemic, you will work from home.\n\nJob:\nCommunications\nPrimary Location:\nNunavut\nOrganization:\nAgnico Eagle Mines\nSchedule:\nFull-time\nShift Schedule:\n5/2\nEmployment Type Code:\nSalaried\nPosting End Date:\nMar 14, 2021, 10:59:00 PM\n9 days ago\nReport job"
    ],
    [
        "database administrator (DBA)",
        "Management Systems (erp or db)\nMySQL\nBusiness Equipment and Computer Applications\nSublime Text\nSpecific Skills\nDesign, construct, modify, implement and test data models and database management systems\nConduct research and provide advice to other informatics professionals regarding the selection application and implementation of database management tools\nOperate database management systems to analyze data\nResearch and document data requirements, data collection and administration policy, and data access rules\nDevelop policies and procedures for network access and usage and for the backup and recovery of data\nConduct research and provide advice to other information systems professionals regarding the collection, availability and suitability of data\nDevelop and implement data administration policy, standards and models\nWrite scripts related to stored procedures and triggers\nProgramming Languages\nMySQL\nSQL\nWork Conditions and Physical Capabilities\nFast-paced environment\nRepetitive tasks\nAttention to detail\nSitting\nComputer and Technology Knowledge\nSpreadsheet\nDatabase software\nProgramming software\nData analysis software\nMS Office\nPersonal Suitability\nEffective interpersonal skills\nTeam player\nExcellent written communication\nOrganized\nCanadian Job Bank\n30+ days ago\nReport job"
    ],
    [
        "Senior Database Administrator",
        "Requisition ID: 98681\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\nSenior Database Administrator\nThe Senior GT.M Database Administrator’s role is to design, install, monitor, maintain, and performance-tune databases while ensuring high levels of data availability. This individual is also be responsible for developing, implementing, and overseeing database policies and procedures to ensure the integrity and availability of databases and their accompanying software. In a secure and structure Banking environment, this role is also required to monitor and implement regulatory and compliance standards to the systems under administration.\nIs this role right for you?\nStrategy & Planning\nAssess and develop long-term strategic goals for databases in conjunction with data owners and department managers.\nWork with application development staff to develop database architectures, coding standards, and quality assurance policies and procedures.\nDesign and implement redundant systems, policies, and procedures for disaster recovery, High Availability, and data archiving to ensure effective protection and integrity of data assets\nAcquisition & Deployment\nConduct research and make recommendations on database products, services, protocols, and standards in support of procurement and development efforts.\nOperational Management\nProvide real-time Operational support for all systems under administration. Includes rotating on-call responsibilities.\nCreate models for new database development and/or changes to existing ones.\nMonitor database performance and continuously tune system for optimal efficiency.\nRespond to and resolve database access and performance issues.\nMonitor database system details within the database, including stored procedures and execution time, and implement efficiency improvements.\nHelp develop, support, and maintain change control and testing processes for modifications to databases.\nParticipate in planning data migrations between systems.\nCreate, or support creation of, required reports in response to business needs.\nEstablish and apply appropriate end-user database access control levels.\nDevelop routines for end users to facilitate best practices database use.\nManage and/or provide guidance to members of the team.\nImplement corporate policy and audits; develop, publish, enforce and maintain standards and procedures.\nManage development, test and production environments; perform administrative functions; maintain documentation.\nPromote changes via established IT change control procedures.\nCreate and manage to service level agreements.\nCreate and maintain data models and metadata.\nDesign, create and maintain database structures; review application design and SQL code.\nDesign, test and implement backup/recovery strategies and contingency plans.\nMonitor analyze and report on availability, performance and resource consumption.\nAssess capacity and make recommendations on resource and capacity sizing based on projected growth.\nPlan, test and implement software upgrades; monitor alerts; administer licenses; interface with vendors.\nRemain current with industry and product direction; evaluate new technologies and product features; make recommendations as to how Tangerine can benefit.\nTroubleshoot problems; provide database problem resolution assistance to IT staff.\nProvide day-to-day consultancy and support to IT staff; act as backup for other Database Systems staff.\nMonitor daily operations; log issues and ensure resolution.\nSkills you need to succeed.\nPost-secondary degree or equivalent experience\n8+ years of experience as a DBA at least 3 in a senior capacity.\n5+ years of SQL coding experience.\n5+ years of application development experience.\nSpecialized Skills.\nExtensive experience supporting on-line database applications in a real-time mission critical environment. Banking or Financial experience strongly preferred.\nExpert at administering non-relational database systems\nSuperior knowledge of GT.M Database Server is critical\nStrong understanding of database structures, theories, principles, and practices.\nHands-on experience with designing, building, installing, configuring and supporting database servers\nDemonstrated ability in performance tuning and capacity management.\nExperience with requirements gathering and database design.\nFamiliarity with client/server, operating system, storage and networking fundamentals.\nBasic working knowledge of Unix, Linux and/or AIX Operating Systems.\nAbility to conduct research into database issues, standards, and products as required\nProject management experience\nGood oral and written communication skills\nStrong technical documentation skills\nGood interpersonal skills\nAbility to present ideas in user-friendly language\nHighly self-motivated and directed\nKeen attention to detail\nProven analytical and problem-solving abilities\nAbility to effectively prioritize and execute tasks in a high-pressure environment\nStrong customer service orientation\nExperience working in a team-oriented, collaborative environment\nAvailability to provide 24x7 on-call Production Support on a scheduled basis.\nWhat's in it for you?\nWe have an inclusive and collaborative working environment that encourages creativity, curiosity, and celebrates success!\nCurrently all our teams are working fully remotely\nRemote work continuation to be considered post pandemic\nDress codes don't apply here, being comfortable does\nAccess to thousands of online and in person courses so you can brush up on skills or learn new ones\nCareer progression opportunities. We hire you for your talent and not just for the job. We want to see you succeed not just in your role but in your career as a whole\nWe offer a competitive rewards package\nPerformance bonus, Share Ownership Program and Pension Plan Matching\nHealth Benefits from day one!\nLocation(s): Canada : Ontario : North York\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.\nScotiabank\n1 day ago\nReport job"
    ],
    [
        "Database Administrator",
        "Responsibilities\nPerform daily administrative tasks with Oracle database including, backups and recovery, memory structures, performance monitoring, tuning and physical architecture\nEnsure the health, availability and data integrity of all hosted databases\nPlan and execute backup and recovery of all hosted databases\nPerform capacity planning for internally and client-site hosted environment\nDesign and implement database security controls and maintain access control for Tyler-hosted production data\nResponsible for performance monitoring and tuning of all Tyler-hosted databases\nImplements Oracle patches on production, development and staging databases\nWrite complex and efficient SQL statements, functions, stored procedures and triggers\nContribute to research and development of database technologies and to the development of continuously improving processes, standards and automation\nDevelops documentation covering database definitions, ERDs and procedures\nQualifications\n5+ years’ experience as either a Database Administrator or a Database Engineer\nExtensive experience with Microsoft SQL Server and Oracle Database including all phases of administration such as backup and recovery, memory structures, performance monitoring, tuning and physical architecture.\nExperience with Oracle RMAN, Datapump, SQL Server database mirroring and log shipping as well as Oracle disaster recovery processes\nFamiliarity with SQL Server SQL Profiler and Oracle OEM performance monitoring tools\nExperience with SQL Developer, SQL*Plus, and SQL Server Management Studio clients.\nAbility to write complex and efficient SQL statements, functions, stored procedures and triggers\nAbility to interface with multiple clients on multiple projects simultaneously, and to self-manage priorities\nExperience with cloud hosted databases and applications especially AWS preferred\nExperience with application servers like JBoss/Wildfly, TomCat preferred\nExperience with CI/CD servers like Jenkins, GitLab preferred\nExperience with PaaS and SaaS implementations preferred\nBS in Computer Science, Computer Engineering, or related degree\nMust be eligible to obtain a US Security clearance [FBI Background check or equivalent]\nLocation\nToronto, Ontario\nGreat Place to Work & Grow Your Career\nTyler is continually recognized as a great workplace locally and nationally. See our recent awards and accolades across Tyler »\n3 days ago\nReport job"
    ],
    [
        "Database Administrator II",
        "Database Administrators at Haemonetics are responsible for designing, developing and maintaining databases and application infrastructure for internal and external clients including provisioning of validation and production environments. This position is also responsible for maintaining client-facing systems running said databases in addition to the ancillary products required to present the application to customers.\nResponsibilities\nBuild new/upgraded customer environments for Haemonetics software product implementations\nInstall and configure Haemonetics and third party components within hosted/remote server infrastructure\nCoordinate closely with customers and the project management team\nTechnical Investigation and troubleshooting to solve problems.\nManage and escalate issues with third party vendors and coordinate with internal R&D resources as required\nIdentifies, analyzes, and troubleshoots server requirements, security requirements to support Haemonetics software operations\nImplementation Go Live support and transition support to Customer Support\nEnvironment design and requirement consulting\nEnvironment qualification and certification services\nCapture environment documentation and records to support customer validation and audit requirements\nAdministers, creates, maintains and monitors the client facing application platform.\nDesigns and manages database-level security and access control.\nDevelops automation scripts for monitoring and maintaining the platform, databases and applications\nEstablishes backup and restore procedures.\nInstalls, maintains, and monitors software and hardware while troubleshooting technical problems as they arise.\nManages platform configuration changes.\nPerforms capacity planning.\nPerforms installations and upgrades for products and database servers.\nProvides 24x7 software and hardware support for production systems.\nResearches, tests, and applies database and OS software patches.\nTroubleshoots performance problems, conducts performance tuning.\nWrites and debugs PL/SQL scripts and stored procedures.\nCommunication\nExcellent written and verbal communication skills\nPosition will involve detailed conversations with both technical and non-technical customers\nCoordination with internal/cross-functional team members on larger projects.\nAptitudes\nOutstanding Technical Aptitude\nExceptional Initiative and Technical Problem Solving\nAble to learn and produce independently with minimal supervision\nAttention to detail\nStrong verbal communication and listening skills with customers and cross-functional teams\nDemonstrated written communication skills\nSkilled in prioritization and time management\nTechnical Requirements\nExpertise in Oracle database administration, including RAC, Multi-Tenant and TDE.\nOracle and supporting software Installation/Administration/Configuration\nOracle High Availability and Disaster Recovery environment design\nApplication server software administration (e.g. Apache Tomcat) on Linux\nLinux (RedHat/Oracle) administration\nSQL query and performance tuning\nExposure to ETL/Data Conversion\nKnowledge of Oracle pl/sql, sql query and performance tuning is helpful but, not required\nSome experience with Cloud hosted administration (e.g. AWS/Azure) is helpful but, not required\nEducation Requirements\nTechnical Post-Secondary degree (or equivalent work experience)\nIn Computer Science or Computer Engineering or a related discipline - Preferred\nExperience Requirements\n5-7 years of hands-on experience in complex Oracle Database environments.\n2-3 years of hands-on experience provisioning and supporting complex application environments, including application, middleware and database servers in active/active configurations.\nHospital, medical industry, Blood/Plasma experience or regulated industry experience is beneficial.\nHigh initiative and creativity with demonstrated talent for learning and problem solving skills.\nJob Types: Full-time, Permanent\nPay: $92,160.00-$110,835.00 per year\nBenefits:\nDental care\nPaid time off\nVision care\nWork from home\nSchedule:\n8 hour shift\nMonday to Friday\nEducation:\nBachelor's Degree (Preferred)\nExperience:\nOracle Database: 5 years (Required)\nApplication Server Software Administration: 5 years (Preferred)\nLinus Administration: 5 years (Preferred)\nETL/Data Conversion: 5 years (Preferred)\nCOVID-19 precaution(s):\nRemote interview process\nVirtual meetings\n15 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Database Administrator\nSunwing Travel Group is the largest vertically integrated travel group in North America and during this unprecedented time, we are continuing to search for top talent. We are looking for candidates who are EPIC (entrepreneurial, passionate, innovative and customer-centric) to join our team and help deliver our purpose “passionate people making vacation dreams come true”. To abide by social distancing guidelines and local regulations, our current hiring process may include telephone or video call interviews and onboarding will be provided virtually when possible, or in-person in accordance with physical distancing guidelines.\nWith our own award-winning airline, the largest resort chain across the Caribbean, Mexico and Central America with over 30 properties, a destination management company and retail businesses, Sunwing is uniquely positioned to be with customers throughout their entire vacation journey.\nClick here to learn more about our Safe with Sunwing commitment and how Sunwing is keeping its employees and customers safe.\n\nAbout You:\nAs the Database Administrator, you are responsible for the installation, configuration, upgrade, administration, monitoring, maintenance and security of the databases installed at Sunwing Travel Group. The role includes the development and design of database strategies, system monitoring and improving database performance and capacity, and planning for future expansion requirements as well as plan, coordinate and implement security measures to safeguard the databases.\n\nWhat You’ll Do:\nManage SQL Server databases through multiple product lifecycle environments, from development to mission-critical production systems.\nInvestigate and resolve Database issues\nConfigure and maintain database servers and processes, including monitoring of system health and performance, to ensure high levels of performance, availability, and security.\nTest backups to ensure we can meet the business’ Recovery Time Objectives (RTO)\nIndependently analyze, solve, and correct issues in real-time, providing problem resolution end-to-end, including after-hours and weekends\nApply data modelling techniques to ensure development and implementation support efforts to meet integration and performance expectations\nUpgrade MS SQL Server environment to the latest versions and patches\nDeploy database change scripts provided by third-party vendors\nWhen performance issues arise, determine the most effective way to increase performance including hardware purchases, server configuration changes, or index/query changes\nDocument the company’s database environment as well as operational procedures and processes.\nDesign and write complex SQL Server scripts to automate database management tasks where possible\nProvide after-hours On-Call Support as required as you will be the person the company would call if the SQL Server service stopped working.\nEnsure that new database code meets company standards for readability, reliability, and performance\nMaintain, implement and develop reports showing usage, metrics and consumption of dba resources and suggest ways to improve performance on each\nDesign indexes for existing applications, choosing when to add or remove indexes\nAssist developers with complex query tuning and schema refinement\nConduct SQL Server lunch-and-learn sessions for developers\nAdvise developers on the most efficient database designs (tables, datatypes, stored procedures, functions, etc)\n\n\nWhat You’ll Need:\nDegree in Computer Science, Computer Engineering or 5 years of equivalent experience in the Administration of Databases.\n5 years or more experience in:\nTuning T-SQL queries to improve performance\nMS SQL Server Installation and Configuration for Stand-Alone and clustered instances\nWriting SSIS Packages\nWorking with Windows Server (all versions) including Active Directory, Partitioning, Disk Configuration\nArchitecture, SQL Server Backup and Restore concepts and with SQL Server tools\nGood understanding of Data Modeling, RDBMS Concepts, Data Warehouse Concepts\nBe an effective team player, with ability to be flexible and adaptable when dealing with change\nAble to juggle multiple tasks, tight deadlines and changing priorities.\n\n\nWhat You’ll Be A Part Of:\nRemote Work Opportunities\nGrow your career with challenging and rewarding work that makes a difference\nOpportunity to give back through our social responsibility initiatives\nWork with a fun, passionate, travel-loving team!\nSee for yourself! @sunwinglife\n\n\nWe thank all who apply however only those who meet the qualifications will be contacted.\nAt Sunwing, diversity is important to us. We are proud that our workforce is made up of passionate people from all experiences and backgrounds. We are also committed to employment equity and to fostering an inclusive, accessible environment. We welcome applications from everyone. We will accommodate all applicants throughout the hiring process. If you are an individual who requires accommodation to apply to this position, please email mmarcus@sunwing.ca or 416 859 2973.\nSunwing\n26 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Transforming the future of healthcare isn’t something we take lightly. It takes teams of the best and the brightest, working together to make an impact.\nAs one of the largest healthcare technology companies in the U.S., we are a catalyst to accelerate the journey toward improved lives and healthier communities.\nHere at Change Healthcare, we’re using our influence to drive positive changes across the industry, and we want motivated and passionate people like you to help us continue to bring new and innovative ideas to life.\n\nIf you’re ready to embrace your passion and do what you love with a company that’s committed to supporting your future, then you belong at Change Healthcare.\nPursue purpose. Champion innovation. Earn trust. Be agile. Include all.\nEmpower Your Future. Make a Difference.\nTitle: Database Administrator\n\nOverview of Position\nThe primary focus of this position is to assist with the data conversion process whereby data from existing systems are imported into Change Healthcare systems.\n\n\nWhat will be my duties and responsibilities in this job?\nDesign and implement tools and scripts to improve efficiency of our database related processes and tasks\nDeveloping SQL scripts for the purposes of reports, data validation and reconciliations\nAssist other team members in troubleshooting complex Data quality related issues.\nAssist other team members in loading and cleanup of records associated with the data migration process within our Oracle / MSSQL database\nAssist other team members in generating SQL queries and reports.\n\n\nWhat are the requirements needed for this position?\nBackground: Comfortable with intermediate SQL, PL/SQL scripts\nExperience: Minimum 2 Years industry related experience.\nEducation: Bachelor of Computer Science, College/Computer Technical Specialist (preferred)\nCertificates preferred in one or more of the following: Oracle 9i/10G/11G/12c DBA / OCA , MS SQL 10.5/11/12/13\nWhat other skills/experience would be helpful to have?\nStrong analytical and problem solving skills\nStrong written and communication skills\nAbility to handle concurrent and complex projects\nSelf starter, able to work independently without supervision\nTeam Player\nStrong Customer Service skills\nStrong time management and organizational skills\nAbility to coach and train\n\nWhat are the working conditions and physical requirements of this job?\nWork from Home\nHow much should I expect to travel?\n0-15% (All company travel however is suspended at this time due to the pandemic).\nEmployees in roles that require travel will need to be able to qualify for a company credit card or be able to use their own personal credit card for travel expenses and submit for reimbursement.\n\nJoin our team today where we are creating a better coordinated, increasingly collaborative, and more efficient healthcare system!\n30+ days ago\nReport job"
    ],
    [
        "Senior Database Administrator (MongoDB)",
        "What makes us Qlik\n\nQlik helps enterprises around the world move faster, work smarter, and lead the way forward with an end-to-end solution for getting value out of data. Our platform is the only one on the market that allows for open-ended, curiosity-driven exploration, giving everyone – at any skill level – the ability to make real discoveries that lead to real outcomes and transformative changes. We are a Values-Driven organization, operating over 100 countries with 45,000 customers around the world. If you think we are interesting, please read on – we may be looking for you!\n\nYou'll be responsible to help support reliability and scalability of production mission-critical customer-facing cloud services distributed across multiple regions. As the Mongo Subject Matter expect you will be responsible for tactically executing on projects such as developing/optimizing schema, queries, or ETL pipelines. You'll frequently collaborate with our software engineers to define schema enhancements and create a consistent structure by which they store and access data - holding them accountable to using industry best practices.\nRole & Responsibilities:\nWork closely with the development teams to understand what modifications are coming in a build/patch, and conduct an impact analysis, fine-tuning queries where required.\nCollaborate with development teams to create and document database standards.\nCollaborate with other development teams to create optimized queries, indexes, and data structure.\nMonitor and support database environments and serve as an escalation point for complex troubleshooting and interactive production support.\nUse database vendor provided tools as well as 3rd party applications to performance. tune various database system, specific queries and, applications scenarios as presented by the service teams.\nDiagnose and address database performance issues using performance monitors and various tuning techniques.\nIdentify areas of opportunity and recommend appropriate improvement suggestions.\nWork with our SRE organization to configure and deploy High-Availability and Disaster Recovery solutions for critical applications to meet SLAs.\n\nEducation Requirement\nBachelor degree in Computer Science (or equivalent)\nRequired Skills & Experience\nA minimum of 5 years’ experience in database maintenance, design, SQL coding/tuning, NoSQL document database administration.\nHands-on Experience using MongoDB Atlas in any production cloud environment.\nExperience utilizing Redis as a caching layer would be considered an asset.\nExperience with structured methodologies and participation in design and development of large-scale applications in a distributed computing environment.\nExcellent verbal and written communication skills and command of the English language.\n\nTo be the ideal candidate, you need to have a strong sense of responsibility and the ability to take initiatives and getting things done. You have strong analytical skills and you find unconventional solutions to problems. You have an open mind to innovation and new solutions. You must be a highly motivated team player, reliable and dependable, dedicated not only to the craft and science of software development but also to the success of the company. We are a team of goal-oriented multi-taskers who approach problems with intellectual rigor and zest for software delivery. You should be the same.\n\nOur way of giving back\nTo our communities, to the world, and to you is a core part of the culture at Qlik. We encourage our employees to participate in our numerous Corporate Responsibility Program initiatives.\nLocation\nThis role is located in Ottawa, Canada.\n\nQlik is an Equal Opportunity Employer and does not discriminate on the basis of any protected category or characteristic. We value the diversity of our workforce. If you need assistance due to disability during the application and/or recruiting process, please contact us via the Accessibility Request Form\nQlik is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Qlik via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Qlik. No fee will be paid in the event the candidate is hired by Qlik as a result of the referral or through other means.\n2 days ago\nReport job"
    ],
    [
        "SQL Database Administrator",
        "Responsibilities:\nAssists to perform day to day database system administration, including: daily checklists, backup verification, log review, security maintenance, performance tuning (analysis, indexing, updating statistics, etc.).\nTakes on and leads database and/or reporting related projects with varying degrees of complexity.\nCreate, update and maintain database objects in coordination with our reporting team.\nCreate, review and maintain code in our database systems to optimize, standardize and/or prepare for upgrades.\nCreation, maintenance, updates and troubleshooting of SSIS packages.\nPerform data/database/process consolidations or warehousing as coordinated with applicable internal staff.\nUpgrade, configure and maintain server and database monitoring software to baseline system performance and proactively identify (and remedy) potential issues. Resource monitoring and capacity planning.\nReview, test, update and document detailed disaster recovery/business continuity plans for key production SQL Servers (database mirroring, log shipping, replication, clustering) in a VM/SAN environment.\nSSRS administration, updates, troubleshooting and development.\nPerforms database backup and recovery as required, including periodic testing.\nPerforms periodic SOX testing.\nReviews, tests, recommends and installs upgrades of database software, including patches and major releases.\nOngoing review and completion of trouble tickets related to the database systems.\nTrain and mentor junior team members on process and technology.\nPerforms data analysis and other reporting tasks. This involves data investigation and cleansing.\nThe primary duties of this position occur during business hours, however there is some evening and weekend work related to projects, planned maintenance, and on-call support.\nAdminister database replication amongst global servers.\nDocuments all procedures and systems.\nJob Type: Full-time\nPay: $90,000.00 per year\nAdditional pay:\nBonus pay\nSchedule:\n8 hour shift\n17 days ago\nReport job"
    ],
    [
        "CloudOps Database Administrator",
        "Looking to start an exciting new career as a Cloud Database Administrator? Do you have a basic understanding of relational databases and the SQL language?\n\nGuidewire is looking for a highly motivated individual to join our Cloud Operations team as an Database Administrator. As a DBA at Guidewire, assignments, decision making and complexity are not limited to just carrying out established work processes and operations. You will be learning new and exciting AWS processes as we embrace our journey to the cloud. In addition, you will learn additional database platforms which will expand your skills in both database administration, performance tuning and Cloud Computing.\n\nAt the forefront of Guidewire’s cloud team, Customer and Cloud Operations ensures Guidewire products remain up and running so our customers are available to respond to their insured when an emergency or natural disaster strikes. Therefore, Cloud Operations 24X7 global team includes Cloud Operations Engineers who work rotational weekend shifts and provide occasional emergency coverage.\nDuties:\n\nAssist in daily administration activities including setup, configuration and monitoring of databases to ensure backups, availability and performance are all maintained to the highest standards.\nTuning, trouble shooting and on-call production support for database environments deployed in multi-AZ AWS environments both on the EC2 and RDS/Aurora platforms.\nMonitor and work the JIRA ticket queue for request to make schema changes, security changes, execute scripts against the databases and refresh non-production databases.\nAdvise application development and support teams on process bottlenecks and provide database tuning to ensure optimal performance.\nAssist the support staff to troubleshoot SQL and any other database errors.\nProvide 24*7 on-call support (includes holidays) for the Oracle, Microsoft SQL Server and Aurora (MySQL/PostgreSQL) production and non-production databases.\nReport weekly to management about abnormalities and critical issues; provide root cause analysis and recommendations; work with infrastructure team, application team and/or other teams for problem resolutions, following the escalation path if needed.\nDesired Skills:\n\nDeploying or migrating databases into AWS (ec2 or RDS) or any hands-on experience working with AWS or other public cloud providers a distinct advantage.\nHighly proficient in one or more of these RDBMS technologies:\nMS SQL Server\nAWS RDS/Aurora (mySQL)\nPostgreSQL\nOracle\nWorking knowledge of one or more database high availability scenarios such as:\nAWS Multi-AZ database deployments\nMS SQL Server Always on Availability Groups\nOracle Dataguard\nKnowledge of one or more database data replication tools such as:\nMS SQL Server transnational replication\nOracle Golden Gate\nAWS DMS/DMT\nUnix/Linux general administration skills and/or bash/python/powershell scripting a distinct advantage.\nKnowledge of ANSI SQL Language (SELECT, INSERT, UPDATE, DELETE, JOIN, WHERE, etc…).\nStrong analytical, communication both written and verbal and quality control skills.\nAbility to manage multiple tasks with different deadlines.\nDetail oriented, self-motivated and uses sound judgment.\nA team player who works well with others.\nDesire to learn and improve your skills.\nMinimum Qualifications:\nProficient in Microsoft Office Suite products.\nGeneral desktop with Windows and Linux server experience.\nWeekend support coverage is mandatory.\nEducation and Experience:\nBachelor’s Degree in related area preferred\n5+ years’ experience in database administration\n3+ years’ experience in Oracle, MySQL, MSSQL or other database scripting language\n\nAbout Guidewire\n\nGuidewire is the platform P&C insurers trust to engage, innovate, and grow efficiently.\n\nGuidewire combines core, data, digital, analytics, and AI to deliver our platform as a cloud service. More than 400 insurers, including the largest and most complex in the world, run on Guidewire.\n\nAs a partner to our customers, we continually evolve to enable their success. We are proud of our unparalleled implementation track record with 1000+ successful projects, supported by the largest R&D team and partner ecosystem in the industry. Our Marketplace provides hundreds of add-ons that accelerate integration, localization, and innovation.\n\nGuidewire Software Inc. provides equal employment opportunities to all applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. All offers are contingent upon passing a criminal history and other background checks where it's applicable to the position.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n8 days ago\nReport job"
    ],
    [
        "Lead Database Administrator (PostgreSQL)",
        "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management.\n\nThe Opportunity:\nYou will be an expert PostgreSQL DBA but willing to ramp up and learn other database platforms.\nDevelop an understanding of our business applications, architecture and provide architectural guidance to improve database and systems operations and integration.\nAssure proactive monitoring, maintenance and production support of a broad array of databases supporting several business brands\nBuild capabilities to quickly and effectively incorporate the management of databases of newly acquired companies.\nProvide effective communication, interaction and reporting to all OpenText stakeholders, including Operations, Engineering, Finance, Marketing, BI and IT teams.\nThis role is to be an essential member of the Enterprise Database systems that provides database-related support throughout OpenText. Key challenges include the ability to work within a fast-paced environment and be adaptable to shifting priorities. The individual must be able to adopt to new technologies being introduced from within product development as well as through company acquisitions.\n\nWhat You Are Great At:\nYour First Six Months: Assume production DBA responsibilities across all OpenText product lines. Design, build and operate database environments. Be a key extended member of the development team. Develop solutions for monitoring, availability and reliability, performance, analytics and security. Document and provide training to peers relating to the database environments. Learn and absorb responsibilities related to the OpenText product lines.\n\nSix to Twelve Months and Beyond: Gain and share expertise in database technologies other than PostgreSQL including MySQL, MongoDB, Azure SQL and Microsoft SQL Server. Participate in various product development tasks Take greater responsibilities to deliver on database-related initiatives including: Server consolidations Performance optimizations Enhancements to our existing monitoring and notification infrastructure Security enhancements Automation of repeated, manual steps Insuring our 24 X 7 X 365 availability and recovery capabilities Become an expert relating to the database systems supporting various OpenText productions. Involvement in the adoption of more DevOps approaches to a database platform release process. Begin to provide database consulting services to the development organization relating to best practices when dealing with our database platform.\n\nWhat it takes to excel:\nExpert in database technologies, especially PostgreSQL environments. 5 – 10 years of DBA experience with at least 5 years of hands-on PostgreSQL experience.\nSkilled with Migrations, DMS and high availability, tuning and scalability\nExperience with backup and disaster recovery solutions for databases\nAble to write complex SQL, stored procedures and database triggers\nKnowledgeable of PostgreSQL data structures and architecture\nKnowledgeable of database utilities and tools\nEager to contribute in a team-oriented environment\nAble to work creatively and analytically in a problem-solving environment\nExcellent in communication (written and oral) and interpersonal skills\nAble to quickly grasp complex technologies\nExperience with DevOps environments and automation desired\nEager to grow with an exciting company\nGoogle Cloud Platforms is an asset\n\nAt OpenText we understand and value diversity in our employees and are proud to be an Equal Opportunity Employer. We hire the best talent regardless of race, creed, color, national origin, ancestry, disability, marital status, sex, age, veteran status or sexual orientation. If you require accommodation at any time during the recruitment process please email accommodationrequests@opentext.com. Applicants have rights under Federal Employment Laws including but not limited to: Family and Medical Leave Act (FLMA) , Equal Employment Opportunity and Employee Polygraph Protection Act\n13 days ago\nReport job"
    ],
    [
        "database administrator (DBA)",
        "Specific Skills\nCollect and document user's requirements\nDesign and develop database\nDesign, construct, modify, implement and test data models and database management systems\nOperate database management systems to analyze data\nResearch and document data requirements, data collection and administration policy, and data access rules\nDevelop policies and procedures for network access and usage and for the backup and recovery of data\nConduct research and provide advice to other information systems professionals regarding the collection, availability and suitability of data\nWrite scripts related to stored procedures and triggers\nCanadian Job Bank\n24 days ago\nReport job"
    ],
    [
        "Product Database Administrator",
        "Are you looking to do your life’s work and excel at something you're passionate about? At Assent Compliance we understand that opportunities are all around us, every day, in some of the most unique scenarios. Finding the one that excites and interests you is something we take very seriously. Enabling our staff to be inspired by one another and building a team of like-minded individuals who remain smart, curious, and passionate is in our mission and Assent DNA. We believe in working hard, staying humble, and letting our success do all the talking. Welcome to an opportunity that will give you the pathway to do your life's work in a meaningful way, with supported growth and the encouragement to inspire, and be inspired, by those around you on a daily basis.\n\nReporting to the Director of SaaS Product Infrastructure, the Database Administrator maintains the database operational processes. The Database Administrator ensures the SaaS platforms delivered to Assent Compliance clients are secure, available, and continually updated to address bugs in the platform, technology, and the underlying infrastructure. This role ensures that all database parts of the platform meet the current needs and enables future business requirements.\n\nThis role is open to candidates within Ottawa, Montreal, Toronto, and Waterloo. Other locations may also be considered.\n\nYou’ll have the opportunity to:\nMaintain SaaS databases globally while maintaining internal and external SLAs\nParticipate in database architecture discussions and decisions to plan for growth and scale\nAssist with database procurement, installation, and setup to support ongoing operations as well as growth while ensuring low cost of ownership.\nManage the database aspect of all environments – hybrid, private, public, and on-site cloud environments\nWork with engineering teams to ensure the readiness of deployed technologies as well as cloud infrastructure\nIdentify gaps and opportunities for improvement in processes, technologies, and tools; work with the teams to prioritize and put plans in place to address them\nActively participate and collaborate with different engineering Feature Working Groups, contributing to solutions definition\nParticipate in design reviews and inspections of features\nActively participate in reviews and inspections of database deliverables such as scripts, reports, and database enhancements. Ensuring that database performance, data integrity, and security requirements are met\nProactive and on-demand expertise input to other teams\nProactive monitoring and optimization of SQL environments\nAnalyze and test-drive new SQL Server capabilities and features to be integrated into the SaaS platform\n\nDoes this sound like you:\nB.C.Sc. or MS in Computer Science, Information Systems, or equivalent experience\n4+ years of Database Administration - preferably in a SaaS environment\nYou have a passion for data and proven experience solving technology-related puzzles\nExcellent written and oral communication skills in English - you communicate effectively and with tact\nExperience with database monitoring and performance tools\nExperience with SQL Server 2017, including ColumnStore, Parallelism, and Partitioning\nExperience with query plan management\nExperience with MySQL\nFamiliar with AWS RDS and surrounding technologies\nMaster in SQL query performance tuning\nExtensive experience with MSSQL\nExperience with proactive monitoring\nExcellent knowledge of data backup and recovery, data security, and data integrity\nFamiliarity with database design, documentation, and coding\nExperience handling sensitive and confidential information\nPresentation and public speaking skills\nA propensity to stay calm and reasonable under pressure, with sound judgment and decision-making abilities\nYou anticipate, understand, and respond to the needs of others and are always thinking about how you can best support them\nYou thrive in a fast-paced, ever-changing environment - you are highly adaptable, flexible, and deal well with ambiguity\nYou are organized and have excellent time management skills - you are able to prioritize several activities of varying levels of importance for many different stakeholders\nYou are a critical thinker, you love to learn, and are continuously willing to adapt to and help shape improvements to systems and processes.\nPrevious experience with DBA case tools (frontend/backend) and third-party tools\nThe ability and willingness to work off-hour shifts with a flexible schedule. This may include shift work and on-call rotation.\n\nHow does this benefit you?\nAt Assent, our goal is to provide more value to our employees than we capture ourselves. As the leading global compliance software provider, we continue to offer an ambitious, fast-paced, and welcoming work environment allowing our staff to thrive in all areas of their personal and career development.\n\nIn addition to a competitive salary, a benefits plan that starts the same day you do, and an optional on-site work location (in Ottawa), you can expect to:\nLove what you do as part of a supportive team with a supportive and welcoming work culture\nAdvance your career in a position with high growth potential\nChoose how you work best in a flexible work environment\nHelp create positive change by being part of a sustainable work environment with lots of opportunities to help the community through our charitable work\n\nAt Assent, your contribution and presence has purpose. Our team continues to challenge each other every day so we can grow and learn together; we dig deep to build a culture of innovation, support, and high performance for our people and our clients.\n1 day ago\nReport job"
    ],
    [
        "Database Administrator Senior",
        "Position Type :\nFull time\nType Of Hire :\nExperienced (relevant combo of work and education)\nEducation Desired :\nBachelor's Degree\nTravel Percentage :\n25%\nWho Are We:\nFIS connects consumers to their money through leading-edge payments solutions. We’re the development engine of FIS: the largest, Fortune 500, Fintech company in the world. Our solution is branded by our customers — banks and retailers — so you might not have heard of us. But, if you’ve used a mobile banking app, interacted with an ATM, or used a debit card to complete a financial transaction, you’re most likely using FIS software. Our product is one that touches the average consumer on a regular basis, and makes the financial world go ‘round. Headquartered in Jacksonville, Florida, FIS serves more than 20,000 clients in over 130 countries, and our technology powers billions of transactions annually that move over $9 trillion around the globe. FIS is a Fortune 500 company, ranked 392 on the Fortune 500 list and is a member of Standard & Poor’s 500® Index. Named a 2016 “World’s Most Admired Company” by Fortune Magazine.\nJob Description:\nAdvanced professional role requiring high skill with extensive proficiency. Demonstrated competency of the Database Administrator II role is required. Works independently with only administrative supervision and the ability to overcome major obstacles and recognize early when issues should be escalated or a senior peer needs to be consulted. Wide latitude for independent judgment and is expected to provide guidance to others on the database staff. Effectively communicates with all levels of technical and non-technical personnel. Ability to negotiate complex processes and issues with others. Contributes to the development, documentation and implementation of database standards or guidelines. Assigned to the most highly visible, sensitive and critical systems. Typically requires a minimum of five years of experience in database management.\nGeneral Duties & Responsibilities:\nMeets commitments and provides excellent customer service at all times with internal and external clients.\nProvides status reports (written and/or verbal) that are detailed to tasks and difficulties encountered – enables managers to initiate escalation if necessary and assess areas where changes or additional support may be warranted.\nEnsures issues resulting in customer outage is escalated appropriately through TSG management.\nAssists application groups with design development that meet current and future business requirements:\n• Participates in logical design process of strategic projects and responsible for the physical design/implementation. • Provides specific direction on infrastructure design to support applications.\nParticipates as a member of development support team on projects.\nFollows and meets project timelines and deadlines.\nProvides maintenance of physical database:\nCreates physical database objectives following established standards and processes employed by database team.\nEnforces database standards and follows up on inconsistencies.\nPerforms routine reviews of databases and systems to ensure acceptable levels of performance.\nReports problem performance areas and recommendations for improvement.\nFollows up on recommendations and actively pushes for implementation as appropriate.\nUnderstands and applies database concepts such as database definitions, parameters, database component placement, reorganization, access methods and security definitions.\nWorks with capacity planning, operations, application developers and other TSG teams on database performance and access issues.\nProvides 24/7 support of production database environments.\nAs primary administrator, provides on call support as needed for on-call issues with database environments and provides follow up and permanent resolution for reoccurring issues.\nImplements backup/recovery procedures to protect integrity of data in database environment.\nActively manages backups along with other database administrators to ensure processes are successful and we can recover as a result.\nIf necessary, participates in recovery of databases and assists with disaster recovery testing and documentation.\nOther related duties assigned as needed.\nEducation Requirement:\nBachelor’s degree in computer science or engineering or the equivalent combination of education, training, or work experience. Post-graduate education desired.\n\nGeneral Knowledge, Skills & Abilities:\nKnowledge of FIS products and services\nKnowledge of financial services industry\nIn-depth knowledge of end-to-end systems development life cycles including waterfall, iterative and other modern approaches to software development\nProficiency in solutions design and requirements definition disciplines leveraging model driven design based tools and techniques including conceptual solution component models, business process models, use cases, etc.\nOutstanding verbal and written communication skills to technical and non-technical audiences of various levels in the organization, e.g., executive, management, individual contributors\nExcellent analytical, decision-making, problem-solving, team and time management skills\nAbility to persuade and influence others on the best approach to take\nAbility to estimate work effort for project sub-plans or small projects and ensure the project is successfully completed\nPositive outlook, strong work ethic and responsive to internal and external customers and contacts\nWillingly and successfully fulfills the role of teacher, mentor and coach\nMay require a thorough understanding of design patterns and their application\nMay require a thorough understanding of Model-View-Controller design patterns for web applications\nMay require a fluency in developing and understanding sequence diagrams, class models, etc.\nMay require in-depth knowledge of networking, computing platform, storage, database, security,\nPrivacy Statement\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.\nSourcing Model\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n#pridepass\n9 days ago\nReport job"
    ],
    [
        "database administrator (DBA)",
        "Specific Skills\nResearch and document data requirements, data collection and administration policy, and data access rules\nDevelop policies and procedures for network access and usage and for the backup and recovery of data\nConduct research and provide advice to other information systems professionals regarding the collection, availability and suitability of data\nDevelop and implement data administration policy, standards and models\nWrite scripts related to stored procedures and triggers\nCanadian Job Bank\n30+ days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Database Administrator\nSunwing Travel Group is the largest vertically integrated travel group in North America and during this unprecedented time, we are continuing to search for top talent. We are looking for candidates who are EPIC (entrepreneurial, passionate, innovative and customer-centric) to join our team and help deliver our purpose “passionate people making vacation dreams come true”. To abide by social distancing guidelines and local regulations, our current hiring process may include telephone or video call interviews and onboarding will be provided virtually when possible, or in-person in accordance with physical distancing guidelines.\nWith our own award-winning airline, the largest resort chain across the Caribbean, Mexico and Central America with over 30 properties, a destination management company and retail businesses, Sunwing is uniquely positioned to be with customers throughout their entire vacation journey.\nClick here to learn more about our Safe with Sunwing commitment and how Sunwing is keeping its employees and customers safe.\n\nAbout You:\nAs the Database Administrator, you are responsible for the installation, configuration, upgrade, administration, monitoring, maintenance and security of the databases installed at Sunwing Travel Group. The role includes the development and design of database strategies, system monitoring and improving database performance and capacity, and planning for future expansion requirements as well as plan, coordinate and implement security measures to safeguard the databases.\n\nWhat You’ll Do:\nManage SQL Server databases through multiple product lifecycle environments, from development to mission-critical production systems.\nInvestigate and resolve Database issues\nConfigure and maintain database servers and processes, including monitoring of system health and performance, to ensure high levels of performance, availability, and security.\nTest backups to ensure we can meet the business’ Recovery Time Objectives (RTO)\nIndependently analyze, solve, and correct issues in real-time, providing problem resolution end-to-end, including after-hours and weekends\nApply data modelling techniques to ensure development and implementation support efforts to meet integration and performance expectations\nUpgrade MS SQL Server environment to the latest versions and patches\nDeploy database change scripts provided by third-party vendors\nWhen performance issues arise, determine the most effective way to increase performance including hardware purchases, server configuration changes, or index/query changes\nDocument the company’s database environment as well as operational procedures and processes.\nDesign and write complex SQL Server scripts to automate database management tasks where possible\nProvide after-hours On-Call Support as required as you will be the person the company would call if the SQL Server service stopped working.\nEnsure that new database code meets company standards for readability, reliability, and performance\nMaintain, implement and develop reports showing usage, metrics and consumption of dba resources and suggest ways to improve performance on each\nDesign indexes for existing applications, choosing when to add or remove indexes\nAssist developers with complex query tuning and schema refinement\nConduct SQL Server lunch-and-learn sessions for developers\nAdvise developers on the most efficient database designs (tables, datatypes, stored procedures, functions, etc)\n\n\nWhat You’ll Need:\nDegree in Computer Science, Computer Engineering or 5 years of equivalent experience in the Administration of Databases.\n5 years or more experience in:\nTuning T-SQL queries to improve performance\nMS SQL Server Installation and Configuration for Stand-Alone and clustered instances\nWriting SSIS Packages\nWorking with Windows Server (all versions) including Active Directory, Partitioning, Disk Configuration\nArchitecture, SQL Server Backup and Restore concepts and with SQL Server tools\nGood understanding of Data Modeling, RDBMS Concepts, Data Warehouse Concepts\nBe an effective team player, with ability to be flexible and adaptable when dealing with change\nAble to juggle multiple tasks, tight deadlines and changing priorities.\n\n\nWhat You’ll Be A Part Of:\nRemote Work Opportunities\nGrow your career with challenging and rewarding work that makes a difference\nOpportunity to give back through our social responsibility initiatives\nWork with a fun, passionate, travel-loving team!\nSee for yourself! @sunwinglife\n\n\nWe thank all who apply however only those who meet the qualifications will be contacted.\nAt Sunwing, diversity is important to us. We are proud that our workforce is made up of passionate people from all experiences and backgrounds. We are also committed to employment equity and to fostering an inclusive, accessible environment. We welcome applications from everyone. We will accommodate all applicants throughout the hiring process. If you are an individual who requires accommodation to apply to this position, please email mmarcus@sunwing.ca or 416 859 2973.\nSunwing\n26 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\nIBM Global Business Services (GBS) helps our clients fundamentally redesign experiences to create new sources of value, digitally reinvent their operations for great efficiency and transform their entire enterprises through cognitive. We invite you to consider joining IBM's global reach, outcome-focused methodologies, domain skills and deep industry expertise that are helping transform the way we live and work.\nIBM's state-of-the-art Client Innovation Centre (CIC) opened in Nova Scotia in March 2013 and is the first of its kind in Canada. The Centre weaves together IBM’s business insights and industry-leading software portfolio and is ideally suited for any client that needs flexible access to emerging or niche skills that may not be cost effective to grow internally. In addition, our focus on our team is unparalleled as demonstrated by the following:\nThe CIC NS is one of IBM’s highest performing delivery centres worldwide –for retention, client satisfaction and utilization. Our employees are empowered to stay and grow within IBM.\nWe are very focused on continuous skill development –staff training is our third largest annual Centre investment. Employees are immersed in a culture of learning and constant growth.\nInvestment in key partnership with universities, government and private sector groups which has resulted in IBM having a key influencing role in Nova Scotia’s ICT industry, especially in talent development.\n\nApplication Database Administrator at IBM have a perspective on problem solving that says no one problem, big or small, is an isolated event, but rather part of a much bigger, more complex system In this job role you'll use your expertise in translating IT requirements into great design, as well as development and assembly of components, coding, unit testing and documentation, to create custom information systems for our clients.\nApplicants should also be specialists who primarily apply their technical skills in an internal or external customer billable services, and implementation, environment.\nBe a part of making the world more instrumented, interconnected - and intelligent. Join us.\nMust have 5+ years relative work experience\n12c Oracle Experience including patching and upgrades\nExperience with ASM\nExperience with RAC\nUnderstanding of internal dictionary views and tables\nStrong performance tuning\nStrong experience with backup/recovery procedures, including RMAN\nStrong Unix knowledge –including shell scripting and OS-level troubleshooting\nStrong Dataguard experience\nExperience with large databases and clustered environments\nStrong written and spoken English\nWork location will be Bedford, Nova Scotia\nNice to have skills:\nPostgreSQL & Pacemaker\n\n\n\n\nRequired Technical and Professional Expertise\nMust have 5+ years relative work experience\n12c Oracle Experience including patching and upgrades\nExperience with ASM\nExperience with RAC\nSecurity clearance: Canada - Secret\n\nPreferred Technical and Professional Expertise\nMust have 7+ years relative work experience\nSecurity clearance: Canada - Secret\n\n\n\nAbout Business Unit\nIBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation Statement\nThis role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Sudan, and Syria) on a work permit, you are not eligible for employment in this position.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n11 days ago\nReport job"
    ],
    [
        "Product Database Administrator",
        "Are you looking to do your life’s work and excel at something you're passionate about? At Assent Compliance we understand that opportunities are all around us, every day, in some of the most unique scenarios. Finding the one that excites and interests you is something we take very seriously. Enabling our staff to be inspired by one another and building a team of like-minded individuals who remain smart, curious, and passionate is in our mission and Assent DNA. We believe in working hard, staying humble, and letting our success do all the talking. Welcome to an opportunity that will give you the pathway to do your life's work in a meaningful way, with supported growth and the encouragement to inspire, and be inspired, by those around you on a daily basis.\n\nReporting to the Director of SaaS Product Infrastructure, the Database Administrator maintains the database operational processes. The Database Administrator ensures the SaaS platforms delivered to Assent Compliance clients are secure, available, and continually updated to address bugs in the platform, technology, and the underlying infrastructure. This role ensures that all database parts of the platform meet the current needs and enables future business requirements.\n\nThis role is open to candidates within Ottawa, Montreal, Toronto, and Waterloo. Other locations may also be considered.\n\nYou’ll have the opportunity to:\nMaintain SaaS databases globally while maintaining internal and external SLAs\nParticipate in database architecture discussions and decisions to plan for growth and scale\nAssist with database procurement, installation, and setup to support ongoing operations as well as growth while ensuring low cost of ownership.\nManage the database aspect of all environments – hybrid, private, public, and on-site cloud environments\nWork with engineering teams to ensure the readiness of deployed technologies as well as cloud infrastructure\nIdentify gaps and opportunities for improvement in processes, technologies, and tools; work with the teams to prioritize and put plans in place to address them\nActively participate and collaborate with different engineering Feature Working Groups, contributing to solutions definition\nParticipate in design reviews and inspections of features\nActively participate in reviews and inspections of database deliverables such as scripts, reports, and database enhancements. Ensuring that database performance, data integrity, and security requirements are met\nProactive and on-demand expertise input to other teams\nProactive monitoring and optimization of SQL environments\nAnalyze and test-drive new SQL Server capabilities and features to be integrated into the SaaS platform\n\nDoes this sound like you:\nB.C.Sc. or MS in Computer Science, Information Systems, or equivalent experience\n4+ years of Database Administration - preferably in a SaaS environment\nYou have a passion for data and proven experience solving technology-related puzzles\nExcellent written and oral communication skills in English - you communicate effectively and with tact\nExperience with database monitoring and performance tools\nExperience with SQL Server 2017, including ColumnStore, Parallelism, and Partitioning\nExperience with query plan management\nExperience with MySQL\nFamiliar with AWS RDS and surrounding technologies\nMaster in SQL query performance tuning\nExtensive experience with MSSQL\nExperience with proactive monitoring\nExcellent knowledge of data backup and recovery, data security, and data integrity\nFamiliarity with database design, documentation, and coding\nExperience handling sensitive and confidential information\nPresentation and public speaking skills\nA propensity to stay calm and reasonable under pressure, with sound judgment and decision-making abilities\nYou anticipate, understand, and respond to the needs of others and are always thinking about how you can best support them\nYou thrive in a fast-paced, ever-changing environment - you are highly adaptable, flexible, and deal well with ambiguity\nYou are organized and have excellent time management skills - you are able to prioritize several activities of varying levels of importance for many different stakeholders\nYou are a critical thinker, you love to learn, and are continuously willing to adapt to and help shape improvements to systems and processes.\nPrevious experience with DBA case tools (frontend/backend) and third-party tools\nThe ability and willingness to work off-hour shifts with a flexible schedule. This may include shift work and on-call rotation.\n\nHow does this benefit you?\nAt Assent, our goal is to provide more value to our employees than we capture ourselves. As the leading global compliance software provider, we continue to offer an ambitious, fast-paced, and welcoming work environment allowing our staff to thrive in all areas of their personal and career development.\n\nIn addition to a competitive salary, a benefits plan that starts the same day you do, and an optional on-site work location (in Ottawa), you can expect to:\nLove what you do as part of a supportive team with a supportive and welcoming work culture\nAdvance your career in a position with high growth potential\nChoose how you work best in a flexible work environment\nHelp create positive change by being part of a sustainable work environment with lots of opportunities to help the community through our charitable work\n\nAt Assent, your contribution and presence has purpose. Our team continues to challenge each other every day so we can grow and learn together; we dig deep to build a culture of innovation, support, and high performance for our people and our clients.\n1 day ago\nReport job"
    ],
    [
        "Oracle Database Administrator",
        "Job Description Summary\nPosition Summary:\nOracle Database Administrators are skilled professionals who form part of our Professional Services team working within Managed Services.\n\nThe main purpose of the role is to contribute to the successful application management and maintenance of SimCorp clients by ensuring a trouble-free performing underlying Oracle Databases. They work together in a team of Oracle Database Administrators and other Delivery IT Consultants in providing support and advice to existing clients in their day-to-day work with SimCorp Dimension.\n\n\nTasks and Responsibilities\nAs a Database Administrator you will be responsible for managing and maintaining the Oracle Databases used in various SimCorp systems at our clients\nYou will be executing Database Administrator related tasks such as installing Oracle databases and patches, defining backup strategies ad DR solutions, trouble shooting of performance issues, optimizing SQL queries and answering Oracle related product questions\nYou will be involved in system capacity planning for future projected database growth\nYou will setup and maintain Monitoring and Alerting of databases and executing proactive health checks\nYou will be able to give our customers advice and guidance on infrastructure and technical questions related to Oracle\nYou will maintain close contact with your colleagues in the Oracle network within SimCorp and communicate errors, enhancement requests and operational documentation with your product division colleagues in our head quarter in Copenhagen\nYour Profile\nA degree in computer science\nCertified as an Oracle Database Administrator and proven Oracle Database Administration experiences\nExperience with RAC, Active Data Guard and other Oracle Database related products\nExtensive experience with Oracle in an Microsoft or Unix environment\nExposure to LANs, WANs, Citrix Metaframe, Microsoft technologies including XP, Server 2003, SQL Server and XML, etc\nGood communication & people skills\nYou have excellent analytical skills and are used to working in a structured way.\nYou are good at working on & prioritizing multiple tasks at the same time\nService-minded and stress resistant\nYou enjoy working in a team\nAbility to travel sporadically\nAbility to work on weekends (approx. once per months) and occasionally extended hour to support our clients\nABOUT US\nSimCorp is a leading provider of investment management solutions to the world’s largest asset managers, fund managers, asset servicers, pension and insurance funds, wealth managers, banks and sovereign wealth funds.\nHere you will get to work with skilled and supportive colleagues. We are more than 1900 employees from 50+ nationalities dedicated to supporting our 200+ clients across the globe.\nWe celebrate multiple approaches and points of view, together we’re building a culture where difference is valued. You will be part of a success story and a company that continues to grow, offering a lot of challenging and interesting opportunities.\nVisit our career pages to learn why other people choose to work at SimCorp: www.simcorp.com/career\n#LI-KVBN\n30+ days ago\nReport job"
    ],
    [
        "Database Engineer",
        "· Bachelors degree in Computer Science, Computer or Electrical Engineering, Mathematics, or a related field · Minimum of 5 years Database Administration experience with administering and supporting multiple Oracle databases for performance critical, highly available systems on UNIX/Linux platform · Experience in Oracle 10g/11g RAC and GRID Architecture, Configuration, and Administration · Minimum of 5 years data modeling experience with conducting performance tuning, backup/recovery, and scalability/capacity planning, in addition to SQL, PL/SQL, and UNIX shell scripting · Excellent troubleshooting and problem-solving abilities. · Experience with backup/restore functionality using RMAN. · Experience managing servers in large-scale, geographically diverse environments. · Excellent SQL and DB performance tuning skills. · Experience implementing and supporting Oracle FSFO. · Minimum of 5 years troubleshooting and problem-solving experience. · This position requires 24/7 operational support on a weekly rotation.\nThis role can be based in either Toronto or Vancouver.\n\nFinance Technology is currently looking for a talented Database Administrator with 5+ years of experience for its Vancouver office. The Database Engineer will engineer solutions for multiple database technologies, and will be responsible for fast-paced, complex distributed database environments supporting both OLTP and OLAP systems across multiple platforms. A strong candidate will be able to rapidly troubleshoot complex technical problems under pressure, implement solutions that are massively scalable, while managing multiple customer groups. Deep knowledge of Oracle Database concepts , strong administration experience, and excellent interpersonal communication skills are required.\n\nResponsibilities include:\nOwnership of Oracle RAC clusters, working on a variety of development and maintenance projects in coordination with project and support teams.\nKnowledge of all supporting infrastructure components, including operating systems, hardware/storage configurations and networks.\nExcellent UNIX skills and a grasp of fundamental computing concepts such as system calls, memory management and program debugging.\nExperience in system administration of LINUX, configuring storage arrays networks, disk configuration including multipath, knowledge of networking components such as Infiniband is highly desirable.\n\nExperience in creating automation tools for managing relational databases (auditing, account management, backup/restore, discovery, schema deployment).\nDetailed understanding & experience of Linux operating systems and kernels.\nExperience in consultancy role, assisting and mentoring junior DBA staff.\nTrack record of engineering performance and availability solutions\nAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\nAmazon.com\n30+ days ago\nReport job"
    ],
    [
        "SQL Database Administrator",
        "Optimus Information\n\nOptimus is a Canadian technology consulting services company with a focus on cloud-based application development, software testing, data and analytics, and DevOps. We are one of Canada’s 500 fastest growing companies. We deliver in an integrated global delivery model from our centers in Vancouver and New Delhi.\n\nWe believe that Cloud is a transformative force and businesses are being re-invented taking advantage of the Cloud. We are completely Cloud-native and use the best-in-breed tools to benefit from the power of the Cloud, SaaS, and Analytics in the outsourcing industry.\n\nOptimus is looking for an experienced Database Administrator to join our team in Vancouver. We are looking for a self-led, highly intelligent individual who put the customer needs first.\n\nDatabase Administrator Job Responsibilities:\nInstall and maintain the performance of database servers.\nDevelop processes for optimizing database security.\nSet and maintain database standards.\nManage database access.\nPerformance tuning of database systems.\nInstall, upgrade, and manage database applications.\nDiagnose and troubleshoot database errors.\nRecommend and implement emerging database technologies.\nCreate and manage database reports, visualizations, and dashboards.\nCreate automation for repeating database tasks.\nBe available for on-call support as needed.\nDatabase Administrator Qualifications/Skills:\nStrong command of SQL and SQL server tools\nAdvanced knowledge of database security, backup and recovery, and performance monitoring standards\nUnderstanding of relational and dimensional data modeling\nPowerShell and Unix shell scripting skills\nFamiliarity with SSAS, SSIS, SSRS\nStrong mathematical and statistical knowledge\nExcellent written and verbal communication skills\nImpeccable attention to detail\nEducation and Experience Requirements:\nBachelor’s degree in computer science or a related field\nOne to three years of experience in database administration, information technology, database architecture, or a related field\nMCSE/MCSA certifications preferred\nExperience with Linux and Windows Server environments\nExtensive experience with database technologies (MySQL, MS SQL, PostgreSQL Oracle, MongoDB)\nExperience with cloud services (AWS, Microsoft Azure) a plus\n\nWhy Work With Optimus?\n\nWe provide our team with opportunities for career advancement and professional development. We work hard, we help each other succeed, and it’s our shared mission to provide a higher level of service to our clients.\n\nA little bit about our office life...\n\nOpen, collaborative work environment\nBountiful, healthy snacks and we aren’t talking noodle bowls!\nUnlimited coffee. What goes best with a cup of coffee? Another cup!\nSecure bike storage, lockers, and showers on site\nConvenient downtown Vancouver location near transit and a huge variety of lunch options\nBeer Garden every Friday, collaborate, innovate and have fun doing it!\nGrowth-focused team culture and monthly social team activities\n\nWe want to know more about you! Your resume is probably amazing but please include a cover letter telling us why you want to work with us. It’s a great way to start getting to know you! We will only be getting in touch with candidates that are qualified so if you think you are a fit for our team but this isn’t quite the opportunity you are looking for, check out our careers page or send us an email - we’d love to hear from you!\n29 days ago\nReport job"
    ],
    [
        "Database Administrator Senior",
        "Position Type :\nFull time\nType Of Hire :\nExperienced (relevant combo of work and education)\nEducation Desired :\nBachelor's Degree\nTravel Percentage :\n25%\nWho Are We:\nFIS connects consumers to their money through leading-edge payments solutions. We’re the development engine of FIS: the largest, Fortune 500, Fintech company in the world. Our solution is branded by our customers — banks and retailers — so you might not have heard of us. But, if you’ve used a mobile banking app, interacted with an ATM, or used a debit card to complete a financial transaction, you’re most likely using FIS software. Our product is one that touches the average consumer on a regular basis, and makes the financial world go ‘round. Headquartered in Jacksonville, Florida, FIS serves more than 20,000 clients in over 130 countries, and our technology powers billions of transactions annually that move over $9 trillion around the globe. FIS is a Fortune 500 company, ranked 392 on the Fortune 500 list and is a member of Standard & Poor’s 500® Index. Named a 2016 “World’s Most Admired Company” by Fortune Magazine.\nJob Description:\nAdvanced professional role requiring high skill with extensive proficiency. Demonstrated competency of the Database Administrator II role is required. Works independently with only administrative supervision and the ability to overcome major obstacles and recognize early when issues should be escalated or a senior peer needs to be consulted. Wide latitude for independent judgment and is expected to provide guidance to others on the database staff. Effectively communicates with all levels of technical and non-technical personnel. Ability to negotiate complex processes and issues with others. Contributes to the development, documentation and implementation of database standards or guidelines. Assigned to the most highly visible, sensitive and critical systems. Typically requires a minimum of five years of experience in database management.\nGeneral Duties & Responsibilities:\nMeets commitments and provides excellent customer service at all times with internal and external clients.\nProvides status reports (written and/or verbal) that are detailed to tasks and difficulties encountered – enables managers to initiate escalation if necessary and assess areas where changes or additional support may be warranted.\nEnsures issues resulting in customer outage is escalated appropriately through TSG management.\nAssists application groups with design development that meet current and future business requirements:\n• Participates in logical design process of strategic projects and responsible for the physical design/implementation. • Provides specific direction on infrastructure design to support applications.\nParticipates as a member of development support team on projects.\nFollows and meets project timelines and deadlines.\nProvides maintenance of physical database:\nCreates physical database objectives following established standards and processes employed by database team.\nEnforces database standards and follows up on inconsistencies.\nPerforms routine reviews of databases and systems to ensure acceptable levels of performance.\nReports problem performance areas and recommendations for improvement.\nFollows up on recommendations and actively pushes for implementation as appropriate.\nUnderstands and applies database concepts such as database definitions, parameters, database component placement, reorganization, access methods and security definitions.\nWorks with capacity planning, operations, application developers and other TSG teams on database performance and access issues.\nProvides 24/7 support of production database environments.\nAs primary administrator, provides on call support as needed for on-call issues with database environments and provides follow up and permanent resolution for reoccurring issues.\nImplements backup/recovery procedures to protect integrity of data in database environment.\nActively manages backups along with other database administrators to ensure processes are successful and we can recover as a result.\nIf necessary, participates in recovery of databases and assists with disaster recovery testing and documentation.\nOther related duties assigned as needed.\nEducation Requirement:\nBachelor’s degree in computer science or engineering or the equivalent combination of education, training, or work experience. Post-graduate education desired.\n\nGeneral Knowledge, Skills & Abilities:\nKnowledge of FIS products and services\nKnowledge of financial services industry\nIn-depth knowledge of end-to-end systems development life cycles including waterfall, iterative and other modern approaches to software development\nProficiency in solutions design and requirements definition disciplines leveraging model driven design based tools and techniques including conceptual solution component models, business process models, use cases, etc.\nOutstanding verbal and written communication skills to technical and non-technical audiences of various levels in the organization, e.g., executive, management, individual contributors\nExcellent analytical, decision-making, problem-solving, team and time management skills\nAbility to persuade and influence others on the best approach to take\nAbility to estimate work effort for project sub-plans or small projects and ensure the project is successfully completed\nPositive outlook, strong work ethic and responsive to internal and external customers and contacts\nWillingly and successfully fulfills the role of teacher, mentor and coach\nMay require a thorough understanding of design patterns and their application\nMay require a thorough understanding of Model-View-Controller design patterns for web applications\nMay require a fluency in developing and understanding sequence diagrams, class models, etc.\nMay require in-depth knowledge of networking, computing platform, storage, database, security,\nPrivacy Statement\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.\nSourcing Model\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n#pridepass\n9 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "OVERVIEW\nAs a Database Administrator working as a member of our small Infrastructure team you will work closely with various functional groups, 3rd party vendors, and various stakeholders across the business to run and maintain Cognera’s SaaS database systems. You will have the opportunity to proactively and collaboratively plan the future of systems, process, and procedures.\nReporting to the Infrastructure Manager, you will collaborate with the team, vendors, team leads, Business Analysts, Quality Assurance specialists, etc. to directly effect change by creating and implementing innovated solutions to complex issues. You will have the opportunity to work remotely from home or work with our team out of the Calgary office. Although this role has no travel requirements, you may be called to work outside standard business hours during emergency situations or after hour system maintenance work.\nWHAT WILL YOUR NEW ROLE BE\nParticipate in project scope, progress tracking, planning, identification of risks, and review of activities to ensure overall quality of projects\nInstalling, maintaining and upgrading Oracle and MS SQL databases\nProvide support for development activities related to schema objects and database code release activities during\nDisaster Recovery database testing, DB recovery, database back-ups, and restoration activities\nOracle Dataguard, and MS SQL Availability Groups and PITR as functions of supporting Disaster Recovery DB architectures which support RPO and RTO targets.\nProactively monitoring the database’s health and taking preventative or corrective action as required\nDevelopment (scripting) activities to meet internal database management requirements\nWHAT WE ARE LOOKING FOR\n4+ years related work experience as a DBA across various database technology’s with extensive knowledge of the Oracle DB (Oracle 12c+), Microsoft SQL Server, Linux and Linux scripting.\nExperience with source control tools\nSolid understanding of Oracle analytical functions\nWHAT WILL MAKE YOU STAND OUT\nOracle or Linux system administration certification\nKnowledge of Oracle supplied packages (CPU, PSU, SPU, RU)\nTroubleshooting database issues including opening tickets with vendors\nAbility to create and read UML modeling diagrams\nWHAT WE OFFER\n3 weeks' vacation and 5 personal days\nComprehensive Medical, Dental and Vision coverage from your first day of employment\nEmployee stock ownership and RRSP/401k matching programs\nFlexible work options (and some pretty cool offices!)\nAnd more!\nHOW TO APPLY\nIf you want to apply to this Database Administrator job (R0008651) , click 'Apply Now' to apply online. If this role does not align with your career goals, feel free to review all our current opportunities here or submit your resume to our Harris Talent Network here for future opportunities.\nHarris is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state or local law.\nIf you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at (1)-613-226-5511 or at HarrisTalentAcquisition@harriscomputer.com . This contact information is for accommodation requests only and cannot be used to inquire about the status of applications.\n30+ days ago\nReport job"
    ],
    [
        "Sql Server Database Administrator",
        "Company description\nTrusted by leading global banks and financial institutions of all sizes, TAO has worked for over a decade with financial industry leaders worldwide. We design innovative and automated software solutions to empower the financial services industry with operational agility and robust capabilities.\nWith office headquarters in Toronto, and offices in San Diego, USA as well as Sydney, Australia, TAO Solutions is in an expansionary mode. We are driven by an entrepreneurial and visionary mindset, and that means there is plenty of room for – innovation and initiative, and for talented people to shape who we are tomorrow.\n\nWe are looking for a SQL Server Database Administrator to join our growing team in Toronto.\n\nDuties and Responsibilities\nConfigure, Install and proactively maintain database servers to ensure optimal performance and uptime.\nConstantly monitor performance, capacity and security of database servers.\nPerform database upgrades, replication and migration procedures.\nPerform and plan database backups and recoveries.\nCollaborate with the Release Team in managing clients master database schemas.\nTroubleshoot database related errors.\nAnalyze queries, indexing, and data characteristics and suggest tuning and performance enhancements using advanced SQL Server capabilities such as Columnstore indexes, in-memory optimized tables, partitioning, and others.\nCollaborate with System Engineers to ensure proper database security.\nCollaborate with Software Architects to ensure proper database design, integrity and ongoing performance.\nDevelop, administer and maintain policies and procedures for ensuring healthy and highly performant database environments.\nEnsure database servers hardware is adequately sized and configured; conduct capacity planning scenarios to meet future needs.\nMeet critical project deadlines, doing whatever it takes.\nAct as a technical resource to the Systems Engineers during other non-database related projects.\nProvide first-level support to internal staff members and clients as required.\n\nTechnical Qualifications\nMust have strong experience of installing, configuring and supporting Microsoft technologies, including Windows server (2008 and above) operating systems, SQL Server (2008 and above) and SQL Server Services (SSRS, SSAS, SSIS).\nStrong knowledge of SQL Server Database performance tuning, backup, recovery and storage management.\nPractical Knowledge of Database replication and migration strategies.\nMust have working experience with SQL Server Management Studio, SQL Server Profiler and other DBA related tools.\nMust be proficient in SQL (T-SQL) language and procedures.\nMust have ERD experience.\nExperience building and supporting high availability database environments will be considered an asset.\nData warehouse experience, including design, implementation, ETL, validation, and integration with other systems will be considered an asset.\n\nEducation & Experience Requirements\nMinimum 1 to 3 years of working experience as Database Administrator or System Engineer.\nUniversity degree in Software Engineering, Computer Engineering, or an acceptable combination of related technical education with work experience.\nDBA certification or at least 2 years of proven Database Administration experience.\nProven prior work experience managing large and complex databases and its related environments.\nSuperior time management and prioritization skills including the ability to multi-task.\nStrong problem solving and troubleshooting skills allowing efficient and effective identification of problems and the ability to apply appropriate solutions.\nSuperior customer service skills providing prompt and courteous support.\nSelf-starter that can work in an agile environment with little oversight and direction.\nFlexibility to work overtime, sometimes unscheduled, to support maintenance and project workload\nPride and craftsmanship in the work that you do.\n\nWhat it’s like to work at TAO\nWe have fun in an open collaborative work environment. We are constantly learning and tackling challenges head-on as a full team We work hard, and we put in the hours we need to get the job done, in a vibrant, highly collaborative, dynamic atmosphere, with passionate colleagues who enjoy what they do. Developers, Business Analysts, Quality Assurance Testers, strategists and management sit side-by-side, pooling their collective wisdom. And we also foster team camaraderie through regular social events (virtually, as required). Due to the pandemic, we are currently collaborating virtually.\n\nUp for the challenge?\nWe offer a chance to work with an amazing team, global clients, competitive compensation, medical and dental benefits, and flexible work arrangements. We’re passionate about fostering an environment that positions each team member to succeed and grow their career. We welcome and encourage applications from people with disabilities. Accommodations are available on request.\n\nWe regret that we are unable to contact you unless you are shortlisted for the selection process.\n10 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Job Brief\nResponsible for designing, installing, monitoring, maintaining, and performance tuning production databases while ensuring high levels of data availability.\nUnion:\nCUPE 855 Inside\nEmployment Status:\nPermanent Full time\nDuration (if temporary):\nN/A\nOpen To:\nInternal/External Applicant(s)\nClosing Date:\n12/03/21\nJob Title Database Administrator\nWage $28.65 - $35.03 hourly (2021)\nReports To Applications Supervisor\nDepartment Corporate Services\nLocation City Hall\nHours Normal Working Hours are 35 hours per week; must be willing to work varied hours including afternoon, evening and Saturday\nOther General office environment with travel throughout the City of Kawartha Lakes in accordance with job requirements.\n\nEssential duties of the position:\nAssess and develop long-term strategic goals for production databases in conjunction with data owners and department managers\nWork with application development staff to develop database architectures, coding standards, and quality assurance policies and procedures\nDesign and implement redundant systems, policies, and procedures for disaster recovery and data archiving to ensure effective protection and integrity of data assets\nDevelop, manage and test backup and recovery plans\nConduct research and make recommendations on database products, services, protocols, and standards in support of procurement and development efforts\nCreate models for new database development and/or changes to existing ones\nInstall and configure SQL and relevant required components to ensure database access as well as database consistency and integrity\nDevelop and monitor maintenance plans ensuring they remain in line with database activity\nRespond to and resolve database access and performance issues\nMonitor database system details within the database, including stored procedures and execution time, and implement efficiency improvements\nMonitor, optimize and allocate physical data storage for database systems\nPlan and coordinate data migrations between systems\nDevelop, implement, and maintain change control and testing processes for modifications to databases\nCreate, or support creation of, required reports in response to business user needs\nPerform database transaction and security audits\nEstablish appropriate end-user database access control levels\nDevelop routines for end users to facilitate best practices database use\nProvide position-related subject matter guidance to members of the Applications team, and the Information Technology Division team as appropriate\nOccasional travel to various work locations is required to fulfill the duties of the position\nPerform other related duties as assigned\n\nEducation and skills required:\nPost-secondary education in Computer Science or a related field\nCertification in Database Management and Administration\nMinimum 5 years of related progressive experience with designing, building, installing, configuring and supporting database servers, including Microsoft SQL, Access, MySQL\nStrong understanding of database structures, theories, principles, and practices\nHands-on database tuning and troubleshooting experience\nExperience with data processing flowcharting techniques\nProject management experience\nGood understanding of organizational goals and objectives\nKnowledge of applicable data privacy practices and laws\nStrong problem solving, analytical and research skills\nExcellent oral, written, consultative, coordination and interpersonal skills.\nAbility to demonstrate initiative consistently with commitment to quality improvement, sharing process improvement initiatives with management\nDemonstrated organizational and time-management skills including the ability to work both independently and as part of a team, and work methodically and prioritize workload to meet multiple demands and deadlines effectively with minimal supervision\nDemonstrated ability to exercise discretion and tact and to maintain a high degree of confidentiality and professionalism\nUpon a conditional offer of employment, a Criminal Record Check will be required\nApplicants must be prepared for skill testing.\n15 days ago\nReport job"
    ],
    [
        "Oracle Database Enterprise Edition Administrator",
        "Samiti Technology Company is actively seeking an Oracle Database Enterprise Edition Consultant for a 2-year contract position in Toronto, ON, Canada. Start Date is April 1st.\nAn ideal candidate will have the following skills:\nDemonstrated expertise with Oracle Database Enterprise Edition\nDemonstrates advanced knowledge of BI, data warehousing, data modeling techniques, tools and approaches\nNice to Have:\nWorking in Government or Public Sector organizations\nSamiti Technology Company offers full- service contract, contract-to-hire and direct hire solutions to clients globally.\nSamiti Technology Company is an EOE\nContract length: 48 months\nJob Types: Full-time, Contract\nSalary: $75.00-$85.00 per hour\nSchedule:\nMonday to Friday\nExperience:\nBI, data warehousing, tools and approaches: 1 year (Preferred)\nWorking in Government or Public Sector organizations: 1 year (Preferred)\nOracle Database Administrator/Operational Support : 10 years (Preferred)\nOracle Database Enterprise Edition: 10 years (Preferred)\n5 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Grow with the best. Join a smart, creative, and inspired team that works behind the scenes to support operational excellence. Our functional services teams (FSTs) provide services to 22,000 employees in over 350 locations worldwide. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger. Explore opportunities in Information Technology Services.\nYour Opportunity\nStantec is currently seeking an Oracle E-Business Database Administrator to join our team.\nYour Key Responsibilities\nProviding support for Oracle Applications upgrades.\nProblem management [i.e., problem identification, management and resolution]\nPatch analysis and patch application\nPerformance monitoring and tuning of Databases, Oracle Application Servers and E-business Software.\nDatabase Backup and Recovery.\nPlanning, Testing and Performing software upgrades.\nAssisting with database loads and data conversion activities.\nCloning and supporting environments.\nService request resolution.\nSupporting and enhancing Stantec's High Availability Architecture and disaster recovery operations.\nYour Capabilities and Credentials\nSound understanding of database fundamentals with Database Backup and Recovery, partitioning and security.\nAbility to use Oracle database (11g, 12c) and Oracle E-Business Suite applications.\nExperience with RHEL Linux, experience working with other Operating systems such as Itanium, AIX or Solaris would be an asset.\nExperience in shell scripting, PL/SQL, Perl or Python programming will be considered an asset.\nStrong verbal and written communication skills; this position requires a high degree of involvement participating in meetings and regularly communicating to various stakeholders.\nEducation and Experience\nMinimum of 5 years’ experience providing Oracle Database Administrator support.\nMinimum of 2 years’ providing Oracle E-Business Suite support in a UNIX environment, working with Oracle E-Business suite versions R12, and Oracle 11g and 12c.\nPost-secondary degree in Information Technology or related field. Equivalent education and experience will be considered.\nOracle Certification would be an asset.\nPlease note that this position will require after-hours and on-call work. Typical office environment working with computers and remaining sedentary for long periods of time.\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\nStantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\nJob: Database Administration\nPrimary Location: Canada-Alberta-Edmonton\nOther Locations: Canada-New Brunswick-Moncton, Canada-Ontario-Stoney Creek, Canada-Alberta-Medicine Hat, Canada-Ontario-Barrie, Canada-Alberta-Fort McMurray, Canada-British Columbia-Quesnel, Canada-Ontario-Sudbury, Canada-Ontario-North Bay, Canada-Nova Scotia-Dartmouth, Canada-Manitoba-Winnipeg, Canada-Alberta-Lethbridge, Canada-Prince Edward Island-Charlottetown, Canada-Ontario-Toronto, Canada-Ontario-Windsor, Canada-Newfoundland and Labrador-St. John's, Canada-Ontario-Ottawa, Canada-British Columbia-Burnaby, Canada-Ontario-Mississauga, Canada-Alberta-Red Deer, Canada-Ontario-Waterloo, Canada-New Brunswick-Saint John, Canada-British Columbia-Terrace, Canada-British Columbia-Vancouver, Canada-Alberta-Calgary, Canada-Nova Scotia-Membertou, Canada-Ontario-London, Canada-British Columbia-Victoria, Canada-Northwest Territories-Yellowknife, Canada-Saskatchewan-Saskatoon, Canada-British Columbia-Kelowna, Canada-Saskatchewan-Regina, Canada-New Brunswick-Fredericton, Canada-Nunavut-Iqaluit, Canada-Ontario-Markham, Canada-British Columbia-Sidney, Canada-British Columbia-Kamloops, Canada-British Columbia-Prince George, Canada-British Columbia-Surrey\nEmployee Status: Regular\nJob Level: Individual Contributor\nTravel: No\nSchedule: Full-time\nReq ID: 20000219\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans\n30+ days ago\nReport job"
    ],
    [
        "Database Administrator",
        "At Caesars Windsor, it’s our mission to inspire grown-ups to play! One of nearly 40 Caesars Entertainment properties worldwide, we create memorable experiences, personalize rewards, and delight every guest, and every team member, every time. Our code of commitment and six core values guide our strategies and how we work together as a team. Those values are: Celebrate Success, Integrity, Service with Passion, Diversity, Caring Culture and Ownership. Join the Caesars Empire. Visit www.caesarswindsor.com to learn more.\nPosition Summary\nReporting to the Manager, Desktop/Servers, Windsor Casino Limited, the Database Administrator role will create, monitor, maintain, and performance tune production databases while ensuring high levels of data availability. This individual is also responsible for developing, implementing, and overseeing database policies and procedures to ensure the integrity and availability of databases and their accompanying software. Responsible for design, implementation and monitoring of data systems to include but not limited to: SQL Server and AS/400 platforms.\nKey Accountabilities\nAssess and develop long-term strategic goals for production databases in conjunction with data owners and department managers.\nWork with the IT staff to develop database architectures, coding standards and quality assurance policies and procedures.\nConfigure Database Servers to industry best practices.\nDesign and creation of routine maintenance for database backups, index maintenance and error notification that meet business goals including Recovery Point Objective(RPO) and Recovery Time Objective(RTO) for each system and database.\nDevelopment and implementation of High Availability strategies.\nProperly implement and maintain security consistent with AGCO, PIPEDA and other regulation or industry standards for all assigned Database systems.\nMust have profound working knowledge of DB Server Security Mechanisms.\nLeveraging Active Directory for Authentication and Authorization including Domain Users and Groups.\nMust have full working knowledge of Database Schema’s, structures, and design methodologies.\nFollow best practices to ensure database access as well as database consistency and integrity.\nCreate processes for new database development/changes to existing databases and follow best practices to optimize the database environment.\nPlan, coordinate and monitor data migrations between systems.\nDevelop policy and standard operating procedures for all data change.\nEnsure data security via access controls and restrictions via required data access.\nDevelop scripts, coding and trouble shoot as required.\nDevelopment of adequate test methodologies for data projects and applications.\nKnowledge of Visual Studio Data Tools (part of Visual Studio) as it pertains to data projects, source control and deployment. This will include use of BACPACs/DACPAs\nAbility using SQL Server Integration Services (SSIS), BCP (Bulk Copy Utility) and similar tools for data movement\nGeneral knowledge of virtualization technologies such as VMWare or Hyper-V\nCapacity planning and forecasting for all assigned Databases.\nComplies with Windsor Casino Limited policies and procedures.\nPerforms any and all related tasks as assigned by management.\nUpholds the highest standard of internal and external customer service at all times.\nQualifications\nCollege diploma or a University Bachelor’s Degree in Computer Science or a related field with 3 years equivalent work.\nMinimum three years experience in a casino/hospitality environment related to I.T. or experience deemed acceptable by Windsor Casino Limited.\nGeneral knowledge of all Caesars Windsor’s data setup and design; including AS400 and other non-SQL databases\nStrong understanding of database structures, theories, principles, and practices\n3 years’ experience with MS SQL Server, Visual Basic and .Net\nWorking technical experience with designing, building, installing, configuring, and supporting database servers\nHands-on database tuning and troubleshooting experience\nExperience with data processing flowcharting techniques\nProject management experience\nStrong understanding of the organization’s goals and objectives\nKnowledge of applicable data privacy practices and laws\nAbility to communicate effectively, both verbally and in writing.\nAbility to organize and prioritize work to meet strict deadlines.\nAbility to obtain a Gaming Employee License.\nPhysical Demands:\nPhysical effort requiring manual dexterity is constantly required. (i.e. more than 75% of time on the job)\nMust be available to work all shifts and have the ability to be on call outside of scheduled work hours as required.\nMust possess a good attendance record as stipulated in the Non-Union Attendance Management Policy. Anyone with over 5 occurrences will not be considered.\nApplication Instructions\nPlease submit applications directly to Caesars Windsor from Indeed by visiting wclonline.com or by clicking careers at the bottom of www.caesarswindsor.com and applying to the Database Administrator position (WCL-21-02-1).\nApplicants must be at least 19 years of age to work for Caesars Windsor\nCaesars Windsor has created policies and procedures to meet the required Accessibility Standards for Customer Service, Ontario Regulation 429/07 under the Accessibility for Ontarians with Disabilities Act. 2005. Accommodations are available for applicants with disabilities. If you require accommodation, please contact us in order to determine an acceptable format.\nJob Type: Full Time, Permanent\nJob Types: Full-time, Permanent\nBenefits:\nCompany pension\nDental care\nDisability insurance\nExtended health care\nLife insurance\nOn-site parking\nPaid time off\nVision care\nSchedule:\n8 hour shift\nEducation:\nBachelor's Degree (Preferred)\nExperience:\nDatabase Administrator: 3 years (Required)\nData Querying: 3 years (Preferred)\nWork remotely:\nNo\nCOVID-19 precaution(s):\nRemote interview process\nVirtual meetings\n22 days ago\nReport job"
    ],
    [
        "Database Administrator",
        "Salary: $32.00/Hourly\nJob Type: Full Time, Permanent\nStart Date: As soon as possible\n\nLanguage: English\nMinimum Education: Bachelor's Degree\nPositions Available: 1\n\nNOC Group: Database Analysts and Data Administrators (2172)\nNOC Job Title: Administrator, Database\nExpires in 3 days\nExpires: 2021-03-09\nPosted: 2020-11-09\nLast Updated: 2020-11-09\n\nJob Location(s)\n#356-8158 128 Street\nSurrey, British Columbia\nV3W 1R1, Canada\nJob Description\nThis job is posted by an employment agency or third party on behalf of the employer.\nEmployer Name: Express Security Services Ltd\nIndustry Title: Other Information Services (5191)\n“Express Security Services Ltd” is looking for a Database Administrator/Analyst (NOC Code: 2172) with good communication skills and an upbeat attitude. To be successful as a Database Administrator/Analyst candidate should be professional, polite, and attentive while also being accurate.\nWork Location: #356-8158 128 Street, Surrey, BC – V3W 1R1\nResponsibilities:\nInstall and maintain the performance of database servers.\nOperate database systems to analyze data.\nInstall, upgrade, and manage database applications.\nEnsure reliable system availability by conducting database security and backups.\nPlan and implement database upgrades and maintenance fixes.\nDevelop and maintain complex models and logical database designs.\nIdentify and resolves all issues related to database systems.\nDevelopment and implementation of data administration polices and standards.\nBe available for on-call support as needed.\nWhat we are looking for: Experience and Education:\nTeam player who could multi-task in a fast setting.\nAbility to work independently while prioritizing your workload.\nPossess computer skills in MSOffice and various software packages.\nBachelor’s degree in computer science or related industry sector preferred.\n2 to 3 year of experience in related field is required.\nKnowledge of English Language\nProgramming Languages and systems:\nC, C++, MySQL, SQL\nSalary/Compensation & Benefits:\nThe base salary for requested position is $32/per hour\nSalary paid Bi-weekly\nVacation pay of 4% on each schedule pay cheque.\nOther benefits as per BC Employment standards Act\nThe working time:\nMonday-Friday. The requested position is on Full-time basis i.e. 35 Hours/week.\nMethod to Apply: Interested eligible candidates can send their Resume along with Cover letter via E-mail on: expressltdjobs@gmail.com\nHow to Apply\nExpiring: Mar 09, 2021\nEmail: expressltdjobs@gmail.com\nWorkBC\n30+ days ago\nReport job"
    ],
    [
        "Senior Database Administrator",
        "The Senior Database Administrator reports to the Database Administrator Team Lead and is responsible for the planning, building and maintenance of robust and reliable database clusters supporting our system infrastructure. The key objective of the Database Administration Team, and thus the Senior Database Administrator, is to ensure resulta’s globally deployed database infrastructure is stable, scalable and efficient. To reach this goal, you will collaborate with the Team Lead to define, refine and execute the processes and tasks required. The Senior DBA will help to mentor other team members in their day-to-day tasks. You will also support the Team Lead in planning, technical decisions and collaborating with teams we support for their database needs to develop new insights that could further enhance our platform.\n\nIs this role right for me?\n\nTo be perfect for this position, you will need to :\nGuide the Database Administration Team through the creation and execution of our database management;\n\nDefine and enforce availability and performance SLAs to maintain our high standards;\n\nMaintain detailed, up-to-date documentation of internal data assets;\n\nUse Infrastructure as Code (IaC) to automate creation and destruction of clusters;\n\nDefine and enforce monitoring and alarming policies to minimize system downtime or performance degradation;\n\nEnsure systems are patched, secured and backed up to our standards;\n\nOversee the tuning of database engines for improved efficiency and cost;\n\nCo-ordinate with cross-functional experts throughout the company to validate and develop new insights;\n\nCollaborate with and support development and other teams in delivering on business objectives;\n\nExpert analytical and data-driven decision-making skills;\n\nCreative thinking and motivated self-starter with an ability to quickly grasp complex concepts and technologies;\n\nComfortable leading projects from start to finish with minimal supervision;\n\nStrong ability to work within aggressive and dynamic timelines;\n\nExcellent team player and positive contributor to the culture of the business;\n\nParticipate in On-call rotation for publishing platform.\n\nWhat qualifications do I need?\n\nThe ideal candidate should possess:\nUniversity degree or diploma in related field and 5+ years of relevant DBA experience;\n\nExpert in large scale MySQL database cluster administration;\n\nAdvanced knowledge of SQL optimization;\n\nExperience implementing and maintaining best practices for database backups;\n\nBasic Linux system administration experience;\n\nComfortable administering Mongo or a similar document based database system;\n\nIntermediate understanding of PostgreSQL database systems;\n\nVirtualization experience, specifically AWS cloud computing and clustering;\n\nStrong analytical and data-driven decision-making skills;\n\nAbility to work within aggressive and dynamic timelines;\n\nStrong communication skills and an ability to interact with all levels of end users and technical resources.\n\nExperience managing infrastructure with code (Terraform, Ansible, etc.);\n\nSufficient knowledge of scripting languages such as Python or PHP for task automation and monitoring components;\n\nFamiliarity with the Atlassian Stack management tools (JIRA, Confluence, Bitbucket).\n3 days ago\nReport job"
    ]
]