[
    [
        "Appointments Clerk",
        "Immediate opening for an administrative role with our company. We are looking for a reliable and friendly individual to interact daily with customers and drivers. Job duties include booking appointments by phone and email, tracking and updating information in our software system, interacting with customers regarding the status of their shipment and other administrative functions as required. Successful candidates will have a strong administrative background with experience in the trucking/transportation industry an asset.\nJob Types: Full-time, Permanent\nSalary: From $18.00 per hour\nAdditional pay:\nOvertime pay\nBenefits:\nDental care\nExtended health care\nLife insurance\nVision care\nSchedule:\n8 hour shift\nMonday to Friday\nEducation:\nSecondary School (Preferred)\nExperience:\nadministrative assistant: 1 year (Preferred)\nCustomer service: 1 year (Preferred)\nWork remotely:\nNo\nCOVID-19 precaution(s):\nPersonal protective equipment provided or required\nSocial distancing guidelines in place\nSanitizing, disinfecting, or cleaning procedures in place\n5 days ago\nReport job"
    ],
    [
        "Police File Reviewer",
        "Police File Reviewer\nRegular Full Time (2 Vacancies)\n\nOne of BC’s Top Employers, the City of Coquitlam offers meaningful career opportunities to make a difference within the local community. As the sixth largest city in BC, we are home to more than 150,000 residents. Our diverse municipality is a great place to work as it continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre. We envision a bright future in Coquitlam that we hope includes you!\n\nWe are seeking a collaborative, detailed-oriented and organized individual with exceptional customer service skills to join our RCMP Civilian Police Services Department as a Police File Reviewer. This role is challenging and fast-paced involving the preparation, processing and maintenance of police files utilizing the Police Records Information Management System (PRIME). This role requires the incumbent to have superior typing, data entry and communication skills, verbal and written, in order to effectively prepare, process and maintain a variety of records, reports and related material as well as provide information regarding file content to internal and external contacts.\n\nPrevious experience and training plus sound knowledge of the methods, practices, and procedures used in operating PRIME computer system is preferred.\n\nHours of work: these regular full time positions work on a 24 hour rotating shift work, 7 days per week and follow a compressed work-week schedule of four-10 hour shifts (two days/two nights).\n\nGood people make Coquitlam great, sign up for career alerts through our recruitment portal to stay up to date about opportunities within our team, or follow us on LinkedIn to learn more about how #YouCouldWorkHere too!\n\nThe City offers a competitive salary ranging from $25.82 to $30.33 per hour and an excellent benefits package. Applicants under consideration will be required to obtain and maintain a RCMP Enhanced Security Clearance.\n\nPlease apply online at www.coquitlam.ca/careers by 11:55pm on March 12, 2021.\n\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\n\nEducation : Other trades certificate or diploma\nExperience : Experience an asset\nCivicJobs.ca\n5 days ago\nReport job"
    ],
    [
        "Sport Services Program Attendant",
        "Sport Services Program Attendant\nRegular Full Time\n\nOne of BC’s Top Employers, the City of Coquitlam is the sixth largest city in BC, home to more than 150,000 residents. Our municipality continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre.\nWe are currently recruiting to fill a brand new opportunity within our Sport Services division as a Sport Services Program Attendant! The Sport Services Program Attendant will be responsible for parks maintenance and a variety of manual work for internal and external sport programs, events, tournaments and activities at City parks and sport amenities. This role will assist in the care and upkeep of parks and sport amenities, set up and take down of equipment for various park engaged events, and provide orientation and direction to volunteers. In conjunction with a superior, an employee of this class will provide support and assistance in the organization and delivery of parks related programs and activities, make arrangements for supplies, materials, equipment and venue bookings. In addition, the work may involve the operation of a vehicle and various equipment required to complete assigned tasks. The incumbent exercises some independence of action and judgement in day‑to‑day functions and refers unusual problems or policy matters to a superior who checks and reviews the work to ensure maintenance of established standards.\nThe successful incumbent will have sound knowledge of policies, rules and regulations relating to use of City parks and sport amenities, set-up procedures and equipment used in events, tournaments and activities as well as the methods, materials, tools and equipment used in maintaining grounds in City parks and sport amenities. The ability to perform laborious work lifting and moving heavy objects as well as using various power tools will be expected. Completion of Grade 12 is required as well as have successfully completed post-secondary courses in recreation, sport administration, turf care or horticulture plus some experience in general parks maintenance and volunteer coordination; or an equivalent combination of training and experience. The successful candidate must have a valid BC driver’s license.\nIn order to provide a high level of service to our community, our Sport Services Program Attendant will be expected to work a flexible schedule that will include evening and weekend work.\nA CUPE hourly rate of $30.11 (2020 rates), a comprehensive benefits package, and an earned day off program is being offered. Applicants under consideration will be required to undergo a police security clearance evaluation.\n\nPlease apply online at www.coquitlam.ca/careers by 11:55 pm on March 14, 2021.\n\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\n9 days ago\nReport job"
    ],
    [
        "Driver Examiner",
        "At ICBC, it’s our job to make sure the car insurance system works for all British Columbians, today and in the future. If you want\n\nto make the most of your skills and expertise while growing your career, we want you. A career at ICBC is an opportunity to be\n\npart of a talented, diverse and inclusive team that is driven to serve its customers and community. You can expect a competitive\n\nsalary, comprehensive benefits and a collaborative work environment. If you are reliable and dependable, contact us today to be\n\npart of our talented and diverse team as we work together to create an insurance system we can all be proud of.\n\nWe welcome applications from all qualified job seekers. If you are a job seeker with a disability, please let us know as\n\nadjustments can be made to help support you in delivering your best performance.\n\nDriver Examiner (Temporary)\n\nJob Title: Driver Examiner I Reference Number: 114102B\n\nLocation: Various Locations Employment Type: Temporary Full Time\n\nHours of Work: 7.5 hr Day Shift (M-F) Posted Date: 2021/03/05\n\nPosition Highlights\n\nICBC is continuing to expand its road testing through a phased approach and is looking to hire additional Driver Examiners for\n\nan initial term of six (6) months.\n\nOur customers rely on driver licensing services, including road tests, to ensure they can drive for work, get to work, to school, to\n\nvolunteering and for other important daily activities.\n\nAs a Driver Examiner your key focus will be will be to conduct road tests and determine the knowledge and ability of drivers to\n\nsafely operate commercial vehicles and passenger vehicles.\n\nTraining will be provided during your first three (3) weeks at the Collision Repair Learning Centre, 8350 East Lake Drive,\n\nBurnaby. Training will start on April 12 and May 3, 2021.\n\nWhat you bring:\nAbility to provide exceptional customer service\nAbility to make decisions independently in challenging customer situations\nAbility to work in variable working conditions (weather, customer vehicles etc.)\nData entry skills; cash handling experience is an asset\nPosition Requirements\n\nAdditional requirements include:\nSuccessful completion of a health assessment based on the job requirements.\nCompletion of a clean criminal record check by the Ministry of Public Safety and Solicitor General as required under the\nCriminal Records Review Act. Forms will be provided to you if selected.\n\nPossession of a valid class 5 BC driver's license or better and a clean driving record.\nMeet eligibility requirement to successfully complete the AAMVA Driver Examiner Certificate Program.\nOur main priority is to protect the health and safety of our employees and customers. Safety protocols will be required, and\n\nPersonal Protective Equipment (masks, eye protection, optional gloves and seat covers) will be provided for all road\n\nexaminations.\n\nHours of operation have some flexibility within the hours of 8am to 6pm (Monday to Friday) and 9am to 5pm (Saturdays).\n\nLocations are located in the Lower Mainland.\n\nThe offer of employment in the position of Driver Examiner will be conditional on the successful completion of the class 5/7\n\ntraining and testing during your probationary period.\n\nThis role is a Bargaining Unit position. The wage is a firm $26.59/hour.\n\nOnly candidates legally entitled to work in Canada will be considered for this position.\n1 day ago\nReport job"
    ],
    [
        "Merch",
        "At Lowe’s Canada, over 26,000 employees let their passion blossom every day. Our teams are driven by the desire to help people bring their projects to life and are committed to making a difference in the communities we serve.\n\nWe operate or service some 470 corporate and affiliated dealer stores. With a distinctive product and service offering and complementary store formats ranging from neighbourhood hardware stores to big box stores, our Lowe’s, RONA, Reno-Depot, and Dick’s Lumber banners are always looking for dedicated employees to help meet the needs of all DIYers and contractors.\n\nYou’ve got the talent? We’ve got the tools! Here, your work and ideas will contribute to building a flourishing organization. Your voice will always be heard and valued. You’ll find career opportunities that live up to your ambitions and be able to further develop your unique set of skills.\n\nSo if you’re looking to do what you love, and to grow and evolve within our family—one of the best employers in Canada according to a recent Forbes survey—we could be perfect for each other.\n\nYour role\nEnsure optimal stock replenishing according to store needs by analysing, correcting and perform work on the store system\nAnalyze, review and encode all promotional orders\nCarry out and follow-up promotional orders directly with suppliers while making sure that all commercial conditions stated on the purchase order are respected\nEnsure product resupply according to each store’s receiving, storing and rotation capacities\nInform customers of supplier delays and inform merchandiser when an intervention is needed\nRespect in-stock objectives, inventory budgets and in-store rotation of all products under his responsibility\nEvaluate supplier service level and delivery delay for stores and inform merchandiser when an intervention is necessary\nPerform other duties as requested by the supervisor\n### Job Requirements\n\nThe qualifications we are looking for\n\nGood, efficient communication skills and at ease with team work\nOrganization, autonomy skills and enthusiasm\nAvailable and able to work in a changing environment\nYour benefits of working for Lowe’s Canada:\nBy joining the Lowe’s Canada family, you’ll enjoy many benefits, such as:\n\nAn inclusive and safe working environment\nPromotion of work-life balance\nExclusive employee discounts\nBenefits: insurance (certain conditions apply), annual salary review, etc.\nOpportunities for advancement within the company\nAn employer that’s involved in the community\nTeamwork and ongoing training\nA comprehensive training program for all new hires\nA company discount on store merchandise\nA student incentive program\nAnd much more!\nThe masculine generic is used without discrimination and only in order to simplify the text. Lowe’s Canada is committed to encouraging diversity and inclusion. We are pleased to consider applications from all qualified candidates, regardless of race, colour, religion, sexual orientation, gender, nationality, age, disability, or any other status protected by law.\n2 days ago\nReport job"
    ],
    [
        "Advisor",
        "At Lowe’s Canada, over 26,000 employees let their passion blossom every day. Our teams are driven by the desire to help people bring their projects to life and are committed to making a difference in the communities we serve.\n\nWe operate or service some 470 corporate and affiliated dealer stores. With a distinctive product and service offering and complementary store formats ranging from neighbourhood hardware stores to big box stores, our Lowe’s, RONA, Reno-Depot, and Dick’s Lumber banners are always looking for dedicated employees to help meet the needs of all DIYers and contractors.\n\nYou’ve got the talent? We’ve got the tools! Here, your work and ideas will contribute to building a flourishing organization. Your voice will always be heard and valued. You’ll find career opportunities that live up to your ambitions and be able to further develop your unique set of skills.\n\nSo if you’re looking to do what you love, and to grow and evolve within our family—one of the best employers in Canada according to a recent Forbes survey—we could be perfect for each other.\n\nYour role\nGreet customers warmly and ensure a good customer experience;\nAssess customer needs an provide expert advice on horticulture and nursery department products;\nPresent and demonstrate the product highlighting its positive features and suggest complementary products;\nMaintaining the plants;\nSupport the marketing of products in its department such as: display of merchandise, visual presentation and labelling;\nKeep up to date with new products and their functions;\nEnsure and participate in the maintenance of his department;\nBe aware of current promotions and flyers;\nDevelop a basic knowledge of all the departments in the store;\nIf required, operate a forklift, in accordance with the procedures and policies of the organization;\nComply with policies and procedures regarding loss prevention, breakage of goods and health and safety;\nPerform other duties as requested by the supervisor.\n### Job Requirements\n\nThe qualifications we are looking for\n\nDo you like physical work, without being a renovation pro? Do you have a knack for first-class customer service? You have what it takes to be in our team! ASSET: experience in customer service, plus knowledge in our Garden Centre department.\n\nYour benefits of working for Lowe’s Canada:\nBy joining the Lowe’s Canada family, you’ll enjoy many benefits, such as:\n\nA fitness centre, sports activities, and showers\nA childcare centre that can accommodate up to 78 children\nA cafeteria with a delicious menu prepared by a dedicated chef, healthy options, as well as Starbucks and Tim Hortons coffee stations\nExclusive employee discounts, plus a 10% discount on store merchandise (at all Lowe’s Canada locations)\nBenefits: retirement savings plan, annual bonuses, stock purchase plan, student incentive program, etc.\nFlexible hours and remote working\nElectric car charging stations\nCareer growth opportunities within the company\nAn inclusive and safe working environment\nPromotion of work-life balance\nAn employer that’s involved in the community\nAnd much more!\nThe masculine generic is used without discrimination and only in order to simplify the text. Lowe’s Canada is committed to encouraging diversity and inclusion. We are pleased to consider applications from all qualified candidates, regardless of race, colour, religion, sexual orientation, gender, nationality, age, disability, or any other status protected by law.\n2 days ago\nReport job"
    ],
    [
        "Office Coordinator with Construction",
        "OFFICE COORDINATOR\nNOVERO Homes and Renovations is looking for a friendly and experienced office coordinator to join our close-knit work family. This position will be based out of our head office and showroom in Port Coquitlam. We position requires someone with an understanding of construction and/or design and with a high competency in office administration, project coordination and multitasking.\nPosition Overview\nThe Office Coordinator plays an important service-oriented role supporting the NOVERO team and encompasses a range of responsibilities.\nThe position requires a highly-efficient, focused individual who is able to coordinate multiple tasks and projects at any given time while providing a high level of service. This individual must have a high attention to detail, be extremely organized, and ideally have an understanding of home design, materials, and construction.\nOther qualities for the role include being a self-starter, working both independently and with a team. Previous experience as an office coordinator is required. High proficiency with Mac computers and computer applications such as Microsoft Office, as well as excellent verbal and written communication skills, are necessary.\nRole Duties:\nReception – Receive packages, greet clients, answer phones\nNew meeting requests – Quote requests\nProduct orders – Update and maintain internal tracking; work with site supervisors on site details\nWork orders – Coordinate & track trades per project in conjunction with project manager\nShowroom – Assist with walk-ins, maintain showroom space\nProduct inventory – Track stock in conjunction with accounting department\nWork with design team to execute information to trades\nWork with our project management system, Co Construct, to update schedules and tasks\nOnly those candidates that are selected for interviews will be contacted.\nJob Types: Full-time, Permanent\nSalary: $20.00-$25.00 per hour\nSchedule:\n8 hour shift\nWork remotely:\nNo\nCOVID-19 precaution(s):\nRemote interview process\nSocial distancing guidelines in place\nVirtual meetings\nSanitizing, disinfecting, or cleaning procedures in place\nToday\nReport job"
    ],
    [
        "Patient Screener",
        "Fraser Health continues to be recognized as one of BC's Top Employers, are you looking to join a diverse organization that offers equal opportunity for all of they employees? If yes, please keep reading.\nFraser Health is responsible for the delivery of hospital and community-based health services to over 1.8 million people in 20 diverse communities from Burnaby to Fraser Canyon on the traditional territories of the Coast Salish peoples. Our team of nearly 40,000 staff, medical staff and volunteers is dedicated to serving our patients, families and communities to deliver on our vision: Better health, best in health care.\nWe hire great people for excellent jobs. We are currently recruiting for temporary full time and temporary part time patient screeners to join our COVID 19 Assessment and Treatment Centres. In order to be a successful candidate for this positon you will need 7 days of availability as this position is on rotation . We need your help to expand our ability to deliver timely and professional services to a number of our patient care areas.\nBuild on your career experience working in a fast paced hospital environment as you:\nCreates a welcoming presence for staff, clients, patients and visitors\nCultivates a safe and informed environment for individuals with essential access to the site\nDirects essential patients and employees to assessment/testing centers\nEnsures that patients and visitors are following safe physical distancing measures in accordance with established guidelines\nTo join our team, we will be looking for:\nGraduation from Grade 12\nOne year’s recent related experience\nAn equivalent combination of education, training and experience is acceptable.\nWork with an experienced and dedicated team and join our dedication to provide quality care to our patients and clients. We invite you to apply today and find out why more than 95% of new employees recommend Fraser Health to their friends and family as a phenomenal place to work! We value diversity in the work force and aim to maintain an environment of Respect, Caring & Trust.\n1 day ago\nReport job"
    ],
    [
        "BROWNS SOCIALHOUSE SCHOOLHOUSE",
        "Do you want to work in a fun, social environment? Browns Socialhouse - Schoolhouse is looking to hire a part time Host/Expo. We are looking for fun, enthusiastic, hardworking individuals to join our team. *The ideal candidate must be available for daytime shifts*\n\nIdeal candidates will have:\nOpen availability\nAn upbeat and positive attitude\nA team player mentality\nFantastic work ethic\nIf this sounds like something you want to apply for, please come into our Schoolhouse location between 2pm-4pm with a copy of your resume and your application and one of the members of our management team will be happy to meet with you.\n86network.com\n1 day ago\nReport job"
    ],
    [
        "Recycling Depot Operator",
        "Recycling Depot Operator\nRegular Full Time\n\nOne of BC’s Top Employers, the City of Coquitlam offers meaningful career opportunities to make a difference within the local community. As the sixth largest city in BC, we are home to more than 150,000 residents. Our diverse municipality is a great place to work as it continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre. We envision a bright future in Coquitlam that we hope includes you!\n\nWe are seeking a responsible and self-starting individual to operate and maintain our Town Centre Park Recycling Depot while providing great customer service to the citizens of Coquitlam. You will be responsible for effectively and efficiently ensuring the cleanliness and order of the depot, ensuring that recyclables are properly sorted, and maintaining detailed records. You will also provide assistance and recycling information to members of the public, ensure the removal of materials by contractors, and participate in investigations of illegal dumping at the Depot.\nIn addition to the ability to work well independently, successful candidates must possess excellent customer service and communication skills, knowledge and experience of recycling activities, and have experience with data recording/entry. Candidates must be comfortable working outside in all types of weather conditions. Experience delivering educational presentations and formal conflict resolution training are considered assets. A valid BC Driver’s licence is required.\n\nThis opportunity is for one (1) regular full-time position to work Wednesdays through Sundays either 9:30am – 5:30pm or 10:15am to 6:15pm. A CUPE hourly rate of $30.54 plus and excellent benefits package is being offered. All applicants will be required to upload a recent driver’s abstract (within the last 30 days) to their application.\n\nGood people make Coquitlam great, sign up for career alerts through our recruitment portal to stay up to date about opportunities within our team, or follow us on LinkedIn to learn more about how #YouCouldWorkHere too!\n\nApplicants under consideration will be required to undergo a police security clearance evaluation and will be required to upload a recent driver’s abstract (within the last 30 days).\n\nPlease apply online at www.coquitlam.ca/careers by 11:55 pm on March 19, 2021.\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\n2 days ago\nReport job"
    ],
    [
        "Utility Worker",
        "Utility Worker - Parks\nRegular Full Time\nParks, Recreation, Culture and Facilities Department\n\nOne of BC’s Top Employers, the City of Coquitlam offers meaningful career opportunities to make a difference within the local community. As the sixth largest city in BC, we are home to more than 150,000 residents. Our diverse municipality is a great place to work as it continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre. We envision a bright future in Coquitlam that we hope includes you!\n\nThe City of Coquitlam is currently recruiting for two regular full-time Utility Worker - Parks to join our team of professionals in the Parks Division. This is a CUPE Local 386 position.\n\nReporting to the Asset and Operations Manager, our Utility Worker – Parks will be responsible for performing semi-skilled manual work related to the maintenance, inspection, repair and installation of park features including playground equipment, park furniture, volleyball, tennis, basketball & ball hockey courts, lighting systems, fencing and backstops, bike track, skateboard facilities, pathways and related paved areas.\nAdditional responsibilities include maintaining routine work records through a mobile device, undertaking special projects and assignments as required and ensuring parks are clean and safe for public use.\n\nApplicants should have considerable knowledge of park amenities, furnishings, structures, and playgrounds as well as the rules and regulations governing their use. The Incumbent should also be familiar with the methods, materials, equipment and tools used in performing routine parks maintenance tasks including maintaining grounds, structures and miscellaneous parks infrastructure. Additional requirements include the ability to perform a variety of parks maintenance tasks, semi-skilled and unskilled repair work in construction, maintenance, gardening and routine natural and artificial turf and to do so under minimal supervision.\n\nThese attributes will be matched with a Grade 10 plus completion of the BC Recreation and Parks Association Playground Safety Awareness Course supplemented by completion of some basic carpentry and/or landscaping courses plus some experience in general parks maintenance and landscape work OR an equivalent combination of training and experience. Availability for weekend work and a Driver's License for the Province of British Columbia is also required.\n\nThe CUPE hourly rate of $30.54 plus an excellent benefits package is offered. Applicants under consideration will be required to undergo a police security clearance evaluation.\n\nPlease apply online at www.coquitlam.ca/careers by 11:55 pm on March 21, 2021\n\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\nCivicInfo BC\n1 day ago\nReport job"
    ],
    [
        "Hiring PT",
        "We are looking for:\nA mature, hard working, outgoing person with a positive attitude to join our Cactus family!\n\nWe are currently looking to fill a Front Desk/Host(ess) role for 4-5 shifts per week.\nWe also have a part time role available with a minimum 3 shifts per week.\n\nExperience in the restaurant industry preferred but not a requirement.\n\nOnly select individuals will be contacted for an interview due to the large number of applicants we receive.\n86network.com\n1 day ago\nReport job"
    ],
    [
        "Online Retailer Full",
        "We are a small, eCommerce company selling hobby products such as nail polish, yarn, stationery, and craft supplies. You'll primarily be picking, packing orders and applying shipping labels.\nWe're pretty relaxed as long as you work quickly you can put in some headphones and listen to music, podcasts (or audio books for those really ambitious folks).\nResponsibilities include:\nOrder Picking - picking a wide variety of small products (nail polish, makeup, skincare, yarn etc.)\nOrder Packing - taping boxes, wrapping products in bubble wrap, packing products securely (working mostly with small items)\nPreparing shipments and shipping via Canada Post and UPS (entering addresses, printing & sticking labels)\nRestocking and organizing inventory\nOther duties as needed\nQualifications:\nAble to work independently\nVery organized\nExcellent attention to detail\nSelf motivated\nFast packer and good with their hands (working with lots of small items)\nStrong communication skills\nWork Hours:\nMonday to Friday - 7:30am to 4:00pm\nJob Types: Full-time, Permanent\nSalary: $15.00-$16.00 per hour\nJob Types: Full-time, Permanent\nSalary: $15.00-$16.00 per hour\nSchedule:\n8 hour shift\n24 days ago\nReport job"
    ],
    [
        "Store Front",
        "Urgently hiring\nCustomer Service - Storefront - Full-time\nPosition Description\nAs a team member your top priority is guest satisfaction. Whether you are the very first person our guests encounter or producing quality finished bakery items that our guests come to enjoy and love you will have the opportunity to deliver and create exceptional guest experiences. Your energy and passion for guest service are what make you a top team member in this fast-paced environment while your ability to multi-task and communicate with your fellow team members will contribute to your success.\nApply to this job if you:\nDemonstrate a passion for guest service and creating exceptional guest experiences\nEnjoy working with a successful team in a safe environment\nHave a strong work ethic and are committed to your team\nAs part of our team we offer you:\nComprehensive training\nHealth & Dental Benefits\nIncentive and recognition programs\nTeam Tim Hortons Scholarship Program\nAdvancement opportunities\nCommunity involvement\nExpected Start Date: 2021-03-08\nJob Type: Full-time\nSalary: $14.00-$16.00 per hour\nBenefits:\nDental care\nDiscounted or free food\nExtended health care\nFlexible schedule\nOn-site parking\nVision care\nSchedule:\n8 hour shift\nEducation:\nSecondary School (Required)\nWork remotely:\nNo\nCOVID-19 precaution(s):\nPersonal protective equipment provided or required\nPlastic shield at work stations\nTemperature screenings\nSocial distancing guidelines in place\nSanitizing, disinfecting, or cleaning procedures in place\n1 day ago\nReport job"
    ],
    [
        "Office Assistant (Clerk Typist 2)",
        "The City of Burnaby’s dedication to creating and sustaining the best quality of life for those that work, live, learn and play here is supported by the goals that keep us invested in our growth and progress. With a commitment to our safe, inclusive, thriving and dynamic community, our objective is to hire like-minded individuals who share the same passion and commitment to their employment to contribute to our already outstanding team.\n\nIf you’re passionate about making a difference in your community, we want to hear from you! The Auxiliary Clerical Team with the City of Burnaby is an exciting opportunity to begin your municipal career!\nAs an Auxiliary Clerical Team member you will have the opportunity to work in a variety of clerical and administrative assignments throughout the various departments at the City, including our Engineering, Finance, and Information Technology departments. Both full-time and part-time assignments with varying lengths are available (depending on operational requirements). Successful candidates will provide coverage for short-term leaves, special projects, and/or to assist with additional workflow. Joining our Auxiliary Clerical Team will allow you to grow your knowledge with City operations and gain unique municipal experience while allowing you the flexibility to apply your skills in a diverse number of City departments.\nPosition Requirements:\nSuccessful applicants will possess the following skills, knowledge, and abilities:\nProficiency with Microsoft Office – Word and Excel\nAbility to type a minimum of 45wpm\nAbility to learn tasks and computer systems quickly\nStrong teamwork and customer services skills\nExperience working with SAP or another ERP system (not required, but is considered a strong asset)\nExcellent interpersonal skills, with a focus on providing customer service to internal and external customers\nIf you are ambitious with the ability to manage priorities in a professional, efficient and timely manner, as well are adaptable and excel in an environment where teamwork and collaboration is required to meet departmental and organisational goals, apply today!\nAuxiliary Clerical Team members must be available to work between 8:00 AM – 4:45 PM Monday to Friday, and up to 8:00 PM on Thursdays. Special short-term projects may also require weekend availability.\nThis competition will remain open until filled - however, interviews will happen periodically before the competition is closed.\nPlease contact Human Resources at 604-294-7303 If you do not receive a confirmation email within one hour of submitting your application online.\nCopies of relevant professional certificates, degrees, or tickets will be required at the time of the interview.\n30+ days ago\nReport job"
    ],
    [
        "Front Office Assistant",
        "We are a women's health physiotherapy clinic. The clinical and office staffs are a team to enhance the client experience and recovery. So people skills, compassion and empathy is an absolute must for this job. Excellent phone skills, organizational skills, computer skills (Intuit Quickbook, Google forms, Adobe, etc.) are also necessary. Knowledge of ClinicMaster EMR, book keeping and knowledge of french are a plus. The job also entice minor maintenance activities such a laundry, vacuuming and dusting your work station, part of disinfection between clients. The clinic is a expansion phase, so the work hours might grow to a full time position.\nReference ID: Office assistant\nPart-time hours: 20-25 per week\nApplication deadline: 2021-03-04\nExpected start date: 2021-03-15\nJob Types: Full-time, Part-time, Permanent\nSalary: From $18.00 per hour\nBenefits:\nFlexible schedule\nOn-site parking\nTuition reimbursement\nSchedule:\nDay shift\nNo weekends\nCOVID-19 considerations:\nDaily COVID-19 screen form/temperature taken All clients/staffs . The masks/eye protection supplied by the clinic. Plexiglass shield for front staff. All surfaces touched disinfected between each client through clinic.\nExperience:\nrelevant: 2 years (Required)\nAdministrative Duties:\nScheduling\nRunning errands\nStocking supplies\nAnswering and routing phone calls\nManaging social media\nGreeting visitors\nFinancial Duties:\nProcessing expense reports\nProcessing payments\nBilling\nPayroll\nPurchasing\n25 days ago\nReport job"
    ],
    [
        "Recycling Depot Operator",
        "Recycling Depot Operator\nRegular Full Time\n\nOne of BC’s Top Employers, the City of Coquitlam offers meaningful career opportunities to make a difference within the local community. As the sixth largest city in BC, we are home to more than 150,000 residents. Our diverse municipality is a great place to work as it continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre. We envision a bright future in Coquitlam that we hope includes you!\n\nWe are seeking a responsible and self-starting individual to operate and maintain our Town Centre Park Recycling Depot while providing great customer service to the citizens of Coquitlam. You will be responsible for effectively and efficiently ensuring the cleanliness and order of the depot, ensuring that recyclables are properly sorted, and maintaining detailed records. You will also provide assistance and recycling information to members of the public, ensure the removal of materials by contractors, and participate in investigations of illegal dumping at the Depot.\nIn addition to the ability to work well independently, successful candidates must possess excellent customer service and communication skills, knowledge and experience of recycling activities, and have experience with data recording/entry. Candidates must be comfortable working outside in all types of weather conditions. Experience delivering educational presentations and formal conflict resolution training are considered assets. A valid BC Driver’s licence is required.\n\nThis opportunity is for one (1) regular full-time position to work Wednesdays through Sundays either 9:30am – 5:30pm or 10:15am to 6:15pm. A CUPE hourly rate of $30.54 plus and excellent benefits package is being offered. All applicants will be required to upload a recent driver’s abstract (within the last 30 days) to their application.\n\nGood people make Coquitlam great, sign up for career alerts through our recruitment portal to stay up to date about opportunities within our team, or follow us on LinkedIn to learn more about how #YouCouldWorkHere too!\n\nApplicants under consideration will be required to undergo a police security clearance evaluation and will be required to upload a recent driver’s abstract (within the last 30 days).\n\nPlease apply online at www.coquitlam.ca/careers by 11:55 pm on March 19, 2021.\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\n2 days ago\nReport job"
    ],
    [
        "Office Assistant (Clerk Typist 2)",
        "The City of Burnaby’s dedication to creating and sustaining the best quality of life for those that work, live, learn and play here is supported by the goals that keep us invested in our growth and progress. With a commitment to our safe, inclusive, thriving and dynamic community, our objective is to hire like-minded individuals who share the same passion and commitment to their employment to contribute to our already outstanding team.\n\nIf you’re passionate about making a difference in your community, we want to hear from you! The Auxiliary Clerical Team with the City of Burnaby is an exciting opportunity to begin your municipal career!\nAs an Auxiliary Clerical Team member you will have the opportunity to work in a variety of clerical and administrative assignments throughout the various departments at the City, including our Engineering, Finance, and Information Technology departments. Both full-time and part-time assignments with varying lengths are available (depending on operational requirements). Successful candidates will provide coverage for short-term leaves, special projects, and/or to assist with additional workflow. Joining our Auxiliary Clerical Team will allow you to grow your knowledge with City operations and gain unique municipal experience while allowing you the flexibility to apply your skills in a diverse number of City departments.\nPosition Requirements:\nSuccessful applicants will possess the following skills, knowledge, and abilities:\nProficiency with Microsoft Office – Word and Excel\nAbility to type a minimum of 45wpm\nAbility to learn tasks and computer systems quickly\nStrong teamwork and customer services skills\nExperience working with SAP or another ERP system (not required, but is considered a strong asset)\nExcellent interpersonal skills, with a focus on providing customer service to internal and external customers\nIf you are ambitious with the ability to manage priorities in a professional, efficient and timely manner, as well are adaptable and excel in an environment where teamwork and collaboration is required to meet departmental and organisational goals, apply today!\nAuxiliary Clerical Team members must be available to work between 8:00 AM – 4:45 PM Monday to Friday, and up to 8:00 PM on Thursdays. Special short-term projects may also require weekend availability.\nThis competition will remain open until filled - however, interviews will happen periodically before the competition is closed.\nPlease contact Human Resources at 604-294-7303 If you do not receive a confirmation email within one hour of submitting your application online.\nCopies of relevant professional certificates, degrees, or tickets will be required at the time of the interview.\n30+ days ago\nReport job"
    ],
    [
        "Order Picker",
        "Company description\nLegends Grocery Co. Is a locally focused online grocery company. Founded in early 2020 we have a goal to bring as many locally made and grown products to peoples home as possible. Our missing is to always deliver Ridiculously Good Groceries.\nJob description\n- Grocery Product Picking\n-Safe and thoughtful boxing and packaging of products\n-Working quick and efficiently\n-Working and communicating as a team\n-Attention to detail\n-Customer focused attitude is key\nJob Types: Full-time, Part-time, Permanent\nSalary: $16.00-$18.00 per hour\nSchedule:\n8 hour shift\nDay shift\nMonday to Friday\nWeekends\n5 days ago\nReport job"
    ],
    [
        "Warehouse Assistant",
        "Trail Appliances is the leading independent appliance retailer in Western Canada. With 11 showrooms, a Clearance Centre, and offices in Richmond, Vancouver, Annacis Island, and Cloverdale, we’re a fast-growing company with over 500 employees in British Columbia.\n\nThe Warehouse/Showroom Assistant will strive to create an amazing customer experience by ensuring world class product presentation. You will achieve this by is performing ongoing maintenance to displays, unpacking and moving appliances in and around the showroom, small fixture repairs, general warehouse tasks.\nAs a Warehouse/Showroom Assistant you will...\nFacilitate physical movement of appliances in and around the showroom and warehouse areas\nUnpack and prepare appliances for display\nAssist with the installation of appliances where possible\nCoordinate the shipping and receiving documents for products moving in and out of the store warehouse\nPerform and maintain general cleaning schedule of showroom, including staff rooms, office areas, bathrooms, and warehouse areas\nWe hope you are passionate about...\nWorking in a fast-paced environment\nCreating great experiences for our customers\nThe experience we need...\nKeen eye for detail and the general upkeep of retail displays\nPrevious retail showroom display or warehousing experience\nAbility to lift and move heavy objects (appliances) greater than 100 lbs\nExperience with small repairs and comfort using both hand and power tools\nExceptional customer service skills and friendly demeanor\nWork environment...\nShowroom environment\nFull Time 40 hours a week\nTuesday - Saturday 8:30am -5:00pm\nINDHP\n\nWe inspire possibilities, make shopping ridiculously easy, and help create special moments at home. Are you ready to meet your team?\n4 days ago\nReport job"
    ],
    [
        "Production Worker (Temporary FT",
        "The Operations Assistant works in various areas of the factory to provide coverage for vacation, leaves of absences, and support during peak seasons. This is a fantastic opportunity to gain experience and work towards permanent employment or supplement your income with temporary seasonal work. In our fast-paced facility we promote safety, teamwork and positivity while taking into consideration the company’s commitment to our seven Core Values such as Sustainability (people, the planet, and profit) in the planning and implementation of all actions related to your area of responsibility.\n\nJob description and duties are dependent on the position in which you are placed.\n\nCompany Overview\n\nAs a leading manufacturer of nutritional supplements and other health-building products, we are dedicated to enhancing the wellbeing of our customers - through research, development and delivery of effective nutritional products. It is our mission to contribute to the lives of our customers, employees, suppliers and the communities we serve, in a cooperative and sustainable manner.\n\nPosting Details\n\nThis position is open to all qualified applicants who are legally entitled to work in the country in which this job is located. Only electronic applications can be accepted. This position will close when a competitive candidate pool has been identified. We thank you all for your applications; however, only those selected for an interview will be contacted. You can check the status of your application by logging in to your account. All the best!\n\nFG OCC\n\nCountry\n\nCanada\n\nProvince/State\n\nBritish Columbia\n30+ days ago\nReport job"
    ],
    [
        "Branch Manager",
        "Steam Dry Canada is a leader in the home services business (furnace and duct cleaning, carpet cleaning, upholstery cleaning and emergency services) and we are looking for a professional self starter to join our team!\nSteam Dry Canada is a progressive company that focuses on quality of work and customer service in every aspect of our business. We are looking for an individual that shares our same vision of customer service\nThe Right Candidate:\n- reliable and dependent\n- possess leadership qualities\n- strong communication skills\n- self motivated and focused\n- work under minimal supervision\n- have average computer skills\nWhat can you expect from Steam Dry Canada:\n- Work with a company that prides itself on its positive, respectful and progressive environment\n- Opportunities for advancement\n- Industry leading wages and bonus structure\n- Employee benefits\nIf this position sounds like it is the right fit for you, please email your resume\nJob Types: Full-time, Permanent\nSalary: $50,000.00-$65,000.00 per year\nJob Types: Full-time, Permanent\nSalary: $50,000.00-$60,000.00 per year\nWork remotely:\nNo\nCOVID-19 precaution(s):\nRemote interview process\nSocial distancing guidelines in place\n8 days ago\nReport job"
    ],
    [
        "Deli Production Assistant",
        "We're a family owned and operated butcher shop with bistro located on our family farm. We're passionate about eating local, and we're looking for motivated team members who share our love of good food and great customer service.\nWe're currently hiring for a DELI PRODUCTION ASSISTANT.\nFor this position you need:\n- Must be able to work at least one weekend day\n- To have an upbeat and friendly attitude\n- To have great work ethic in a fast paced team environment\nDELI PRODUCTION Responsibilities:\n- Package/cryovac/price/stock deli retail items\n- Filling & Rotating deli items on retail shelves\n- Operate & Maintain machinery (slicer, cryovac, work stations)\n- End of day clean of deli rooms\nWorking Conditions:\n- Refrigerated Rooms with Hot/Cold Water\n- Handling raw meat, Fresh/Frozen\n- Working with sharp knives & equipment\nWhy our staff love working here:\nFlexible Hours :: Benefits :: Annual Company BBQ's and Events :: Staff and Family Discounts :: Year End Bonuses :: Room for Growth and Advancement\nEmail in your resume or better yet, drop it off in person.\nJob Types: Full-time, Part-time\nSalary: From $15.00 per hour\nWork remotely:\nNo\nCOVID-19 precaution(s):\nPersonal protective equipment provided or required\nPlastic shield at work stations\nSocial distancing guidelines in place\nSanitizing, disinfecting, or cleaning procedures in place\n3 days ago\nReport job"
    ],
    [
        "Management Positions",
        "Our company provides its clients with value and unbeatable customer service with complete transparency and integrity. That's what makes us so successful. We are currently looking for service-minded individuals with good communication skills to fill several roles that include sales & customer service.\nDaily activities include Inbound and outbound calling, setting appointments, performing presentations to members of unions that request our benefits, basic computer knowledge, completing the necessary paperwork, quality control, and leadership development.\nPosition Benefits:\nExtensive training in all areas\nNo experience needed\nGreat benefits\nFast-paced, fun environment\nOur reps average between $50k-$80k first year\nLeadership development training\nGreat weekly pay and bonuses\nNote: we are an equal opportunity employer and welcome all applicants.\nDaily activities include Inbound and outbound calling, setting appointments, performing presentations to members of unions that request our benefits, basic computer knowledge, completing the necessary paperwork, quality control, and leadership development.\nWhat we are looking for in you:\nTeam player mentality\nPunctuality\nStrong customer service skills\nBasic computer skills\nFriendly personality\nDetail oriented\nEager and willing to learn\nIf you feel that you possess the qualities that we are looking for and would like to see if you are a fit for our company, apply now! We are looking to hire by the end of this week.\nI will set you up with an interview at the soonest available date.\nWe will email you back promptly, so please check your emails for a response.\n3nYeRP64Fo\n4 days ago\nReport job"
    ],
    [
        "Advisor",
        "At Lowe’s Canada, over 26,000 employees let their passion blossom every day. Our teams are driven by the desire to help people bring their projects to life and are committed to making a difference in the communities we serve.\n\nWe operate or service some 470 corporate and affiliated dealer stores. With a distinctive product and service offering and complementary store formats ranging from neighbourhood hardware stores to big box stores, our Lowe’s, RONA, Reno-Depot, and Dick’s Lumber banners are always looking for dedicated employees to help meet the needs of all DIYers and contractors.\n\nYou’ve got the talent? We’ve got the tools! Here, your work and ideas will contribute to building a flourishing organization. Your voice will always be heard and valued. You’ll find career opportunities that live up to your ambitions and be able to further develop your unique set of skills.\n\nSo if you’re looking to do what you love, and to grow and evolve within our family—one of the best employers in Canada according to a recent Forbes survey—we could be perfect for each other.\n\nYour role\nGreet customers warmly and ensure a good customer experience;\nAssess customer needs an provide expert advice on horticulture and nursery department products;\nPresent and demonstrate the product highlighting its positive features and suggest complementary products;\nMaintaining the plants;\nSupport the marketing of products in its department such as: display of merchandise, visual presentation and labelling;\nKeep up to date with new products and their functions;\nEnsure and participate in the maintenance of his department;\nBe aware of current promotions and flyers;\nDevelop a basic knowledge of all the departments in the store;\nIf required, operate a forklift, in accordance with the procedures and policies of the organization;\nComply with policies and procedures regarding loss prevention, breakage of goods and health and safety;\nPerform other duties as requested by the supervisor.\n### Job Requirements\n\nThe qualifications we are looking for\n\nDo you like physical work, without being a renovation pro? Do you have a knack for first-class customer service? You have what it takes to be in our team! ASSET: experience in customer service, plus knowledge in our Garden Centre department.\n\nYour benefits of working for Lowe’s Canada:\nBy joining the Lowe’s Canada family, you’ll enjoy many benefits, such as:\n\nA fitness centre, sports activities, and showers\nA childcare centre that can accommodate up to 78 children\nA cafeteria with a delicious menu prepared by a dedicated chef, healthy options, as well as Starbucks and Tim Hortons coffee stations\nExclusive employee discounts, plus a 10% discount on store merchandise (at all Lowe’s Canada locations)\nBenefits: retirement savings plan, annual bonuses, stock purchase plan, student incentive program, etc.\nFlexible hours and remote working\nElectric car charging stations\nCareer growth opportunities within the company\nAn inclusive and safe working environment\nPromotion of work-life balance\nAn employer that’s involved in the community\nAnd much more!\nThe masculine generic is used without discrimination and only in order to simplify the text. Lowe’s Canada is committed to encouraging diversity and inclusion. We are pleased to consider applications from all qualified candidates, regardless of race, colour, religion, sexual orientation, gender, nationality, age, disability, or any other status protected by law.\n2 days ago\nReport job"
    ],
    [
        "Utility Worker",
        "Utility Worker - Parks\nRegular Full Time\nParks, Recreation, Culture and Facilities Department\n\nOne of BC’s Top Employers, the City of Coquitlam offers meaningful career opportunities to make a difference within the local community. As the sixth largest city in BC, we are home to more than 150,000 residents. Our diverse municipality is a great place to work as it continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre. We envision a bright future in Coquitlam that we hope includes you!\n\nThe City of Coquitlam is currently recruiting for two regular full-time Utility Worker - Parks to join our team of professionals in the Parks Division. This is a CUPE Local 386 position.\n\nReporting to the Asset and Operations Manager, our Utility Worker – Parks will be responsible for performing semi-skilled manual work related to the maintenance, inspection, repair and installation of park features including playground equipment, park furniture, volleyball, tennis, basketball & ball hockey courts, lighting systems, fencing and backstops, bike track, skateboard facilities, pathways and related paved areas.\nAdditional responsibilities include maintaining routine work records through a mobile device, undertaking special projects and assignments as required and ensuring parks are clean and safe for public use.\n\nApplicants should have considerable knowledge of park amenities, furnishings, structures, and playgrounds as well as the rules and regulations governing their use. The Incumbent should also be familiar with the methods, materials, equipment and tools used in performing routine parks maintenance tasks including maintaining grounds, structures and miscellaneous parks infrastructure. Additional requirements include the ability to perform a variety of parks maintenance tasks, semi-skilled and unskilled repair work in construction, maintenance, gardening and routine natural and artificial turf and to do so under minimal supervision.\n\nThese attributes will be matched with a Grade 10 plus completion of the BC Recreation and Parks Association Playground Safety Awareness Course supplemented by completion of some basic carpentry and/or landscaping courses plus some experience in general parks maintenance and landscape work OR an equivalent combination of training and experience. Availability for weekend work and a Driver's License for the Province of British Columbia is also required.\n\nThe CUPE hourly rate of $30.54 plus an excellent benefits package is offered. Applicants under consideration will be required to undergo a police security clearance evaluation.\n\nPlease apply online at www.coquitlam.ca/careers by 11:55 pm on March 21, 2021\n\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\nCivicInfo BC\n1 day ago\nReport job"
    ],
    [
        "Hiring Full time Line cooks",
        "OUR MEGA LOCATION, Cactus Club Cafe COQUITLAM is currently hiring PREP COOKS/LINE COOKS and DISHWASHERS for Full Time Positions!!\nCactus Club Cafe is passionate about hiring the best and developing our people to their highest potential. We create leaders at every level of our organization and the potential for career growth is limitless as we continue to expand across the country.\nYOU ARE:\nAn organized and efficient team player with a strong work ethic\nPassionate about culinary arts with a focus on an exceptional guest experience\nVersed in health and safety and food preparation\nEager to learn the process of operating a busy kitchen\nWE WILL:\nHold ourselves to the highest standard as a Platinum member of Canada’s 50 Best Managed\nCompanies, a Top Employer for Young People, and one of Canada's 10 Most Admired Corporate\nCultures\nOffer flexible scheduling and 50% off your Cactus menu favourites on shift\nProvide continuous training and development opportunities\nEnsure you work with a FUN team! Check us out on Instagram\nAPPLY NOW:\nTo apply, please email your resume and DO NOT apply in person at the restaurant as due to the current Covid-19 Pandemic, we will not be able to provide you with an interview unless you have a previously scheduled appointment.\nPart-time hours: 20-40 per week\nJob Types: Full-time, Part-time\nSalary: $15.00-$21.00 per hour\nAdditional pay:\nTips\nBenefits:\nDiscounted or free food\nFlexible schedule\nOn-site parking\nPaid time off\nSchedule:\n8 hour shift\nHolidays\nNight shift\nWeekends\nCOVID-19 considerations:\nFeel free to bring this topic up during the interview as we are implementing high level of protection for all our staff and guests.\nExperience:\ncooking: 1 year (Preferred)\nWork remotely:\nNo\n30+ days ago\nReport job"
    ],
    [
        "Clerk",
        "Do you want to work for one of British Columbia's top employers? Do you empower individuals to engage and connect within their communities? If you have answered yes to these questions we want you to continue reading.\nFraser Health is responsible for the delivery of hospital and community-based health services to over 1.8 million people in 20 diverse communities from Burnaby to Fraser Canyon on the traditional territories of the Coast Salish peoples. Our team of nearly 40,000 staff, medical staff and volunteers is dedicated to serving our patients, families and communities to deliver on our vision: Better health, best in health care.\nWe hire great people for excellent jobs. We are currently recruiting for temporary full time/part time & casual clerks to join our COVID 19 Assessment and Treatment Centres. We need your help to expand our ability to deliver timely and professional services to a number of our patient care areas.\nCurrent and future opportunities may be available at the following locations:\nTri-Cities\nMaple Ridge\nBurnaby\nBuild on your career experience as you:\nRegistering new clients at our COVID 19 Assessment and Treatment Centres;\nBooks appointments, answers/directs incoming calls for staff;\nProvides administrative duties such as preparing correspondence, reports and documents;\nInputs client information, and maintains registers utilizing various software and systems; and\nPrepares various informational/resource packages by designing, updating, photocopying and collating packages/brochures for distribution.\nYour qualifications include:\nGrade 12.\nOffice Assistant Certificate and recent, related experience of six months.\nAn equivalent combination of education, training and experience is acceptable.\nIf this sounds like the ideal role for you, here are more reasons why you should apply:\nA career in a fast growing and exciting organization with professionals who are excellent in their respective fields.\nA chance to make a difference every single day in the world of health care.\nValued Benefits\nA career at Fraser Health will offer you the opportunity to be a part of a dedicated team of professionals in a dynamic and exciting health care environment.\nWork with an expert team and join our dedication to provide quality care to our patients and clients. We invite you to apply today and find out why more than 95% of new employees recommend Fraser Health to their friends and family as an excellent place to work. We value diversity in the work force and aim to maintain an environment of Respect, Care and Trust.\n30+ days ago\nReport job"
    ],
    [
        "Online Retailer Full",
        "We are a small, eCommerce company selling hobby products such as nail polish, yarn, stationery, and craft supplies. You'll primarily be picking, packing orders and applying shipping labels.\nWe're pretty relaxed as long as you work quickly you can put in some headphones and listen to music, podcasts (or audio books for those really ambitious folks).\nResponsibilities include:\nOrder Picking - picking a wide variety of small products (nail polish, makeup, skincare, yarn etc.)\nOrder Packing - taping boxes, wrapping products in bubble wrap, packing products securely (working mostly with small items)\nPreparing shipments and shipping via Canada Post and UPS (entering addresses, printing & sticking labels)\nRestocking and organizing inventory\nOther duties as needed\nQualifications:\nAble to work independently\nVery organized\nExcellent attention to detail\nSelf motivated\nFast packer and good with their hands (working with lots of small items)\nStrong communication skills\nWork Hours:\nMonday to Friday - 7:30am to 4:00pm\nJob Types: Full-time, Permanent\nSalary: $15.00-$16.00 per hour\nJob Types: Full-time, Permanent\nSalary: $15.00-$16.00 per hour\nSchedule:\n8 hour shift\n24 days ago\nReport job"
    ],
    [
        "FULL TIME Early Morning Crew Member 6",
        "Company Description\nLocally owned and operated McDonalds restaurant, TYGO Enterprises Ltd, is looking to hire people who want to work as Full Time/Part Time.\nLooking for Members that are interested in working in the service area or kitchen.\nAvailable anytime weekdays and weekends\nWeekdays are in High Demand,\n\nAdditional Information\nStarting rate of $15.00 , potential for more with experience\nCompetitive Pay\n50% food discount across Canada on all other days\nPerformance Evaluations Every 6 Months\nFree uniform pants and t-shirts for comfort\nFlexible Schedule\n27 days ago\nReport job"
    ],
    [
        "Production Worker",
        "We are hiring a Production Worker for the fixed afternoon shift (Monday - Friday), no experience necessary, we will train you.\nThis position reports directly to the Line Leaders, Production Supervisor, and/or Production Manager.\nWhy work for us?\n100% company paid employee family benefit coverage including\nExtended health\nPrescription drugs and eyeglass coverage\nDental benefits\nPaid sick leave\nExtra paid days off at Christmas\nLife/Ad & D and Long-term disability benefits\nFun events\nSolid $$ allowances for use of our own products & fitness membership incentives\nGrowth within the company\nResponsibilities:\nFollow the required company SOP’s, GMP’s, and Health and Safety Standards\nMaintain cleanliness & sanitation of equipment and assigned area; this job involves cleaning\nEnsure accuracy of all production data including dates, labels, and packaging\nEnsure the product being packed is in the right proper container, tray, bag, box\nCross-training to rotate through various positions on the line\nOther duties as assigned\nKnowledge, Skills, & Abilities:\nMust have CSA approved safety boots and be able to do repetitive work\nFrequent lifting of up to 45 lbs\nShould not have any allergies to dust, dairy, whey, or nut products\nMust be able to keep up the pace with others on the line and use all of the tools and equipment\nJob Types: Full-time, Permanent, Work hours 2:30 pm to 11 pm\nSalary: Day -$15.50 per hour, Afternoon – $16.50\nJob Types: Full-time, Permanent\nSalary: $16.50 per hour\nBenefits:\nCasual dress\nCompany events\nDental care\nDiscounted or free food\nEmployee assistance program\nExtended health care\nOn-site parking\nPaid time off\nVision care\nSchedule:\n8 hour shift\nMonday to Friday\nWork remotely:\nNo\nCOVID-19 precaution(s):\nPersonal protective equipment provided or required\nTemperature screenings\nSocial distancing guidelines in place\nSanitizing, disinfecting, or cleaning procedures in place\n1 day ago\nReport job"
    ],
    [
        "Tire Technician",
        "Tire Technician - Seasonal (Training Provided)\n\nAre you looking for a job that offers excellent training opportunities, hands-on skills & the chance to help people get back on the road?\n\nWe’re hiring seasonal part-time and full-time tire technicians.\n\nAs one of our tire technicians, you get to take part in Kal Tire’s world-class training program and mentorship so you can help our customers enjoy the road safely. Enjoy the chance to be active, use your hands and make things happen for our customers every day.\n\nYou’ll also get to be a part of our culture of safety, because we’re as passionate about safety as we are about delivering outstanding service experiences.\n\nGrow your resume and your skills with a great company that cares about you!\n\nThis role is for the Kal Tire Store located in 2573 RUNNEL DR\nCOQUITLAM, BC V3E 1S3\n\nJoin our seasonal team today!\n4 days ago\nReport job"
    ],
    [
        "line cook",
        "Cook Categories\nLine cook\nWork Setting\nRestaurant\nSpecific Skills\nInspect kitchens and food service areas\nPrepare and cook special meals for patients as instructed by dietitian or chef\nClean kitchen and work areas\nPrepare and cook complete meals or individual dishes and foods\nWork Conditions and Physical Capabilities\nFast-paced environment\nWork under pressure\nRepetitive tasks\nAttention to detail\nStanding for extended periods\nPersonal Suitability\nInitiative\nFlexibility\nTeam player\nClient focus\nJudgement\nReliability\nOrganized\nCanadian Job Bank\n30+ days ago\nReport job"
    ],
    [
        "pastry maker",
        "Additional Skills\nRequisition or order materials, equipment and supplies\nOrganize and maintain inventory\nOversee sales and merchandising of baked goods\nWork Setting\nBake shop\nSpecific Skills\nPrepare special orders\nInspect kitchen and food service areas\nEnsure that the quality of products meets established standards\nBake mixed dough and batters\nPrepare dough for pies, bread, rolls and sweet goods, batters for muffins, cookies and cakes and icings and frostings according to recipes or special customer orders\nOperate machinery\nWork Conditions and Physical Capabilities\nFast-paced environment\nWork under pressure\nRepetitive tasks\nHandling heavy loads\nPhysically demanding\nManual dexterity\nAttention to detail\nHand-eye co-ordination\nAbility to distinguish between colours\nStanding for extended periods\nTight deadlines\nOvertime required\nWork Location Information\nIn shop\nFood Specialties\nDesserts and pastries\nBreads and rolls\nPersonal Suitability\nAccurate\nTeam player\nExcellent oral communication\nClient focus\nDependability\nJudgement\nReliability\nCanadian Job Bank\n9 days ago\nReport job"
    ],
    [
        "Management Positions",
        "Our company provides its clients with value and unbeatable customer service with complete transparency and integrity. That's what makes us so successful. We are currently looking for service-minded individuals with good communication skills to fill several roles that include sales & customer service.\nDaily activities include Inbound and outbound calling, setting appointments, performing presentations to members of unions that request our benefits, basic computer knowledge, completing the necessary paperwork, quality control, and leadership development.\nPosition Benefits:\nExtensive training in all areas\nNo experience needed\nGreat benefits\nFast-paced, fun environment\nOur reps average between $50k-$80k first year\nLeadership development training\nGreat weekly pay and bonuses\nNote: we are an equal opportunity employer and welcome all applicants.\nDaily activities include Inbound and outbound calling, setting appointments, performing presentations to members of unions that request our benefits, basic computer knowledge, completing the necessary paperwork, quality control, and leadership development.\nWhat we are looking for in you:\nTeam player mentality\nPunctuality\nStrong customer service skills\nBasic computer skills\nFriendly personality\nDetail oriented\nEager and willing to learn\nIf you feel that you possess the qualities that we are looking for and would like to see if you are a fit for our company, apply now! We are looking to hire by the end of this week.\nI will set you up with an interview at the soonest available date.\nWe will email you back promptly, so please check your emails for a response.\n3nYeRP64Fo\n4 days ago\nReport job"
    ],
    [
        "Kitchen H",
        "Cook\nTrain staff in preparation, cooking and handling of food\nSupervise kitchen staff and helpers\nOrder supplies and equipment\nManage kitchen operations\nClean kitchen and work areas\nMaintain inventory and records of food, supplies and equipment\nPrepare and cook complete meals or individual dishes and food\nWash dishes, pots, utensils, etc.....\nPart-time hours: 20-50 per week\nJob Types: Full-time, Part-time\nSalary: $14.60-$20.00 per hour\nExperience:\nCulinary: 1 year (Preferred)\ncooking: 1 year (Preferred)\nLicence/Certification:\nFood Safe, SafeCheck, Food Handler or equivalent (Preferred)\nJob Duties:\nFollow recipes and presentation specifications\nClean and maintain station in practicing good safety and sanitation\nOversee kitchen operations\nMaintain inventory and record of food, supplies and equipment\nAdditional Duties:\nRecording food temperature\nPreparing reports\nWork remotely:\nNo\nCOVID-19 precaution(s):\nSanitizing, disinfecting, or cleaning procedures in place\nJust posted\nReport job"
    ],
    [
        "Utility Worker",
        "Utility Worker - Parks\nRegular Full Time\nParks, Recreation, Culture and Facilities Department\n\nOne of BC’s Top Employers, the City of Coquitlam offers meaningful career opportunities to make a difference within the local community. As the sixth largest city in BC, we are home to more than 150,000 residents. Our diverse municipality is a great place to work as it continues to grow through innovative urban design, inspiring arts, culture and recreation programs, and state-of-the-art transportation systems. Our brand is built on managing our resources in a responsible and sustainable manner, while supporting a vibrant, growing regional urban centre. We envision a bright future in Coquitlam that we hope includes you!\n\nThe City of Coquitlam is currently recruiting for two regular full-time Utility Worker - Parks to join our team of professionals in the Parks Division. This is a CUPE Local 386 position.\n\nReporting to the Asset and Operations Manager, our Utility Worker – Parks will be responsible for performing semi-skilled manual work related to the maintenance, inspection, repair and installation of park features including playground equipment, park furniture, volleyball, tennis, basketball & ball hockey courts, lighting systems, fencing and backstops, bike track, skateboard facilities, pathways and related paved areas.\nAdditional responsibilities include maintaining routine work records through a mobile device, undertaking special projects and assignments as required and ensuring parks are clean and safe for public use.\n\nApplicants should have considerable knowledge of park amenities, furnishings, structures, and playgrounds as well as the rules and regulations governing their use. The Incumbent should also be familiar with the methods, materials, equipment and tools used in performing routine parks maintenance tasks including maintaining grounds, structures and miscellaneous parks infrastructure. Additional requirements include the ability to perform a variety of parks maintenance tasks, semi-skilled and unskilled repair work in construction, maintenance, gardening and routine natural and artificial turf and to do so under minimal supervision.\n\nThese attributes will be matched with a Grade 10 plus completion of the BC Recreation and Parks Association Playground Safety Awareness Course supplemented by completion of some basic carpentry and/or landscaping courses plus some experience in general parks maintenance and landscape work OR an equivalent combination of training and experience. Availability for weekend work and a Driver's License for the Province of British Columbia is also required.\n\nThe CUPE hourly rate of $30.54 plus an excellent benefits package is offered. Applicants under consideration will be required to undergo a police security clearance evaluation.\n\nPlease apply online at www.coquitlam.ca/careers by 11:55 pm on March 21, 2021\n\nThe City of Coquitlam is an Equal Opportunity Employer.\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted.\nCivicInfo BC\n1 day ago\nReport job"
    ],
    [
        "Seasonal Parks Labourers",
        "Job Number:\nJ0221-1693\nJob Title:\nSeasonal Parks Labourers\nJob Type:\nTemporary Full-Time\nEmployment Group:\nCUPE Outside\nDate Posted:\nFebruary 24, 2021\nClosing Date:\nMarch 14, 2021\nJob Category:\nParks\nCity:\nPort Moody\nProvince / State:\nBritish Columbia\nSalary Range:\n$27.45 - $29.54/Hour\nThe City of Port Moody is looking for enthusiastic, hard-working individuals to provide temporary, full-time, seasonal labour assistance to the Parks & Environment department. These positions will perform basic maintenance work (including operating a variety of small equipment / trucks) and related duties, as well as emergency work, while following operational and safety procedures.\nThis is routine manual work entailing considerable physical effort and agility in the safe performance of a variety of unskilled and semi-skilled jobs such as turf and field maintenance, irrigation system maintenance, parks maintenance, landscape maintenance, the maintenance of playgrounds and spray parks, invasive plant removal, and the cleaning of public areas and facilities. The Labourer will drive and operate a variety of equipment while performing tasks such as grass cutting, weeding and litter collection. This position also assists with emergency maintenance and repairs. Labourers may be assigned to tasks based on their experience and operational need.\nVarious start dates between March and June, working to approximately October 15, 2021. Please note that employment with the City of Port Moody is subject to the receipt of a satisfactory police information check as well as a satisfactory driver's abstract.\nThe City of Port Moody strives to be an employer of choice and offers an excellent benefits package as well as professional development opportunities.\n\nBasic Qualifications\nGrade 12 education plus a minimum of six months of job-related experience including experience such as:\nExperience using a various types of machinery on construction and landscape sites\nExperience in the maintenance of parks, sports fields, irrigation systems, and playgrounds\nExperience with traffic control, snow removal, flood control and other emergency response\nExperience with landscaping, horticultural tasks\nExperience with restoration projects in natural areas\nKnowledge of a/ ability to identify invasive plants and an interest in invasive plant removal\nSelf-motivated with excellent interpersonal skills\nAbility to operate a variety of small equipment safely and efficiently\nSufficient physical strength, stamina and coordination to permit the performance of heavy manual outdoor work in all weather conditions\nValid Class 5 Driver's License (not \"N\")\n9 days ago\nReport job"
    ],
    [
        "Clerk",
        "Do you want to work for one of British Columbia's top employers? Do you empower individuals to engage and connect within their communities? If you have answered yes to these questions we want you to continue reading.\nFraser Health is responsible for the delivery of hospital and community-based health services to over 1.8 million people in 20 diverse communities from Burnaby to Fraser Canyon on the traditional territories of the Coast Salish peoples. Our team of nearly 40,000 staff, medical staff and volunteers is dedicated to serving our patients, families and communities to deliver on our vision: Better health, best in health care.\nWe hire great people for excellent jobs. We are currently recruiting for temporary full time and temporary part time clerks to join our COVID 19 Assessment and Treatment Centres. In order to be a successful candidate for this positon you will need 7 days of availability as this position is on rotation . We need your help to expand our ability to deliver timely and professional services to a number of our patient care areas.\nCurrent and future opportunities may be available at the following locations:\nSurrey\nCoquitlam\nAbbotsford\nBuild on your career experience as you:\nRegistering new clients at our COVID 19 Assessment and Treatment Centres;\nBooks appointments, answers/directs incoming calls for staff;\nProvides administrative duties such as preparing correspondence, reports and documents;\nInputs client information, and maintains registers utilizing various software and systems; and\nPrepares various informational/resource packages by designing, updating, photocopying and collating packages/brochures for distribution.\nYour qualifications include:\nGrade 12.\nOffice Assistant Certificate and recent, related experience of six months.\nAn equivalent combination of education, training and experience is acceptable.\nIf this sounds like the ideal role for you, here are more reasons why you should apply:\nA career in a fast growing and exciting organization with professionals who are excellent in their respective fields.\nA chance to make a difference every single day in the world of health care.\nValued Benefits\nA career at Fraser Health will offer you the opportunity to be a part of a dedicated team of professionals in a dynamic and exciting health care environment.\nWork with an expert team and join our dedication to provide quality care to our patients and clients. We invite you to apply today and find out why more than 95% of new employees recommend Fraser Health to their friends and family as an excellent place to work. We value diversity in the work force and aim to maintain an environment of Respect, Care and Trust.\n10 days ago\nReport job"
    ],
    [
        "Packager",
        "Packager\n\nVitacore Industries, https://vitacore.ca/, manufactures personal protective equipment for Canadian frontline workers. We are proud to be the first and only Canadian Company to be approved by Health Canada to produce the CAN95 and CAN99 medical-grade respirators, which has tested at a higher filtration rate than the NIOSH standard currently in place.\n\nThe role is a regular full-time position for the following shift:\nMonday through Friday, 8 a.m. to 4:00 p.m.; includes a 30-minute paid break.\n\nFull benefits after successful completion of a 3-month probation period.\n\nJob responsibilities:\nPulls and packs product base on daily orders.\nMeet specifics of customer orders in timely manner.\nKeep products separated, organized and in good rotation.\nMonitors product quality frequently, reporting problems to mitigate safety issues.\nReports any mechanical problems.\nUtilizes continuous improvement mindset and assists in identifying opportunities to improve process.\nFollows good manufacturing practices and required work safe practices.\nMaintains a clean, sanitary and safe work area.\nKeep track of inventory.\nPerforms other duties as assigned.\n\nQualifications/Skills:\nScanning and sorting outgoing stock.\nPulling, packing and loading.\nReceiving, stocking and stacking.\nExcellent attention to details.\nExcellent organizational skills.\n3 days ago\nReport job"
    ],
    [
        "Retail Warehouse",
        "Retail Warehouse & Production Associates\nWho we are:\nValue Village is a part of the Savers family of stores. We are a for-profit, global thrift retailer offering great quality, gently used clothing, accessories and household goods. Our Rethink Reuse business model of purchasing, reselling and recycling gives communities a smart way to shop and keeps more than 700 million pounds of used goods from landfills each year. We also help more than 100 nonprofit organizations by purchasing donated goods from them, which provides a source of revenue to help support their vital community programs and services.\nWe operate over 300 locations. Our brands are Value Village (in Canada and the U.S.), Village des Valeurs (in Quebec), Savers (in the U.S), Unique (in the U.S.) and Savers Australia.\nSummary & Positions:\nAt Value Village our Retail Warehouse & Production Associates create an awesome experience for our Customers, Donors and other Team Members. We are hiring for both Full Time and Part Time positions which may include:\nRetail Merchandise Sorters & Pricers\nInventory Receivers, Processors & Stockers\nMaterial Handlers & Recyclers\nWarehouse Production Associates\nCommunity Donation Center Ambassadors\n\nWhat you can expect:\nA commitment to protecting the health and safety of our Team Members. Great benefits, paid training, career development, bonus opportunities, a competitive wage, and a 50% Team Member discount. Our Team is a great one, made up of people from many different backgrounds, experiences, and perspectives, all with something special to contribute. You’ll positively impact Team Members, Customers, Donors, Your Community, and the Environment.\nValue Village is an Equal Opportunity Employer.\n\nGeneral Labour\n\n540 Clarke Rd Coquitlam, BC V3J 3X5\n30+ days ago\nReport job"
    ],
    [
        "early childhood educator assistant",
        "Credentials (certificates, licences, memberships, courses, etc.)\nChild development assistant (ECE level 1)\nEarly Childhood Educator Assistant Skills\nDiscuss progress and problems of children at staff meetings\nBathe, diaper and feed infants and toddlers\nSupport early childhood educators in carrying out programs that promote the physical, cognitive, emotional and social development of children\nEngage children in activities by telling stories, teaching songs and preparing crafts\nPrepare snacks and arrange rooms or furniture for lunch and rest periods\nSubmit written observations on children to early childhood educators or supervisors\nChildren's Ages\n5 years\n1 year\n2 years\n3 years\n4 years\nAdditional Skills\nMaintain daycare equipment and assist in housekeeping and cooking duties\nAssist early childhood educators or supervisors in keeping records\nPlan and organize activities for school-age children in child-care programs before and after regular school hours\nWork Setting\nDay care centre or nursery school\nChild care centre\nWork Site Environment\nNon-smoking\nWork Conditions and Physical Capabilities\nCombination of sitting, standing, walking\nBending, crouching, kneeling\nWork Location Information\nUrban area\nPersonal Suitability\nFlexibility\nTeam player\nDependability\nValues and ethics\nReliability\nPunctuality\nCanadian Job Bank\n30+ days ago\nReport job"
    ],
    [
        "Hiring Hosts",
        "Are you outgoing? Good at multitasking? Like being part of a fun, busy atmosphere? Then send in your resume, as this is the place for you!\n\nApplicants should be able to work a variety of shifts, days, nights and weekends.\n86network.com\n24 days ago\nReport job"
    ],
    [
        "tobacco packer",
        "Weight Handling\nUp to 23 kg (50 lbs)\nWork Setting\nTobacco processing plant\nSpecific Skills\nRemove filled containers from conveyors\nManually pack goods into bags and boxes or other containers\nFeed and unload processing machines\nFeed flattened boxes into forming machines to construct containers\nClean machines and immediate work areas\nCheck products and packaging for basic quality defects\nAssist process control and machine operators in performing their duties\nTransport raw materials, finished products and packaging materials\nMeasure and dump ingredients into hoppers of mixing and grinding machines\nSecurity and Safety\nCriminal record check\nWork Conditions and Physical Capabilities\nFast-paced environment\nWork under pressure\nRepetitive tasks\nHandling heavy loads\nPhysically demanding\nManual dexterity\nAttention to detail\nStanding for extended periods\nBending, crouching, kneeling\nPersonal Suitability\nEffective interpersonal skills\nFlexibility\nTeam player\nClient focus\nReliability\nCanadian Job Bank\n6 days ago\nReport job"
    ],
    [
        "Golf Course Maintenance",
        "Position: Seasonal Labourer\nFacility: Golden Eagle Golf Club is a 36 hole facility located in Pitt Meadows, BC.\nJob Description:\n· Early start times starting at 5:00 am May – August\n· Flexible start date/end date for those in college/high school\n· Primarily outside work, requiring occasional heavy lifting\n· Will be required to work on a shift basis, including weekends and holidays\n· Good communication skills are required\n· Ability to meet deadlines with limited supervision\nJob Responsibilities include, but are not limited to:\n· Daily set up of the golf course including; pin placement, tee set up, and traffic control\n· Maintenance of pond banks, cart paths, trees and brush removal\n· Maintaining and raking sand bunkers\n· Mowing tasks for those with previous experience\nCompensation:\n· Starting wage $16.00 per hour – additional compensation based on relevant work experience\n· Discounts on merchandise, food\n· Golfing privileges\nPart-time hours: 20-40 per week\nJob Types: Full-time, Part-time, Casual\nSalary: From $16.00 per hour\nBenefits:\nDiscounted or free food\nStore discount\nSchedule:\n8 hour shift\nHolidays\nWeekends\nCOVID-19 precaution(s):\nSocial distancing guidelines in place\nSanitizing, disinfecting, or cleaning procedures in place\n4 days ago\nReport job"
    ]
]